XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/glb_reg.h
/**
  ******************************************************************************
  * @file    glb_reg.h
  * @version V1.0
  * @date    2021-09-10
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __GLB_REG_H__
#define __GLB_REG_H__

#include "bl606p.h"

/* 0x0 : soc_info0 */
#define GLB_SOC_INFO0_OFFSET (0x0)
#define GLB_CHIP_RDY         GLB_CHIP_RDY
#define GLB_CHIP_RDY_POS     (27U)
#define GLB_CHIP_RDY_LEN     (1U)
#define GLB_CHIP_RDY_MSK     (((1U << GLB_CHIP_RDY_LEN) - 1) << GLB_CHIP_RDY_POS)
#define GLB_CHIP_RDY_UMSK    (~(((1U << GLB_CHIP_RDY_LEN) - 1) << GLB_CHIP_RDY_POS))
#define GLB_ID               GLB_ID
#define GLB_ID_POS           (28U)
#define GLB_ID_LEN           (4U)
#define GLB_ID_MSK           (((1U << GLB_ID_LEN) - 1) << GLB_ID_POS)
#define GLB_ID_UMSK          (~(((1U << GLB_ID_LEN) - 1) << GLB_ID_POS))

/* 0x50 : core_cfg16 */
#define GLB_CORE_CFG16_OFFSET (0x50)
#define GLB_NP_INT_STA0       GLB_NP_INT_STA0
#define GLB_NP_INT_STA0_POS   (0U)
#define GLB_NP_INT_STA0_LEN   (32U)
#define GLB_NP_INT_STA0_MSK   (((1U << GLB_NP_INT_STA0_LEN) - 1) << GLB_NP_INT_STA0_POS)
#define GLB_NP_INT_STA0_UMSK  (~(((1U << GLB_NP_INT_STA0_LEN) - 1) << GLB_NP_INT_STA0_POS))

/* 0x54 : core_cfg17 */
#define GLB_CORE_CFG17_OFFSET (0x54)
#define GLB_NP_INT_STA1       GLB_NP_INT_STA1
#define GLB_NP_INT_STA1_POS   (0U)
#define GLB_NP_INT_STA1_LEN   (32U)
#define GLB_NP_INT_STA1_MSK   (((1U << GLB_NP_INT_STA1_LEN) - 1) << GLB_NP_INT_STA1_POS)
#define GLB_NP_INT_STA1_UMSK  (~(((1U << GLB_NP_INT_STA1_LEN) - 1) << GLB_NP_INT_STA1_POS))

/* 0x58 : core_cfg18 */
#define GLB_CORE_CFG18_OFFSET (0x58)
#define GLB_NP_INT_MASK0      GLB_NP_INT_MASK0
#define GLB_NP_INT_MASK0_POS  (0U)
#define GLB_NP_INT_MASK0_LEN  (32U)
#define GLB_NP_INT_MASK0_MSK  (((1U << GLB_NP_INT_MASK0_LEN) - 1) << GLB_NP_INT_MASK0_POS)
#define GLB_NP_INT_MASK0_UMSK (~(((1U << GLB_NP_INT_MASK0_LEN) - 1) << GLB_NP_INT_MASK0_POS))

/* 0x5C : core_cfg19 */
#define GLB_CORE_CFG19_OFFSET (0x5C)
#define GLB_NP_INT_MASK1      GLB_NP_INT_MASK1
#define GLB_NP_INT_MASK1_POS  (0U)
#define GLB_NP_INT_MASK1_LEN  (32U)
#define GLB_NP_INT_MASK1_MSK  (((1U << GLB_NP_INT_MASK1_LEN) - 1) << GLB_NP_INT_MASK1_POS)
#define GLB_NP_INT_MASK1_UMSK (~(((1U << GLB_NP_INT_MASK1_LEN) - 1) << GLB_NP_INT_MASK1_POS))

/* 0x60 : core_cfg20 */
#define GLB_CORE_CFG20_OFFSET (0x60)
#define GLB_NP_INT_CLR0       GLB_NP_INT_CLR0
#define GLB_NP_INT_CLR0_POS   (0U)
#define GLB_NP_INT_CLR0_LEN   (32U)
#define GLB_NP_INT_CLR0_MSK   (((1U << GLB_NP_INT_CLR0_LEN) - 1) << GLB_NP_INT_CLR0_POS)
#define GLB_NP_INT_CLR0_UMSK  (~(((1U << GLB_NP_INT_CLR0_LEN) - 1) << GLB_NP_INT_CLR0_POS))

/* 0x64 : core_cfg21 */
#define GLB_CORE_CFG21_OFFSET (0x64)
#define GLB_NP_INT_CLR1       GLB_NP_INT_CLR1
#define GLB_NP_INT_CLR1_POS   (0U)
#define GLB_NP_INT_CLR1_LEN   (32U)
#define GLB_NP_INT_CLR1_MSK   (((1U << GLB_NP_INT_CLR1_LEN) - 1) << GLB_NP_INT_CLR1_POS)
#define GLB_NP_INT_CLR1_UMSK  (~(((1U << GLB_NP_INT_CLR1_LEN) - 1) << GLB_NP_INT_CLR1_POS))

/* 0x68 : core_cfg22 */
#define GLB_CORE_CFG22_OFFSET     (0x68)
#define GLB_REG_E902_INT_EN0      GLB_REG_E902_INT_EN0
#define GLB_REG_E902_INT_EN0_POS  (0U)
#define GLB_REG_E902_INT_EN0_LEN  (32U)
#define GLB_REG_E902_INT_EN0_MSK  (((1U << GLB_REG_E902_INT_EN0_LEN) - 1) << GLB_REG_E902_INT_EN0_POS)
#define GLB_REG_E902_INT_EN0_UMSK (~(((1U << GLB_REG_E902_INT_EN0_LEN) - 1) << GLB_REG_E902_INT_EN0_POS))

/* 0x6C : core_cfg23 */
#define GLB_CORE_CFG23_OFFSET     (0x6C)
#define GLB_REG_E902_INT_EN1      GLB_REG_E902_INT_EN1
#define GLB_REG_E902_INT_EN1_POS  (0U)
#define GLB_REG_E902_INT_EN1_LEN  (32U)
#define GLB_REG_E902_INT_EN1_MSK  (((1U << GLB_REG_E902_INT_EN1_LEN) - 1) << GLB_REG_E902_INT_EN1_POS)
#define GLB_REG_E902_INT_EN1_UMSK (~(((1U << GLB_REG_E902_INT_EN1_LEN) - 1) << GLB_REG_E902_INT_EN1_POS))

/* 0x70 : core_cfg24 */
#define GLB_CORE_CFG24_OFFSET       (0x70)
#define GLB_STS_E902_INT_BUS_0      GLB_STS_E902_INT_BUS_0
#define GLB_STS_E902_INT_BUS_0_POS  (0U)
#define GLB_STS_E902_INT_BUS_0_LEN  (32U)
#define GLB_STS_E902_INT_BUS_0_MSK  (((1U << GLB_STS_E902_INT_BUS_0_LEN) - 1) << GLB_STS_E902_INT_BUS_0_POS)
#define GLB_STS_E902_INT_BUS_0_UMSK (~(((1U << GLB_STS_E902_INT_BUS_0_LEN) - 1) << GLB_STS_E902_INT_BUS_0_POS))

/* 0x74 : core_cfg25 */
#define GLB_CORE_CFG25_OFFSET       (0x74)
#define GLB_STS_E902_INT_BUS_1      GLB_STS_E902_INT_BUS_1
#define GLB_STS_E902_INT_BUS_1_POS  (0U)
#define GLB_STS_E902_INT_BUS_1_LEN  (32U)
#define GLB_STS_E902_INT_BUS_1_MSK  (((1U << GLB_STS_E902_INT_BUS_1_LEN) - 1) << GLB_STS_E902_INT_BUS_1_POS)
#define GLB_STS_E902_INT_BUS_1_UMSK (~(((1U << GLB_STS_E902_INT_BUS_1_LEN) - 1) << GLB_STS_E902_INT_BUS_1_POS))

