XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/glb_reg.h
/* 0x180 : i2c_cfg0 */
#define GLB_I2C_CFG0_OFFSET  (0x180)
#define GLB_I2C_CLK_DIV      GLB_I2C_CLK_DIV
#define GLB_I2C_CLK_DIV_POS  (16U)
#define GLB_I2C_CLK_DIV_LEN  (8U)
#define GLB_I2C_CLK_DIV_MSK  (((1U << GLB_I2C_CLK_DIV_LEN) - 1) << GLB_I2C_CLK_DIV_POS)
#define GLB_I2C_CLK_DIV_UMSK (~(((1U << GLB_I2C_CLK_DIV_LEN) - 1) << GLB_I2C_CLK_DIV_POS))
#define GLB_I2C_CLK_EN       GLB_I2C_CLK_EN
#define GLB_I2C_CLK_EN_POS   (24U)
#define GLB_I2C_CLK_EN_LEN   (1U)
#define GLB_I2C_CLK_EN_MSK   (((1U << GLB_I2C_CLK_EN_LEN) - 1) << GLB_I2C_CLK_EN_POS)
#define GLB_I2C_CLK_EN_UMSK  (~(((1U << GLB_I2C_CLK_EN_LEN) - 1) << GLB_I2C_CLK_EN_POS))
#define GLB_I2C_CLK_SEL      GLB_I2C_CLK_SEL
#define GLB_I2C_CLK_SEL_POS  (25U)
#define GLB_I2C_CLK_SEL_LEN  (1U)
#define GLB_I2C_CLK_SEL_MSK  (((1U << GLB_I2C_CLK_SEL_LEN) - 1) << GLB_I2C_CLK_SEL_POS)
#define GLB_I2C_CLK_SEL_UMSK (~(((1U << GLB_I2C_CLK_SEL_LEN) - 1) << GLB_I2C_CLK_SEL_POS))

/* 0x190 : i2s_cfg0 */
#define GLB_I2S_CFG0_OFFSET             (0x190)
#define GLB_REG_I2S_REF_CLK_DIV         GLB_REG_I2S_REF_CLK_DIV
#define GLB_REG_I2S_REF_CLK_DIV_POS     (0U)
#define GLB_REG_I2S_REF_CLK_DIV_LEN     (6U)
#define GLB_REG_I2S_REF_CLK_DIV_MSK     (((1U << GLB_REG_I2S_REF_CLK_DIV_LEN) - 1) << GLB_REG_I2S_REF_CLK_DIV_POS)
#define GLB_REG_I2S_REF_CLK_DIV_UMSK    (~(((1U << GLB_REG_I2S_REF_CLK_DIV_LEN) - 1) << GLB_REG_I2S_REF_CLK_DIV_POS))
#define GLB_REG_I2S_DI_REF_CLK_SEL      GLB_REG_I2S_DI_REF_CLK_SEL
#define GLB_REG_I2S_DI_REF_CLK_SEL_POS  (6U)
#define GLB_REG_I2S_DI_REF_CLK_SEL_LEN  (1U)
#define GLB_REG_I2S_DI_REF_CLK_SEL_MSK  (((1U << GLB_REG_I2S_DI_REF_CLK_SEL_LEN) - 1) << GLB_REG_I2S_DI_REF_CLK_SEL_POS)
#define GLB_REG_I2S_DI_REF_CLK_SEL_UMSK (~(((1U << GLB_REG_I2S_DI_REF_CLK_SEL_LEN) - 1) << GLB_REG_I2S_DI_REF_CLK_SEL_POS))
#define GLB_REG_I2S_REF_CLK_EN          GLB_REG_I2S_REF_CLK_EN
#define GLB_REG_I2S_REF_CLK_EN_POS      (7U)
#define GLB_REG_I2S_REF_CLK_EN_LEN      (1U)
#define GLB_REG_I2S_REF_CLK_EN_MSK      (((1U << GLB_REG_I2S_REF_CLK_EN_LEN) - 1) << GLB_REG_I2S_REF_CLK_EN_POS)
#define GLB_REG_I2S_REF_CLK_EN_UMSK     (~(((1U << GLB_REG_I2S_REF_CLK_EN_LEN) - 1) << GLB_REG_I2S_REF_CLK_EN_POS))
#define GLB_REG_I2S_DO_REF_CLK_SEL      GLB_REG_I2S_DO_REF_CLK_SEL
#define GLB_REG_I2S_DO_REF_CLK_SEL_POS  (8U)
#define GLB_REG_I2S_DO_REF_CLK_SEL_LEN  (1U)
#define GLB_REG_I2S_DO_REF_CLK_SEL_MSK  (((1U << GLB_REG_I2S_DO_REF_CLK_SEL_LEN) - 1) << GLB_REG_I2S_DO_REF_CLK_SEL_POS)
#define GLB_REG_I2S_DO_REF_CLK_SEL_UMSK (~(((1U << GLB_REG_I2S_DO_REF_CLK_SEL_LEN) - 1) << GLB_REG_I2S_DO_REF_CLK_SEL_POS))

/* 0x1B0 : spi_cfg0 */
#define GLB_SPI_CFG0_OFFSET   (0x1B0)
#define GLB_SPI_CLK_DIV       GLB_SPI_CLK_DIV
#define GLB_SPI_CLK_DIV_POS   (0U)
#define GLB_SPI_CLK_DIV_LEN   (5U)
#define GLB_SPI_CLK_DIV_MSK   (((1U << GLB_SPI_CLK_DIV_LEN) - 1) << GLB_SPI_CLK_DIV_POS)
#define GLB_SPI_CLK_DIV_UMSK  (~(((1U << GLB_SPI_CLK_DIV_LEN) - 1) << GLB_SPI_CLK_DIV_POS))
#define GLB_SPI_CLK_EN        GLB_SPI_CLK_EN
#define GLB_SPI_CLK_EN_POS    (8U)
#define GLB_SPI_CLK_EN_LEN    (1U)
#define GLB_SPI_CLK_EN_MSK    (((1U << GLB_SPI_CLK_EN_LEN) - 1) << GLB_SPI_CLK_EN_POS)
#define GLB_SPI_CLK_EN_UMSK   (~(((1U << GLB_SPI_CLK_EN_LEN) - 1) << GLB_SPI_CLK_EN_POS))
#define GLB_SPI_CLK_SEL       GLB_SPI_CLK_SEL
#define GLB_SPI_CLK_SEL_POS   (9U)
#define GLB_SPI_CLK_SEL_LEN   (1U)
#define GLB_SPI_CLK_SEL_MSK   (((1U << GLB_SPI_CLK_SEL_LEN) - 1) << GLB_SPI_CLK_SEL_POS)
#define GLB_SPI_CLK_SEL_UMSK  (~(((1U << GLB_SPI_CLK_SEL_LEN) - 1) << GLB_SPI_CLK_SEL_POS))
#define GLB_SPI_SWAP_SET      GLB_SPI_SWAP_SET
#define GLB_SPI_SWAP_SET_POS  (16U)
#define GLB_SPI_SWAP_SET_LEN  (4U)
#define GLB_SPI_SWAP_SET_MSK  (((1U << GLB_SPI_SWAP_SET_LEN) - 1) << GLB_SPI_SWAP_SET_POS)
#define GLB_SPI_SWAP_SET_UMSK (~(((1U << GLB_SPI_SWAP_SET_LEN) - 1) << GLB_SPI_SWAP_SET_POS))

/* 0x1C0 : qdec_cfg0 */
#define GLB_QDEC_CFG0_OFFSET (0x1C0)

/* 0x1D0 : pwm_cfg0 */
#define GLB_PWM_CFG0_OFFSET      (0x1D0)
#define GLB_REG_PWM1_IO_SEL      GLB_REG_PWM1_IO_SEL
#define GLB_REG_PWM1_IO_SEL_POS  (0U)
#define GLB_REG_PWM1_IO_SEL_LEN  (1U)
#define GLB_REG_PWM1_IO_SEL_MSK  (((1U << GLB_REG_PWM1_IO_SEL_LEN) - 1) << GLB_REG_PWM1_IO_SEL_POS)
#define GLB_REG_PWM1_IO_SEL_UMSK (~(((1U << GLB_REG_PWM1_IO_SEL_LEN) - 1) << GLB_REG_PWM1_IO_SEL_POS))
#define GLB_REG_PWM2_IO_SEL      GLB_REG_PWM2_IO_SEL
#define GLB_REG_PWM2_IO_SEL_POS  (1U)
#define GLB_REG_PWM2_IO_SEL_LEN  (1U)
#define GLB_REG_PWM2_IO_SEL_MSK  (((1U << GLB_REG_PWM2_IO_SEL_LEN) - 1) << GLB_REG_PWM2_IO_SEL_POS)
#define GLB_REG_PWM2_IO_SEL_UMSK (~(((1U << GLB_REG_PWM2_IO_SEL_LEN) - 1) << GLB_REG_PWM2_IO_SEL_POS))

/* 0x1E0 : pdm_cfg0 */
#define GLB_PDM_CFG0_OFFSET     (0x1E0)
#define GLB_REG_PDM_IO_SEL      GLB_REG_PDM_IO_SEL
#define GLB_REG_PDM_IO_SEL_POS  (0U)
#define GLB_REG_PDM_IO_SEL_LEN  (1U)
#define GLB_REG_PDM_IO_SEL_MSK  (((1U << GLB_REG_PDM_IO_SEL_LEN) - 1) << GLB_REG_PDM_IO_SEL_POS)
#define GLB_REG_PDM_IO_SEL_UMSK (~(((1U << GLB_REG_PDM_IO_SEL_LEN) - 1) << GLB_REG_PDM_IO_SEL_POS))

/* 0x250 : dig_clk_cfg0 */
#define GLB_DIG_CLK_CFG0_OFFSET         (0x250)
#define GLB_DIG_32K_DIV                 GLB_DIG_32K_DIV
#define GLB_DIG_32K_DIV_POS             (0U)
#define GLB_DIG_32K_DIV_LEN             (11U)
#define GLB_DIG_32K_DIV_MSK             (((1U << GLB_DIG_32K_DIV_LEN) - 1) << GLB_DIG_32K_DIV_POS)
#define GLB_DIG_32K_DIV_UMSK            (~(((1U << GLB_DIG_32K_DIV_LEN) - 1) << GLB_DIG_32K_DIV_POS))
#define GLB_DIG_32K_EN                  GLB_DIG_32K_EN
#define GLB_DIG_32K_EN_POS              (12U)
#define GLB_DIG_32K_EN_LEN              (1U)
#define GLB_DIG_32K_EN_MSK              (((1U << GLB_DIG_32K_EN_LEN) - 1) << GLB_DIG_32K_EN_POS)
#define GLB_DIG_32K_EN_UMSK             (~(((1U << GLB_DIG_32K_EN_LEN) - 1) << GLB_DIG_32K_EN_POS))
#define GLB_DIG_32K_COMP                GLB_DIG_32K_COMP
#define GLB_DIG_32K_COMP_POS            (13U)
#define GLB_DIG_32K_COMP_LEN            (1U)
#define GLB_DIG_32K_COMP_MSK            (((1U << GLB_DIG_32K_COMP_LEN) - 1) << GLB_DIG_32K_COMP_POS)
#define GLB_DIG_32K_COMP_UMSK           (~(((1U << GLB_DIG_32K_COMP_LEN) - 1) << GLB_DIG_32K_COMP_POS))
#define GLB_DIG_512K_DIV                GLB_DIG_512K_DIV
#define GLB_DIG_512K_DIV_POS            (16U)
#define GLB_DIG_512K_DIV_LEN            (7U)
#define GLB_DIG_512K_DIV_MSK            (((1U << GLB_DIG_512K_DIV_LEN) - 1) << GLB_DIG_512K_DIV_POS)
#define GLB_DIG_512K_DIV_UMSK           (~(((1U << GLB_DIG_512K_DIV_LEN) - 1) << GLB_DIG_512K_DIV_POS))
#define GLB_DIG_512K_EN                 GLB_DIG_512K_EN
#define GLB_DIG_512K_EN_POS             (24U)
#define GLB_DIG_512K_EN_LEN             (1U)
#define GLB_DIG_512K_EN_MSK             (((1U << GLB_DIG_512K_EN_LEN) - 1) << GLB_DIG_512K_EN_POS)
#define GLB_DIG_512K_EN_UMSK            (~(((1U << GLB_DIG_512K_EN_LEN) - 1) << GLB_DIG_512K_EN_POS))
#define GLB_DIG_512K_COMP               GLB_DIG_512K_COMP
#define GLB_DIG_512K_COMP_POS           (25U)
#define GLB_DIG_512K_COMP_LEN           (1U)
#define GLB_DIG_512K_COMP_MSK           (((1U << GLB_DIG_512K_COMP_LEN) - 1) << GLB_DIG_512K_COMP_POS)
#define GLB_DIG_512K_COMP_UMSK          (~(((1U << GLB_DIG_512K_COMP_LEN) - 1) << GLB_DIG_512K_COMP_POS))
#define GLB_DIG_CLK_SRC_SEL             GLB_DIG_CLK_SRC_SEL
#define GLB_DIG_CLK_SRC_SEL_POS         (28U)
#define GLB_DIG_CLK_SRC_SEL_LEN         (2U)
#define GLB_DIG_CLK_SRC_SEL_MSK         (((1U << GLB_DIG_CLK_SRC_SEL_LEN) - 1) << GLB_DIG_CLK_SRC_SEL_POS)
#define GLB_DIG_CLK_SRC_SEL_UMSK        (~(((1U << GLB_DIG_CLK_SRC_SEL_LEN) - 1) << GLB_DIG_CLK_SRC_SEL_POS))
#define GLB_REG_EN_PLATFORM_WAKEUP      GLB_REG_EN_PLATFORM_WAKEUP
#define GLB_REG_EN_PLATFORM_WAKEUP_POS  (31U)
#define GLB_REG_EN_PLATFORM_WAKEUP_LEN  (1U)
#define GLB_REG_EN_PLATFORM_WAKEUP_MSK  (((1U << GLB_REG_EN_PLATFORM_WAKEUP_LEN) - 1) << GLB_REG_EN_PLATFORM_WAKEUP_POS)
#define GLB_REG_EN_PLATFORM_WAKEUP_UMSK (~(((1U << GLB_REG_EN_PLATFORM_WAKEUP_LEN) - 1) << GLB_REG_EN_PLATFORM_WAKEUP_POS))

/* 0x254 : dig_clk_cfg1 */
#define GLB_DIG_CLK_CFG1_OFFSET          (0x254)
#define GLB_REG_MM_MUXPLL_160M_SEL       GLB_REG_MM_MUXPLL_160M_SEL
#define GLB_REG_MM_MUXPLL_160M_SEL_POS   (0U)
#define GLB_REG_MM_MUXPLL_160M_SEL_LEN   (1U)
#define GLB_REG_MM_MUXPLL_160M_SEL_MSK   (((1U << GLB_REG_MM_MUXPLL_160M_SEL_LEN) - 1) << GLB_REG_MM_MUXPLL_160M_SEL_POS)
#define GLB_REG_MM_MUXPLL_160M_SEL_UMSK  (~(((1U << GLB_REG_MM_MUXPLL_160M_SEL_LEN) - 1) << GLB_REG_MM_MUXPLL_160M_SEL_POS))
#define GLB_REG_MM_MUXPLL_240M_SEL       GLB_REG_MM_MUXPLL_240M_SEL
#define GLB_REG_MM_MUXPLL_240M_SEL_POS   (1U)
#define GLB_REG_MM_MUXPLL_240M_SEL_LEN   (1U)
#define GLB_REG_MM_MUXPLL_240M_SEL_MSK   (((1U << GLB_REG_MM_MUXPLL_240M_SEL_LEN) - 1) << GLB_REG_MM_MUXPLL_240M_SEL_POS)
#define GLB_REG_MM_MUXPLL_240M_SEL_UMSK  (~(((1U << GLB_REG_MM_MUXPLL_240M_SEL_LEN) - 1) << GLB_REG_MM_MUXPLL_240M_SEL_POS))
#define GLB_REG_MM_MUXPLL_320M_SEL       GLB_REG_MM_MUXPLL_320M_SEL
#define GLB_REG_MM_MUXPLL_320M_SEL_POS   (2U)
#define GLB_REG_MM_MUXPLL_320M_SEL_LEN   (1U)
#define GLB_REG_MM_MUXPLL_320M_SEL_MSK   (((1U << GLB_REG_MM_MUXPLL_320M_SEL_LEN) - 1) << GLB_REG_MM_MUXPLL_320M_SEL_POS)
#define GLB_REG_MM_MUXPLL_320M_SEL_UMSK  (~(((1U << GLB_REG_MM_MUXPLL_320M_SEL_LEN) - 1) << GLB_REG_MM_MUXPLL_320M_SEL_POS))
#define GLB_REG_TOP_MUXPLL_80M_SEL       GLB_REG_TOP_MUXPLL_80M_SEL
#define GLB_REG_TOP_MUXPLL_80M_SEL_POS   (8U)
#define GLB_REG_TOP_MUXPLL_80M_SEL_LEN   (2U)
#define GLB_REG_TOP_MUXPLL_80M_SEL_MSK   (((1U << GLB_REG_TOP_MUXPLL_80M_SEL_LEN) - 1) << GLB_REG_TOP_MUXPLL_80M_SEL_POS)
#define GLB_REG_TOP_MUXPLL_80M_SEL_UMSK  (~(((1U << GLB_REG_TOP_MUXPLL_80M_SEL_LEN) - 1) << GLB_REG_TOP_MUXPLL_80M_SEL_POS))
#define GLB_REG_TOP_MUXPLL_160M_SEL      GLB_REG_TOP_MUXPLL_160M_SEL
#define GLB_REG_TOP_MUXPLL_160M_SEL_POS  (10U)
#define GLB_REG_TOP_MUXPLL_160M_SEL_LEN  (2U)
#define GLB_REG_TOP_MUXPLL_160M_SEL_MSK  (((1U << GLB_REG_TOP_MUXPLL_160M_SEL_LEN) - 1) << GLB_REG_TOP_MUXPLL_160M_SEL_POS)
#define GLB_REG_TOP_MUXPLL_160M_SEL_UMSK (~(((1U << GLB_REG_TOP_MUXPLL_160M_SEL_LEN) - 1) << GLB_REG_TOP_MUXPLL_160M_SEL_POS))

/* 0x258 : dig_clk_cfg2 */
#define GLB_DIG_CLK_CFG2_OFFSET      (0x258)
#define GLB_CHIP_CLK_OUT_0_SEL       GLB_CHIP_CLK_OUT_0_SEL
#define GLB_CHIP_CLK_OUT_0_SEL_POS   (0U)
#define GLB_CHIP_CLK_OUT_0_SEL_LEN   (2U)
#define GLB_CHIP_CLK_OUT_0_SEL_MSK   (((1U << GLB_CHIP_CLK_OUT_0_SEL_LEN) - 1) << GLB_CHIP_CLK_OUT_0_SEL_POS)
#define GLB_CHIP_CLK_OUT_0_SEL_UMSK  (~(((1U << GLB_CHIP_CLK_OUT_0_SEL_LEN) - 1) << GLB_CHIP_CLK_OUT_0_SEL_POS))
#define GLB_CHIP_CLK_OUT_1_SEL       GLB_CHIP_CLK_OUT_1_SEL
#define GLB_CHIP_CLK_OUT_1_SEL_POS   (2U)
#define GLB_CHIP_CLK_OUT_1_SEL_LEN   (2U)
#define GLB_CHIP_CLK_OUT_1_SEL_MSK   (((1U << GLB_CHIP_CLK_OUT_1_SEL_LEN) - 1) << GLB_CHIP_CLK_OUT_1_SEL_POS)
#define GLB_CHIP_CLK_OUT_1_SEL_UMSK  (~(((1U << GLB_CHIP_CLK_OUT_1_SEL_LEN) - 1) << GLB_CHIP_CLK_OUT_1_SEL_POS))
#define GLB_CHIP_CLK_OUT_2_SEL       GLB_CHIP_CLK_OUT_2_SEL
#define GLB_CHIP_CLK_OUT_2_SEL_POS   (4U)
#define GLB_CHIP_CLK_OUT_2_SEL_LEN   (2U)
#define GLB_CHIP_CLK_OUT_2_SEL_MSK   (((1U << GLB_CHIP_CLK_OUT_2_SEL_LEN) - 1) << GLB_CHIP_CLK_OUT_2_SEL_POS)
#define GLB_CHIP_CLK_OUT_2_SEL_UMSK  (~(((1U << GLB_CHIP_CLK_OUT_2_SEL_LEN) - 1) << GLB_CHIP_CLK_OUT_2_SEL_POS))
#define GLB_CHIP_CLK_OUT_3_SEL       GLB_CHIP_CLK_OUT_3_SEL
#define GLB_CHIP_CLK_OUT_3_SEL_POS   (6U)
#define GLB_CHIP_CLK_OUT_3_SEL_LEN   (2U)
#define GLB_CHIP_CLK_OUT_3_SEL_MSK   (((1U << GLB_CHIP_CLK_OUT_3_SEL_LEN) - 1) << GLB_CHIP_CLK_OUT_3_SEL_POS)
#define GLB_CHIP_CLK_OUT_3_SEL_UMSK  (~(((1U << GLB_CHIP_CLK_OUT_3_SEL_LEN) - 1) << GLB_CHIP_CLK_OUT_3_SEL_POS))
#define GLB_CHIP_CLK_OUT_0_EN        GLB_CHIP_CLK_OUT_0_EN
#define GLB_CHIP_CLK_OUT_0_EN_POS    (8U)
#define GLB_CHIP_CLK_OUT_0_EN_LEN    (1U)
#define GLB_CHIP_CLK_OUT_0_EN_MSK    (((1U << GLB_CHIP_CLK_OUT_0_EN_LEN) - 1) << GLB_CHIP_CLK_OUT_0_EN_POS)
#define GLB_CHIP_CLK_OUT_0_EN_UMSK   (~(((1U << GLB_CHIP_CLK_OUT_0_EN_LEN) - 1) << GLB_CHIP_CLK_OUT_0_EN_POS))
#define GLB_CHIP_CLK_OUT_1_EN        GLB_CHIP_CLK_OUT_1_EN
#define GLB_CHIP_CLK_OUT_1_EN_POS    (9U)
#define GLB_CHIP_CLK_OUT_1_EN_LEN    (1U)
#define GLB_CHIP_CLK_OUT_1_EN_MSK    (((1U << GLB_CHIP_CLK_OUT_1_EN_LEN) - 1) << GLB_CHIP_CLK_OUT_1_EN_POS)
#define GLB_CHIP_CLK_OUT_1_EN_UMSK   (~(((1U << GLB_CHIP_CLK_OUT_1_EN_LEN) - 1) << GLB_CHIP_CLK_OUT_1_EN_POS))
#define GLB_CHIP_CLK_OUT_2_EN        GLB_CHIP_CLK_OUT_2_EN
#define GLB_CHIP_CLK_OUT_2_EN_POS    (10U)
#define GLB_CHIP_CLK_OUT_2_EN_LEN    (1U)
#define GLB_CHIP_CLK_OUT_2_EN_MSK    (((1U << GLB_CHIP_CLK_OUT_2_EN_LEN) - 1) << GLB_CHIP_CLK_OUT_2_EN_POS)
#define GLB_CHIP_CLK_OUT_2_EN_UMSK   (~(((1U << GLB_CHIP_CLK_OUT_2_EN_LEN) - 1) << GLB_CHIP_CLK_OUT_2_EN_POS))
#define GLB_CHIP_CLK_OUT_3_EN        GLB_CHIP_CLK_OUT_3_EN
#define GLB_CHIP_CLK_OUT_3_EN_POS    (11U)
#define GLB_CHIP_CLK_OUT_3_EN_LEN    (1U)
#define GLB_CHIP_CLK_OUT_3_EN_MSK    (((1U << GLB_CHIP_CLK_OUT_3_EN_LEN) - 1) << GLB_CHIP_CLK_OUT_3_EN_POS)
#define GLB_CHIP_CLK_OUT_3_EN_UMSK   (~(((1U << GLB_CHIP_CLK_OUT_3_EN_LEN) - 1) << GLB_CHIP_CLK_OUT_3_EN_POS))
#define GLB_GPIO_TMR_CLK_SEL         GLB_GPIO_TMR_CLK_SEL
#define GLB_GPIO_TMR_CLK_SEL_POS     (12U)
#define GLB_GPIO_TMR_CLK_SEL_LEN     (2U)
#define GLB_GPIO_TMR_CLK_SEL_MSK     (((1U << GLB_GPIO_TMR_CLK_SEL_LEN) - 1) << GLB_GPIO_TMR_CLK_SEL_POS)
#define GLB_GPIO_TMR_CLK_SEL_UMSK    (~(((1U << GLB_GPIO_TMR_CLK_SEL_LEN) - 1) << GLB_GPIO_TMR_CLK_SEL_POS))
#define GLB_GPIO_MM_TMR_CLK_SEL      GLB_GPIO_MM_TMR_CLK_SEL
#define GLB_GPIO_MM_TMR_CLK_SEL_POS  (14U)
#define GLB_GPIO_MM_TMR_CLK_SEL_LEN  (2U)
#define GLB_GPIO_MM_TMR_CLK_SEL_MSK  (((1U << GLB_GPIO_MM_TMR_CLK_SEL_LEN) - 1) << GLB_GPIO_MM_TMR_CLK_SEL_POS)
#define GLB_GPIO_MM_TMR_CLK_SEL_UMSK (~(((1U << GLB_GPIO_MM_TMR_CLK_SEL_LEN) - 1) << GLB_GPIO_MM_TMR_CLK_SEL_POS))

