XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/glb_reg.h
/* 0x25C : dig_clk_cfg3 */
#define GLB_DIG_CLK_CFG3_OFFSET   (0x25C)
#define GLB_DSI_TXCLKESC_SEL      GLB_DSI_TXCLKESC_SEL
#define GLB_DSI_TXCLKESC_SEL_POS  (0U)
#define GLB_DSI_TXCLKESC_SEL_LEN  (1U)
#define GLB_DSI_TXCLKESC_SEL_MSK  (((1U << GLB_DSI_TXCLKESC_SEL_LEN) - 1) << GLB_DSI_TXCLKESC_SEL_POS)
#define GLB_DSI_TXCLKESC_SEL_UMSK (~(((1U << GLB_DSI_TXCLKESC_SEL_LEN) - 1) << GLB_DSI_TXCLKESC_SEL_POS))
#define GLB_CSI_TXCLKESC_SEL      GLB_CSI_TXCLKESC_SEL
#define GLB_CSI_TXCLKESC_SEL_POS  (1U)
#define GLB_CSI_TXCLKESC_SEL_LEN  (1U)
#define GLB_CSI_TXCLKESC_SEL_MSK  (((1U << GLB_CSI_TXCLKESC_SEL_LEN) - 1) << GLB_CSI_TXCLKESC_SEL_POS)
#define GLB_CSI_TXCLKESC_SEL_UMSK (~(((1U << GLB_CSI_TXCLKESC_SEL_LEN) - 1) << GLB_CSI_TXCLKESC_SEL_POS))

/* 0x260 : rf_cfg0 */
#define GLB_RF_CFG0_OFFSET              (0x260)
#define GLB_CFG_INV_RF2_TEST_CLK_O      GLB_CFG_INV_RF2_TEST_CLK_O
#define GLB_CFG_INV_RF2_TEST_CLK_O_POS  (9U)
#define GLB_CFG_INV_RF2_TEST_CLK_O_LEN  (1U)
#define GLB_CFG_INV_RF2_TEST_CLK_O_MSK  (((1U << GLB_CFG_INV_RF2_TEST_CLK_O_LEN) - 1) << GLB_CFG_INV_RF2_TEST_CLK_O_POS)
#define GLB_CFG_INV_RF2_TEST_CLK_O_UMSK (~(((1U << GLB_CFG_INV_RF2_TEST_CLK_O_LEN) - 1) << GLB_CFG_INV_RF2_TEST_CLK_O_POS))

/* 0x2E0 : dbg_cfg0 */
#define GLB_DBG_CFG0_OFFSET      (0x2E0)
#define GLB_REG_DBG_LL_CTRL      GLB_REG_DBG_LL_CTRL
#define GLB_REG_DBG_LL_CTRL_POS  (0U)
#define GLB_REG_DBG_LL_CTRL_LEN  (30U)
#define GLB_REG_DBG_LL_CTRL_MSK  (((1U << GLB_REG_DBG_LL_CTRL_LEN) - 1) << GLB_REG_DBG_LL_CTRL_POS)
#define GLB_REG_DBG_LL_CTRL_UMSK (~(((1U << GLB_REG_DBG_LL_CTRL_LEN) - 1) << GLB_REG_DBG_LL_CTRL_POS))
#define GLB_REG_DBG_LL_SEL       GLB_REG_DBG_LL_SEL
#define GLB_REG_DBG_LL_SEL_POS   (30U)
#define GLB_REG_DBG_LL_SEL_LEN   (2U)
#define GLB_REG_DBG_LL_SEL_MSK   (((1U << GLB_REG_DBG_LL_SEL_LEN) - 1) << GLB_REG_DBG_LL_SEL_POS)
#define GLB_REG_DBG_LL_SEL_UMSK  (~(((1U << GLB_REG_DBG_LL_SEL_LEN) - 1) << GLB_REG_DBG_LL_SEL_POS))

/* 0x2E4 : dbg_cfg1 */
#define GLB_DBG_CFG1_OFFSET      (0x2E4)
#define GLB_REG_DBG_LH_CTRL      GLB_REG_DBG_LH_CTRL
#define GLB_REG_DBG_LH_CTRL_POS  (0U)
#define GLB_REG_DBG_LH_CTRL_LEN  (30U)
#define GLB_REG_DBG_LH_CTRL_MSK  (((1U << GLB_REG_DBG_LH_CTRL_LEN) - 1) << GLB_REG_DBG_LH_CTRL_POS)
#define GLB_REG_DBG_LH_CTRL_UMSK (~(((1U << GLB_REG_DBG_LH_CTRL_LEN) - 1) << GLB_REG_DBG_LH_CTRL_POS))
#define GLB_REG_DBG_LH_SEL       GLB_REG_DBG_LH_SEL
#define GLB_REG_DBG_LH_SEL_POS   (30U)
#define GLB_REG_DBG_LH_SEL_LEN   (2U)
#define GLB_REG_DBG_LH_SEL_MSK   (((1U << GLB_REG_DBG_LH_SEL_LEN) - 1) << GLB_REG_DBG_LH_SEL_POS)
#define GLB_REG_DBG_LH_SEL_UMSK  (~(((1U << GLB_REG_DBG_LH_SEL_LEN) - 1) << GLB_REG_DBG_LH_SEL_POS))

/* 0x2E8 : dbg_cfg2 */
#define GLB_DBG_CFG2_OFFSET      (0x2E8)
#define GLB_REG_DBG_HL_CTRL      GLB_REG_DBG_HL_CTRL
#define GLB_REG_DBG_HL_CTRL_POS  (0U)
#define GLB_REG_DBG_HL_CTRL_LEN  (30U)
#define GLB_REG_DBG_HL_CTRL_MSK  (((1U << GLB_REG_DBG_HL_CTRL_LEN) - 1) << GLB_REG_DBG_HL_CTRL_POS)
#define GLB_REG_DBG_HL_CTRL_UMSK (~(((1U << GLB_REG_DBG_HL_CTRL_LEN) - 1) << GLB_REG_DBG_HL_CTRL_POS))
#define GLB_REG_DBG_HL_SEL       GLB_REG_DBG_HL_SEL
#define GLB_REG_DBG_HL_SEL_POS   (30U)
#define GLB_REG_DBG_HL_SEL_LEN   (2U)
#define GLB_REG_DBG_HL_SEL_MSK   (((1U << GLB_REG_DBG_HL_SEL_LEN) - 1) << GLB_REG_DBG_HL_SEL_POS)
#define GLB_REG_DBG_HL_SEL_UMSK  (~(((1U << GLB_REG_DBG_HL_SEL_LEN) - 1) << GLB_REG_DBG_HL_SEL_POS))

/* 0x2EC : dbg_cfg3 */
#define GLB_DBG_CFG3_OFFSET      (0x2EC)
#define GLB_REG_DBG_HH_CTRL      GLB_REG_DBG_HH_CTRL
#define GLB_REG_DBG_HH_CTRL_POS  (0U)
#define GLB_REG_DBG_HH_CTRL_LEN  (30U)
#define GLB_REG_DBG_HH_CTRL_MSK  (((1U << GLB_REG_DBG_HH_CTRL_LEN) - 1) << GLB_REG_DBG_HH_CTRL_POS)
#define GLB_REG_DBG_HH_CTRL_UMSK (~(((1U << GLB_REG_DBG_HH_CTRL_LEN) - 1) << GLB_REG_DBG_HH_CTRL_POS))
#define GLB_REG_DBG_HH_SEL       GLB_REG_DBG_HH_SEL
#define GLB_REG_DBG_HH_SEL_POS   (30U)
#define GLB_REG_DBG_HH_SEL_LEN   (2U)
#define GLB_REG_DBG_HH_SEL_MSK   (((1U << GLB_REG_DBG_HH_SEL_LEN) - 1) << GLB_REG_DBG_HH_SEL_POS)
#define GLB_REG_DBG_HH_SEL_UMSK  (~(((1U << GLB_REG_DBG_HH_SEL_LEN) - 1) << GLB_REG_DBG_HH_SEL_POS))

/* 0x2F0 : dbg_cfg4 */
#define GLB_DBG_CFG4_OFFSET (0x2F0)
#define GLB_DEBUG_OE        GLB_DEBUG_OE
#define GLB_DEBUG_OE_POS    (0U)
#define GLB_DEBUG_OE_LEN    (1U)
#define GLB_DEBUG_OE_MSK    (((1U << GLB_DEBUG_OE_LEN) - 1) << GLB_DEBUG_OE_POS)
#define GLB_DEBUG_OE_UMSK   (~(((1U << GLB_DEBUG_OE_LEN) - 1) << GLB_DEBUG_OE_POS))
#define GLB_DEBUG_I         GLB_DEBUG_I
#define GLB_DEBUG_I_POS     (1U)
#define GLB_DEBUG_I_LEN     (31U)
#define GLB_DEBUG_I_MSK     (((1U << GLB_DEBUG_I_LEN) - 1) << GLB_DEBUG_I_POS)
#define GLB_DEBUG_I_UMSK    (~(((1U << GLB_DEBUG_I_LEN) - 1) << GLB_DEBUG_I_POS))

/* 0x300 : mbist_cfg0 */
#define GLB_MBIST_CFG0_OFFSET (0x300)
#define GLB_MBIST_MODE        GLB_MBIST_MODE
#define GLB_MBIST_MODE_POS    (0U)
#define GLB_MBIST_MODE_LEN    (1U)
#define GLB_MBIST_MODE_MSK    (((1U << GLB_MBIST_MODE_LEN) - 1) << GLB_MBIST_MODE_POS)
#define GLB_MBIST_MODE_UMSK   (~(((1U << GLB_MBIST_MODE_LEN) - 1) << GLB_MBIST_MODE_POS))

/* 0x320 : bmx_cfg0 */
#define GLB_BMX_CFG0_OFFSET          (0x320)
#define GLB_REG_BMX_TIMEOUT_EN       GLB_REG_BMX_TIMEOUT_EN
#define GLB_REG_BMX_TIMEOUT_EN_POS   (0U)
#define GLB_REG_BMX_TIMEOUT_EN_LEN   (5U)
#define GLB_REG_BMX_TIMEOUT_EN_MSK   (((1U << GLB_REG_BMX_TIMEOUT_EN_LEN) - 1) << GLB_REG_BMX_TIMEOUT_EN_POS)
#define GLB_REG_BMX_TIMEOUT_EN_UMSK  (~(((1U << GLB_REG_BMX_TIMEOUT_EN_LEN) - 1) << GLB_REG_BMX_TIMEOUT_EN_POS))
#define GLB_REG_BMX_ARB_MODE         GLB_REG_BMX_ARB_MODE
#define GLB_REG_BMX_ARB_MODE_POS     (5U)
#define GLB_REG_BMX_ARB_MODE_LEN     (1U)
#define GLB_REG_BMX_ARB_MODE_MSK     (((1U << GLB_REG_BMX_ARB_MODE_LEN) - 1) << GLB_REG_BMX_ARB_MODE_POS)
#define GLB_REG_BMX_ARB_MODE_UMSK    (~(((1U << GLB_REG_BMX_ARB_MODE_LEN) - 1) << GLB_REG_BMX_ARB_MODE_POS))
#define GLB_REG_BMX_TIMEOUT_CLR      GLB_REG_BMX_TIMEOUT_CLR
#define GLB_REG_BMX_TIMEOUT_CLR_POS  (6U)
#define GLB_REG_BMX_TIMEOUT_CLR_LEN  (1U)
#define GLB_REG_BMX_TIMEOUT_CLR_MSK  (((1U << GLB_REG_BMX_TIMEOUT_CLR_LEN) - 1) << GLB_REG_BMX_TIMEOUT_CLR_POS)
#define GLB_REG_BMX_TIMEOUT_CLR_UMSK (~(((1U << GLB_REG_BMX_TIMEOUT_CLR_LEN) - 1) << GLB_REG_BMX_TIMEOUT_CLR_POS))
#define GLB_REG_H_WTHRE_HW2EXT       GLB_REG_H_WTHRE_HW2EXT
#define GLB_REG_H_WTHRE_HW2EXT_POS   (7U)
#define GLB_REG_H_WTHRE_HW2EXT_LEN   (2U)
#define GLB_REG_H_WTHRE_HW2EXT_MSK   (((1U << GLB_REG_H_WTHRE_HW2EXT_LEN) - 1) << GLB_REG_H_WTHRE_HW2EXT_POS)
#define GLB_REG_H_WTHRE_HW2EXT_UMSK  (~(((1U << GLB_REG_H_WTHRE_HW2EXT_LEN) - 1) << GLB_REG_H_WTHRE_HW2EXT_POS))
#define GLB_BMX_BUSY_OPTION_DIS      GLB_BMX_BUSY_OPTION_DIS
#define GLB_BMX_BUSY_OPTION_DIS_POS  (9U)
#define GLB_BMX_BUSY_OPTION_DIS_LEN  (1U)
#define GLB_BMX_BUSY_OPTION_DIS_MSK  (((1U << GLB_BMX_BUSY_OPTION_DIS_LEN) - 1) << GLB_BMX_BUSY_OPTION_DIS_POS)
#define GLB_BMX_BUSY_OPTION_DIS_UMSK (~(((1U << GLB_BMX_BUSY_OPTION_DIS_LEN) - 1) << GLB_BMX_BUSY_OPTION_DIS_POS))
#define GLB_BMX_GATING_DIS           GLB_BMX_GATING_DIS
#define GLB_BMX_GATING_DIS_POS       (10U)
#define GLB_BMX_GATING_DIS_LEN       (1U)
#define GLB_BMX_GATING_DIS_MSK       (((1U << GLB_BMX_GATING_DIS_LEN) - 1) << GLB_BMX_GATING_DIS_POS)
#define GLB_BMX_GATING_DIS_UMSK      (~(((1U << GLB_BMX_GATING_DIS_LEN) - 1) << GLB_BMX_GATING_DIS_POS))
#define GLB_STS_BMX_TIMEOUT_STS      GLB_STS_BMX_TIMEOUT_STS
#define GLB_STS_BMX_TIMEOUT_STS_POS  (11U)
#define GLB_STS_BMX_TIMEOUT_STS_LEN  (5U)
#define GLB_STS_BMX_TIMEOUT_STS_MSK  (((1U << GLB_STS_BMX_TIMEOUT_STS_LEN) - 1) << GLB_STS_BMX_TIMEOUT_STS_POS)
#define GLB_STS_BMX_TIMEOUT_STS_UMSK (~(((1U << GLB_STS_BMX_TIMEOUT_STS_LEN) - 1) << GLB_STS_BMX_TIMEOUT_STS_POS))
#define GLB_PDS_APB_CFG              GLB_PDS_APB_CFG
#define GLB_PDS_APB_CFG_POS          (16U)
#define GLB_PDS_APB_CFG_LEN          (8U)
#define GLB_PDS_APB_CFG_MSK          (((1U << GLB_PDS_APB_CFG_LEN) - 1) << GLB_PDS_APB_CFG_POS)
#define GLB_PDS_APB_CFG_UMSK         (~(((1U << GLB_PDS_APB_CFG_LEN) - 1) << GLB_PDS_APB_CFG_POS))
#define GLB_HBN_APB_CFG              GLB_HBN_APB_CFG
#define GLB_HBN_APB_CFG_POS          (24U)
#define GLB_HBN_APB_CFG_LEN          (8U)
#define GLB_HBN_APB_CFG_MSK          (((1U << GLB_HBN_APB_CFG_LEN) - 1) << GLB_HBN_APB_CFG_POS)
#define GLB_HBN_APB_CFG_UMSK         (~(((1U << GLB_HBN_APB_CFG_LEN) - 1) << GLB_HBN_APB_CFG_POS))

