XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/glb_reg.h
/* 0x324 : bmx_cfg1 */
#define GLB_BMX_CFG1_OFFSET          (0x324)
#define GLB_REG_BMX_BERR_INT_EN      GLB_REG_BMX_BERR_INT_EN
#define GLB_REG_BMX_BERR_INT_EN_POS  (0U)
#define GLB_REG_BMX_BERR_INT_EN_LEN  (1U)
#define GLB_REG_BMX_BERR_INT_EN_MSK  (((1U << GLB_REG_BMX_BERR_INT_EN_LEN) - 1) << GLB_REG_BMX_BERR_INT_EN_POS)
#define GLB_REG_BMX_BERR_INT_EN_UMSK (~(((1U << GLB_REG_BMX_BERR_INT_EN_LEN) - 1) << GLB_REG_BMX_BERR_INT_EN_POS))
#define GLB_REG_MCU_BERR_INT_EN      GLB_REG_MCU_BERR_INT_EN
#define GLB_REG_MCU_BERR_INT_EN_POS  (1U)
#define GLB_REG_MCU_BERR_INT_EN_LEN  (1U)
#define GLB_REG_MCU_BERR_INT_EN_MSK  (((1U << GLB_REG_MCU_BERR_INT_EN_LEN) - 1) << GLB_REG_MCU_BERR_INT_EN_POS)
#define GLB_REG_MCU_BERR_INT_EN_UMSK (~(((1U << GLB_REG_MCU_BERR_INT_EN_LEN) - 1) << GLB_REG_MCU_BERR_INT_EN_POS))
#define GLB_REG_BMX_QOS_CPU          GLB_REG_BMX_QOS_CPU
#define GLB_REG_BMX_QOS_CPU_POS      (16U)
#define GLB_REG_BMX_QOS_CPU_LEN      (1U)
#define GLB_REG_BMX_QOS_CPU_MSK      (((1U << GLB_REG_BMX_QOS_CPU_LEN) - 1) << GLB_REG_BMX_QOS_CPU_POS)
#define GLB_REG_BMX_QOS_CPU_UMSK     (~(((1U << GLB_REG_BMX_QOS_CPU_LEN) - 1) << GLB_REG_BMX_QOS_CPU_POS))
#define GLB_REG_BMX_QOS_SDU          GLB_REG_BMX_QOS_SDU
#define GLB_REG_BMX_QOS_SDU_POS      (17U)
#define GLB_REG_BMX_QOS_SDU_LEN      (1U)
#define GLB_REG_BMX_QOS_SDU_MSK      (((1U << GLB_REG_BMX_QOS_SDU_LEN) - 1) << GLB_REG_BMX_QOS_SDU_POS)
#define GLB_REG_BMX_QOS_SDU_UMSK     (~(((1U << GLB_REG_BMX_QOS_SDU_LEN) - 1) << GLB_REG_BMX_QOS_SDU_POS))
#define GLB_REG_BMX_QOS_SEC0         GLB_REG_BMX_QOS_SEC0
#define GLB_REG_BMX_QOS_SEC0_POS     (18U)
#define GLB_REG_BMX_QOS_SEC0_LEN     (1U)
#define GLB_REG_BMX_QOS_SEC0_MSK     (((1U << GLB_REG_BMX_QOS_SEC0_LEN) - 1) << GLB_REG_BMX_QOS_SEC0_POS)
#define GLB_REG_BMX_QOS_SEC0_UMSK    (~(((1U << GLB_REG_BMX_QOS_SEC0_LEN) - 1) << GLB_REG_BMX_QOS_SEC0_POS))
#define GLB_REG_BMX_QOS_SEC1         GLB_REG_BMX_QOS_SEC1
#define GLB_REG_BMX_QOS_SEC1_POS     (19U)
#define GLB_REG_BMX_QOS_SEC1_LEN     (1U)
#define GLB_REG_BMX_QOS_SEC1_MSK     (((1U << GLB_REG_BMX_QOS_SEC1_LEN) - 1) << GLB_REG_BMX_QOS_SEC1_POS)
#define GLB_REG_BMX_QOS_SEC1_UMSK    (~(((1U << GLB_REG_BMX_QOS_SEC1_LEN) - 1) << GLB_REG_BMX_QOS_SEC1_POS))
#define GLB_REG_BMX_QOS_SEC2         GLB_REG_BMX_QOS_SEC2
#define GLB_REG_BMX_QOS_SEC2_POS     (20U)
#define GLB_REG_BMX_QOS_SEC2_LEN     (1U)
#define GLB_REG_BMX_QOS_SEC2_MSK     (((1U << GLB_REG_BMX_QOS_SEC2_LEN) - 1) << GLB_REG_BMX_QOS_SEC2_POS)
#define GLB_REG_BMX_QOS_SEC2_UMSK    (~(((1U << GLB_REG_BMX_QOS_SEC2_LEN) - 1) << GLB_REG_BMX_QOS_SEC2_POS))
#define GLB_REG_BMX_QOS_DMA          GLB_REG_BMX_QOS_DMA
#define GLB_REG_BMX_QOS_DMA_POS      (21U)
#define GLB_REG_BMX_QOS_DMA_LEN      (1U)
#define GLB_REG_BMX_QOS_DMA_MSK      (((1U << GLB_REG_BMX_QOS_DMA_LEN) - 1) << GLB_REG_BMX_QOS_DMA_POS)
#define GLB_REG_BMX_QOS_DMA_UMSK     (~(((1U << GLB_REG_BMX_QOS_DMA_LEN) - 1) << GLB_REG_BMX_QOS_DMA_POS))
#define GLB_REG_BMX_QOS_CCI          GLB_REG_BMX_QOS_CCI
#define GLB_REG_BMX_QOS_CCI_POS      (22U)
#define GLB_REG_BMX_QOS_CCI_LEN      (1U)
#define GLB_REG_BMX_QOS_CCI_MSK      (((1U << GLB_REG_BMX_QOS_CCI_LEN) - 1) << GLB_REG_BMX_QOS_CCI_POS)
#define GLB_REG_BMX_QOS_CCI_UMSK     (~(((1U << GLB_REG_BMX_QOS_CCI_LEN) - 1) << GLB_REG_BMX_QOS_CCI_POS))
#define GLB_REG_BMX_QOS_PLDMA        GLB_REG_BMX_QOS_PLDMA
#define GLB_REG_BMX_QOS_PLDMA_POS    (23U)
#define GLB_REG_BMX_QOS_PLDMA_LEN    (1U)
#define GLB_REG_BMX_QOS_PLDMA_MSK    (((1U << GLB_REG_BMX_QOS_PLDMA_LEN) - 1) << GLB_REG_BMX_QOS_PLDMA_POS)
#define GLB_REG_BMX_QOS_PLDMA_UMSK   (~(((1U << GLB_REG_BMX_QOS_PLDMA_LEN) - 1) << GLB_REG_BMX_QOS_PLDMA_POS))
#define GLB_REG_BMX_QOS_BLEM         GLB_REG_BMX_QOS_BLEM
#define GLB_REG_BMX_QOS_BLEM_POS     (24U)
#define GLB_REG_BMX_QOS_BLEM_LEN     (1U)
#define GLB_REG_BMX_QOS_BLEM_MSK     (((1U << GLB_REG_BMX_QOS_BLEM_LEN) - 1) << GLB_REG_BMX_QOS_BLEM_POS)
#define GLB_REG_BMX_QOS_BLEM_UMSK    (~(((1U << GLB_REG_BMX_QOS_BLEM_LEN) - 1) << GLB_REG_BMX_QOS_BLEM_POS))
#define GLB_REG_BMX_QOS_EMACA        GLB_REG_BMX_QOS_EMACA
#define GLB_REG_BMX_QOS_EMACA_POS    (25U)
#define GLB_REG_BMX_QOS_EMACA_LEN    (1U)
#define GLB_REG_BMX_QOS_EMACA_MSK    (((1U << GLB_REG_BMX_QOS_EMACA_LEN) - 1) << GLB_REG_BMX_QOS_EMACA_POS)
#define GLB_REG_BMX_QOS_EMACA_UMSK   (~(((1U << GLB_REG_BMX_QOS_EMACA_LEN) - 1) << GLB_REG_BMX_QOS_EMACA_POS))
#define GLB_REG_BMX_QOS_DMA2         GLB_REG_BMX_QOS_DMA2
#define GLB_REG_BMX_QOS_DMA2_POS     (26U)
#define GLB_REG_BMX_QOS_DMA2_LEN     (1U)
#define GLB_REG_BMX_QOS_DMA2_MSK     (((1U << GLB_REG_BMX_QOS_DMA2_LEN) - 1) << GLB_REG_BMX_QOS_DMA2_POS)
#define GLB_REG_BMX_QOS_DMA2_UMSK    (~(((1U << GLB_REG_BMX_QOS_DMA2_LEN) - 1) << GLB_REG_BMX_QOS_DMA2_POS))
#define GLB_REG_BMX_QOS_SDHM         GLB_REG_BMX_QOS_SDHM
#define GLB_REG_BMX_QOS_SDHM_POS     (27U)
#define GLB_REG_BMX_QOS_SDHM_LEN     (1U)
#define GLB_REG_BMX_QOS_SDHM_MSK     (((1U << GLB_REG_BMX_QOS_SDHM_LEN) - 1) << GLB_REG_BMX_QOS_SDHM_POS)
#define GLB_REG_BMX_QOS_SDHM_UMSK    (~(((1U << GLB_REG_BMX_QOS_SDHM_LEN) - 1) << GLB_REG_BMX_QOS_SDHM_POS))
#define GLB_BMX_DBG_SEL              GLB_BMX_DBG_SEL
#define GLB_BMX_DBG_SEL_POS          (28U)
#define GLB_BMX_DBG_SEL_LEN          (4U)
#define GLB_BMX_DBG_SEL_MSK          (((1U << GLB_BMX_DBG_SEL_LEN) - 1) << GLB_BMX_DBG_SEL_POS)
#define GLB_BMX_DBG_SEL_UMSK         (~(((1U << GLB_BMX_DBG_SEL_LEN) - 1) << GLB_BMX_DBG_SEL_POS))

/* 0x328 : bmx_cfg2 */
#define GLB_BMX_CFG2_OFFSET      (0x328)
#define GLB_REG_BMX_BERR_EN      GLB_REG_BMX_BERR_EN
#define GLB_REG_BMX_BERR_EN_POS  (0U)
#define GLB_REG_BMX_BERR_EN_LEN  (14U)
#define GLB_REG_BMX_BERR_EN_MSK  (((1U << GLB_REG_BMX_BERR_EN_LEN) - 1) << GLB_REG_BMX_BERR_EN_POS)
#define GLB_REG_BMX_BERR_EN_UMSK (~(((1U << GLB_REG_BMX_BERR_EN_LEN) - 1) << GLB_REG_BMX_BERR_EN_POS))
#define GLB_REG_MCU_BERR_EN      GLB_REG_MCU_BERR_EN
#define GLB_REG_MCU_BERR_EN_POS  (16U)
#define GLB_REG_MCU_BERR_EN_LEN  (1U)
#define GLB_REG_MCU_BERR_EN_MSK  (((1U << GLB_REG_MCU_BERR_EN_LEN) - 1) << GLB_REG_MCU_BERR_EN_POS)
#define GLB_REG_MCU_BERR_EN_UMSK (~(((1U << GLB_REG_MCU_BERR_EN_LEN) - 1) << GLB_REG_MCU_BERR_EN_POS))

/* 0x32C : bmx_cfg3 */
#define GLB_BMX_CFG3_OFFSET         (0x32C)
#define GLB_REG_BMX_BERR_CLR        GLB_REG_BMX_BERR_CLR
#define GLB_REG_BMX_BERR_CLR_POS    (0U)
#define GLB_REG_BMX_BERR_CLR_LEN    (1U)
#define GLB_REG_BMX_BERR_CLR_MSK    (((1U << GLB_REG_BMX_BERR_CLR_LEN) - 1) << GLB_REG_BMX_BERR_CLR_POS)
#define GLB_REG_BMX_BERR_CLR_UMSK   (~(((1U << GLB_REG_BMX_BERR_CLR_LEN) - 1) << GLB_REG_BMX_BERR_CLR_POS))
#define GLB_REG_BMX_BERR_LAST       GLB_REG_BMX_BERR_LAST
#define GLB_REG_BMX_BERR_LAST_POS   (1U)
#define GLB_REG_BMX_BERR_LAST_LEN   (1U)
#define GLB_REG_BMX_BERR_LAST_MSK   (((1U << GLB_REG_BMX_BERR_LAST_LEN) - 1) << GLB_REG_BMX_BERR_LAST_POS)
#define GLB_REG_BMX_BERR_LAST_UMSK  (~(((1U << GLB_REG_BMX_BERR_LAST_LEN) - 1) << GLB_REG_BMX_BERR_LAST_POS))
#define GLB_REG_MCU_BERR_CLR        GLB_REG_MCU_BERR_CLR
#define GLB_REG_MCU_BERR_CLR_POS    (8U)
#define GLB_REG_MCU_BERR_CLR_LEN    (1U)
#define GLB_REG_MCU_BERR_CLR_MSK    (((1U << GLB_REG_MCU_BERR_CLR_LEN) - 1) << GLB_REG_MCU_BERR_CLR_POS)
#define GLB_REG_MCU_BERR_CLR_UMSK   (~(((1U << GLB_REG_MCU_BERR_CLR_LEN) - 1) << GLB_REG_MCU_BERR_CLR_POS))
#define GLB_REG_MCU_BERR_LAST       GLB_REG_MCU_BERR_LAST
#define GLB_REG_MCU_BERR_LAST_POS   (9U)
#define GLB_REG_MCU_BERR_LAST_LEN   (1U)
#define GLB_REG_MCU_BERR_LAST_MSK   (((1U << GLB_REG_MCU_BERR_LAST_LEN) - 1) << GLB_REG_MCU_BERR_LAST_POS)
#define GLB_REG_MCU_BERR_LAST_UMSK  (~(((1U << GLB_REG_MCU_BERR_LAST_LEN) - 1) << GLB_REG_MCU_BERR_LAST_POS))
#define GLB_STS_BMX_BERR            GLB_STS_BMX_BERR
#define GLB_STS_BMX_BERR_POS        (16U)
#define GLB_STS_BMX_BERR_LEN        (1U)
#define GLB_STS_BMX_BERR_MSK        (((1U << GLB_STS_BMX_BERR_LEN) - 1) << GLB_STS_BMX_BERR_POS)
#define GLB_STS_BMX_BERR_UMSK       (~(((1U << GLB_STS_BMX_BERR_LEN) - 1) << GLB_STS_BMX_BERR_POS))
#define GLB_STS_MCU_BERR            GLB_STS_MCU_BERR
#define GLB_STS_MCU_BERR_POS        (17U)
#define GLB_STS_MCU_BERR_LEN        (1U)
#define GLB_STS_MCU_BERR_MSK        (((1U << GLB_STS_MCU_BERR_LEN) - 1) << GLB_STS_MCU_BERR_POS)
#define GLB_STS_MCU_BERR_UMSK       (~(((1U << GLB_STS_MCU_BERR_LEN) - 1) << GLB_STS_MCU_BERR_POS))
#define GLB_STS_BMX_BERR_WRITE      GLB_STS_BMX_BERR_WRITE
#define GLB_STS_BMX_BERR_WRITE_POS  (24U)
#define GLB_STS_BMX_BERR_WRITE_LEN  (1U)
#define GLB_STS_BMX_BERR_WRITE_MSK  (((1U << GLB_STS_BMX_BERR_WRITE_LEN) - 1) << GLB_STS_BMX_BERR_WRITE_POS)
#define GLB_STS_BMX_BERR_WRITE_UMSK (~(((1U << GLB_STS_BMX_BERR_WRITE_LEN) - 1) << GLB_STS_BMX_BERR_WRITE_POS))
#define GLB_STS_MCU_BERR_WRITE      GLB_STS_MCU_BERR_WRITE
#define GLB_STS_MCU_BERR_WRITE_POS  (25U)
#define GLB_STS_MCU_BERR_WRITE_LEN  (1U)
#define GLB_STS_MCU_BERR_WRITE_MSK  (((1U << GLB_STS_MCU_BERR_WRITE_LEN) - 1) << GLB_STS_MCU_BERR_WRITE_POS)
#define GLB_STS_MCU_BERR_WRITE_UMSK (~(((1U << GLB_STS_MCU_BERR_WRITE_LEN) - 1) << GLB_STS_MCU_BERR_WRITE_POS))

