XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/glb_reg.h
/* 0x330 : bmx_cfg4 */
#define GLB_BMX_CFG4_OFFSET       (0x330)
#define GLB_STS_BMX_BERR_SRC      GLB_STS_BMX_BERR_SRC
#define GLB_STS_BMX_BERR_SRC_POS  (0U)
#define GLB_STS_BMX_BERR_SRC_LEN  (14U)
#define GLB_STS_BMX_BERR_SRC_MSK  (((1U << GLB_STS_BMX_BERR_SRC_LEN) - 1) << GLB_STS_BMX_BERR_SRC_POS)
#define GLB_STS_BMX_BERR_SRC_UMSK (~(((1U << GLB_STS_BMX_BERR_SRC_LEN) - 1) << GLB_STS_BMX_BERR_SRC_POS))
#define GLB_STS_MCU_BERR_SRC      GLB_STS_MCU_BERR_SRC
#define GLB_STS_MCU_BERR_SRC_POS  (16U)
#define GLB_STS_MCU_BERR_SRC_LEN  (1U)
#define GLB_STS_MCU_BERR_SRC_MSK  (((1U << GLB_STS_MCU_BERR_SRC_LEN) - 1) << GLB_STS_MCU_BERR_SRC_POS)
#define GLB_STS_MCU_BERR_SRC_UMSK (~(((1U << GLB_STS_MCU_BERR_SRC_LEN) - 1) << GLB_STS_MCU_BERR_SRC_POS))
#define GLB_STS_MCU_BERR_ID       GLB_STS_MCU_BERR_ID
#define GLB_STS_MCU_BERR_ID_POS   (24U)
#define GLB_STS_MCU_BERR_ID_LEN   (8U)
#define GLB_STS_MCU_BERR_ID_MSK   (((1U << GLB_STS_MCU_BERR_ID_LEN) - 1) << GLB_STS_MCU_BERR_ID_POS)
#define GLB_STS_MCU_BERR_ID_UMSK  (~(((1U << GLB_STS_MCU_BERR_ID_LEN) - 1) << GLB_STS_MCU_BERR_ID_POS))

/* 0x334 : bmx_cfg5 */
#define GLB_BMX_CFG5_OFFSET        (0x334)
#define GLB_STS_BMX_BERR_ADDR      GLB_STS_BMX_BERR_ADDR
#define GLB_STS_BMX_BERR_ADDR_POS  (0U)
#define GLB_STS_BMX_BERR_ADDR_LEN  (32U)
#define GLB_STS_BMX_BERR_ADDR_MSK  (((1U << GLB_STS_BMX_BERR_ADDR_LEN) - 1) << GLB_STS_BMX_BERR_ADDR_POS)
#define GLB_STS_BMX_BERR_ADDR_UMSK (~(((1U << GLB_STS_BMX_BERR_ADDR_LEN) - 1) << GLB_STS_BMX_BERR_ADDR_POS))

/* 0x338 : bmx_cfg6 */
#define GLB_BMX_CFG6_OFFSET        (0x338)
#define GLB_STS_MCU_BERR_ADDR      GLB_STS_MCU_BERR_ADDR
#define GLB_STS_MCU_BERR_ADDR_POS  (0U)
#define GLB_STS_MCU_BERR_ADDR_LEN  (32U)
#define GLB_STS_MCU_BERR_ADDR_MSK  (((1U << GLB_STS_MCU_BERR_ADDR_LEN) - 1) << GLB_STS_MCU_BERR_ADDR_POS)
#define GLB_STS_MCU_BERR_ADDR_UMSK (~(((1U << GLB_STS_MCU_BERR_ADDR_LEN) - 1) << GLB_STS_MCU_BERR_ADDR_POS))

/* 0x340 : audio_cfg0 */
#define GLB_AUDIO_CFG0_OFFSET          (0x340)
#define GLB_REG_AUDIO_PDM_CLK_DIV      GLB_REG_AUDIO_PDM_CLK_DIV
#define GLB_REG_AUDIO_PDM_CLK_DIV_POS  (0U)
#define GLB_REG_AUDIO_PDM_CLK_DIV_LEN  (6U)
#define GLB_REG_AUDIO_PDM_CLK_DIV_MSK  (((1U << GLB_REG_AUDIO_PDM_CLK_DIV_LEN) - 1) << GLB_REG_AUDIO_PDM_CLK_DIV_POS)
#define GLB_REG_AUDIO_PDM_CLK_DIV_UMSK (~(((1U << GLB_REG_AUDIO_PDM_CLK_DIV_LEN) - 1) << GLB_REG_AUDIO_PDM_CLK_DIV_POS))
#define GLB_REG_AUDIO_PDM_CLK_EN       GLB_REG_AUDIO_PDM_CLK_EN
#define GLB_REG_AUDIO_PDM_CLK_EN_POS   (7U)
#define GLB_REG_AUDIO_PDM_CLK_EN_LEN   (1U)
#define GLB_REG_AUDIO_PDM_CLK_EN_MSK   (((1U << GLB_REG_AUDIO_PDM_CLK_EN_LEN) - 1) << GLB_REG_AUDIO_PDM_CLK_EN_POS)
#define GLB_REG_AUDIO_PDM_CLK_EN_UMSK  (~(((1U << GLB_REG_AUDIO_PDM_CLK_EN_LEN) - 1) << GLB_REG_AUDIO_PDM_CLK_EN_POS))
#define GLB_REG_AUDIO_ADC_CLK_DIV      GLB_REG_AUDIO_ADC_CLK_DIV
#define GLB_REG_AUDIO_ADC_CLK_DIV_POS  (8U)
#define GLB_REG_AUDIO_ADC_CLK_DIV_LEN  (6U)
#define GLB_REG_AUDIO_ADC_CLK_DIV_MSK  (((1U << GLB_REG_AUDIO_ADC_CLK_DIV_LEN) - 1) << GLB_REG_AUDIO_ADC_CLK_DIV_POS)
#define GLB_REG_AUDIO_ADC_CLK_DIV_UMSK (~(((1U << GLB_REG_AUDIO_ADC_CLK_DIV_LEN) - 1) << GLB_REG_AUDIO_ADC_CLK_DIV_POS))
#define GLB_REG_AUDIO_ADC_CLK_EN       GLB_REG_AUDIO_ADC_CLK_EN
#define GLB_REG_AUDIO_ADC_CLK_EN_POS   (15U)
#define GLB_REG_AUDIO_ADC_CLK_EN_LEN   (1U)
#define GLB_REG_AUDIO_ADC_CLK_EN_MSK   (((1U << GLB_REG_AUDIO_ADC_CLK_EN_LEN) - 1) << GLB_REG_AUDIO_ADC_CLK_EN_POS)
#define GLB_REG_AUDIO_ADC_CLK_EN_UMSK  (~(((1U << GLB_REG_AUDIO_ADC_CLK_EN_LEN) - 1) << GLB_REG_AUDIO_ADC_CLK_EN_POS))
#define GLB_REG_AUDIO_DAC_CLK_DIV      GLB_REG_AUDIO_DAC_CLK_DIV
#define GLB_REG_AUDIO_DAC_CLK_DIV_POS  (16U)
#define GLB_REG_AUDIO_DAC_CLK_DIV_LEN  (6U)
#define GLB_REG_AUDIO_DAC_CLK_DIV_MSK  (((1U << GLB_REG_AUDIO_DAC_CLK_DIV_LEN) - 1) << GLB_REG_AUDIO_DAC_CLK_DIV_POS)
#define GLB_REG_AUDIO_DAC_CLK_DIV_UMSK (~(((1U << GLB_REG_AUDIO_DAC_CLK_DIV_LEN) - 1) << GLB_REG_AUDIO_DAC_CLK_DIV_POS))
#define GLB_REG_AUDIO_DAC_CLK_EN       GLB_REG_AUDIO_DAC_CLK_EN
#define GLB_REG_AUDIO_DAC_CLK_EN_POS   (23U)
#define GLB_REG_AUDIO_DAC_CLK_EN_LEN   (1U)
#define GLB_REG_AUDIO_DAC_CLK_EN_MSK   (((1U << GLB_REG_AUDIO_DAC_CLK_EN_LEN) - 1) << GLB_REG_AUDIO_DAC_CLK_EN_POS)
#define GLB_REG_AUDIO_DAC_CLK_EN_UMSK  (~(((1U << GLB_REG_AUDIO_DAC_CLK_EN_LEN) - 1) << GLB_REG_AUDIO_DAC_CLK_EN_POS))
#define GLB_REG_AUDIO_AUTO_DIV_EN      GLB_REG_AUDIO_AUTO_DIV_EN
#define GLB_REG_AUDIO_AUTO_DIV_EN_POS  (31U)
#define GLB_REG_AUDIO_AUTO_DIV_EN_LEN  (1U)
#define GLB_REG_AUDIO_AUTO_DIV_EN_MSK  (((1U << GLB_REG_AUDIO_AUTO_DIV_EN_LEN) - 1) << GLB_REG_AUDIO_AUTO_DIV_EN_POS)
#define GLB_REG_AUDIO_AUTO_DIV_EN_UMSK (~(((1U << GLB_REG_AUDIO_AUTO_DIV_EN_LEN) - 1) << GLB_REG_AUDIO_AUTO_DIV_EN_POS))

/* 0x344 : audio_cfg1 */
#define GLB_AUDIO_CFG1_OFFSET     (0x344)
#define GLB_REG_PADC_CLK_DIV      GLB_REG_PADC_CLK_DIV
#define GLB_REG_PADC_CLK_DIV_POS  (0U)
#define GLB_REG_PADC_CLK_DIV_LEN  (10U)
#define GLB_REG_PADC_CLK_DIV_MSK  (((1U << GLB_REG_PADC_CLK_DIV_LEN) - 1) << GLB_REG_PADC_CLK_DIV_POS)
#define GLB_REG_PADC_CLK_DIV_UMSK (~(((1U << GLB_REG_PADC_CLK_DIV_LEN) - 1) << GLB_REG_PADC_CLK_DIV_POS))
#define GLB_REG_PADC_CLK_EN       GLB_REG_PADC_CLK_EN
#define GLB_REG_PADC_CLK_EN_POS   (10U)
#define GLB_REG_PADC_CLK_EN_LEN   (1U)
#define GLB_REG_PADC_CLK_EN_MSK   (((1U << GLB_REG_PADC_CLK_EN_LEN) - 1) << GLB_REG_PADC_CLK_EN_POS)
#define GLB_REG_PADC_CLK_EN_UMSK  (~(((1U << GLB_REG_PADC_CLK_EN_LEN) - 1) << GLB_REG_PADC_CLK_EN_POS))

/* 0x390 : eth_cfg0 */
#define GLB_ETH_CFG0_OFFSET            (0x390)
#define GLB_CFG_SEL_ETH_REF_CLK_O      GLB_CFG_SEL_ETH_REF_CLK_O
#define GLB_CFG_SEL_ETH_REF_CLK_O_POS  (5U)
#define GLB_CFG_SEL_ETH_REF_CLK_O_LEN  (1U)
#define GLB_CFG_SEL_ETH_REF_CLK_O_MSK  (((1U << GLB_CFG_SEL_ETH_REF_CLK_O_LEN) - 1) << GLB_CFG_SEL_ETH_REF_CLK_O_POS)
#define GLB_CFG_SEL_ETH_REF_CLK_O_UMSK (~(((1U << GLB_CFG_SEL_ETH_REF_CLK_O_LEN) - 1) << GLB_CFG_SEL_ETH_REF_CLK_O_POS))
#define GLB_CFG_INV_ETH_REF_CLK_O      GLB_CFG_INV_ETH_REF_CLK_O
#define GLB_CFG_INV_ETH_REF_CLK_O_POS  (6U)
#define GLB_CFG_INV_ETH_REF_CLK_O_LEN  (1U)
#define GLB_CFG_INV_ETH_REF_CLK_O_MSK  (((1U << GLB_CFG_INV_ETH_REF_CLK_O_LEN) - 1) << GLB_CFG_INV_ETH_REF_CLK_O_POS)
#define GLB_CFG_INV_ETH_REF_CLK_O_UMSK (~(((1U << GLB_CFG_INV_ETH_REF_CLK_O_LEN) - 1) << GLB_CFG_INV_ETH_REF_CLK_O_POS))
#define GLB_CFG_INV_ETH_TX_CLK         GLB_CFG_INV_ETH_TX_CLK
#define GLB_CFG_INV_ETH_TX_CLK_POS     (7U)
#define GLB_CFG_INV_ETH_TX_CLK_LEN     (1U)
#define GLB_CFG_INV_ETH_TX_CLK_MSK     (((1U << GLB_CFG_INV_ETH_TX_CLK_LEN) - 1) << GLB_CFG_INV_ETH_TX_CLK_POS)
#define GLB_CFG_INV_ETH_TX_CLK_UMSK    (~(((1U << GLB_CFG_INV_ETH_TX_CLK_LEN) - 1) << GLB_CFG_INV_ETH_TX_CLK_POS))
#define GLB_CFG_INV_ETH_RX_CLK         GLB_CFG_INV_ETH_RX_CLK
#define GLB_CFG_INV_ETH_RX_CLK_POS     (10U)
#define GLB_CFG_INV_ETH_RX_CLK_LEN     (1U)
#define GLB_CFG_INV_ETH_RX_CLK_MSK     (((1U << GLB_CFG_INV_ETH_RX_CLK_LEN) - 1) << GLB_CFG_INV_ETH_RX_CLK_POS)
#define GLB_CFG_INV_ETH_RX_CLK_UMSK    (~(((1U << GLB_CFG_INV_ETH_RX_CLK_LEN) - 1) << GLB_CFG_INV_ETH_RX_CLK_POS))

/* 0x420 : cam_cfg0 */
#define GLB_CAM_CFG0_OFFSET              (0x420)
#define GLB_REG_CAM_REF_CLK_EN           GLB_REG_CAM_REF_CLK_EN
#define GLB_REG_CAM_REF_CLK_EN_POS       (27U)
#define GLB_REG_CAM_REF_CLK_EN_LEN       (1U)
#define GLB_REG_CAM_REF_CLK_EN_MSK       (((1U << GLB_REG_CAM_REF_CLK_EN_LEN) - 1) << GLB_REG_CAM_REF_CLK_EN_POS)
#define GLB_REG_CAM_REF_CLK_EN_UMSK      (~(((1U << GLB_REG_CAM_REF_CLK_EN_LEN) - 1) << GLB_REG_CAM_REF_CLK_EN_POS))
#define GLB_REG_CAM_REF_CLK_SRC_SEL      GLB_REG_CAM_REF_CLK_SRC_SEL
#define GLB_REG_CAM_REF_CLK_SRC_SEL_POS  (28U)
#define GLB_REG_CAM_REF_CLK_SRC_SEL_LEN  (2U)
#define GLB_REG_CAM_REF_CLK_SRC_SEL_MSK  (((1U << GLB_REG_CAM_REF_CLK_SRC_SEL_LEN) - 1) << GLB_REG_CAM_REF_CLK_SRC_SEL_POS)
#define GLB_REG_CAM_REF_CLK_SRC_SEL_UMSK (~(((1U << GLB_REG_CAM_REF_CLK_SRC_SEL_LEN) - 1) << GLB_REG_CAM_REF_CLK_SRC_SEL_POS))
#define GLB_REG_CAM_REF_CLK_DIV          GLB_REG_CAM_REF_CLK_DIV
#define GLB_REG_CAM_REF_CLK_DIV_POS      (30U)
#define GLB_REG_CAM_REF_CLK_DIV_LEN      (2U)
#define GLB_REG_CAM_REF_CLK_DIV_MSK      (((1U << GLB_REG_CAM_REF_CLK_DIV_LEN) - 1) << GLB_REG_CAM_REF_CLK_DIV_POS)
#define GLB_REG_CAM_REF_CLK_DIV_UMSK     (~(((1U << GLB_REG_CAM_REF_CLK_DIV_LEN) - 1) << GLB_REG_CAM_REF_CLK_DIV_POS))

