XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/glb_reg.h
/* 0x7B4 : mipi_pll_cfg9 */
#define GLB_MIPI_PLL_CFG9_OFFSET           (0x7B4)
#define GLB_MIPIPLL_SSC_EN                 GLB_MIPIPLL_SSC_EN
#define GLB_MIPIPLL_SSC_EN_POS             (0U)
#define GLB_MIPIPLL_SSC_EN_LEN             (1U)
#define GLB_MIPIPLL_SSC_EN_MSK             (((1U << GLB_MIPIPLL_SSC_EN_LEN) - 1) << GLB_MIPIPLL_SSC_EN_POS)
#define GLB_MIPIPLL_SSC_EN_UMSK            (~(((1U << GLB_MIPIPLL_SSC_EN_LEN) - 1) << GLB_MIPIPLL_SSC_EN_POS))
#define GLB_MIPIPLL_SSC_CNT                GLB_MIPIPLL_SSC_CNT
#define GLB_MIPIPLL_SSC_CNT_POS            (4U)
#define GLB_MIPIPLL_SSC_CNT_LEN            (8U)
#define GLB_MIPIPLL_SSC_CNT_MSK            (((1U << GLB_MIPIPLL_SSC_CNT_LEN) - 1) << GLB_MIPIPLL_SSC_CNT_POS)
#define GLB_MIPIPLL_SSC_CNT_UMSK           (~(((1U << GLB_MIPIPLL_SSC_CNT_LEN) - 1) << GLB_MIPIPLL_SSC_CNT_POS))
#define GLB_MIPIPLL_SSC_GAIN               GLB_MIPIPLL_SSC_GAIN
#define GLB_MIPIPLL_SSC_GAIN_POS           (12U)
#define GLB_MIPIPLL_SSC_GAIN_LEN           (3U)
#define GLB_MIPIPLL_SSC_GAIN_MSK           (((1U << GLB_MIPIPLL_SSC_GAIN_LEN) - 1) << GLB_MIPIPLL_SSC_GAIN_POS)
#define GLB_MIPIPLL_SSC_GAIN_UMSK          (~(((1U << GLB_MIPIPLL_SSC_GAIN_LEN) - 1) << GLB_MIPIPLL_SSC_GAIN_POS))
#define GLB_MIPIPLL_SSC_START_GATE_EN      GLB_MIPIPLL_SSC_START_GATE_EN
#define GLB_MIPIPLL_SSC_START_GATE_EN_POS  (16U)
#define GLB_MIPIPLL_SSC_START_GATE_EN_LEN  (1U)
#define GLB_MIPIPLL_SSC_START_GATE_EN_MSK  (((1U << GLB_MIPIPLL_SSC_START_GATE_EN_LEN) - 1) << GLB_MIPIPLL_SSC_START_GATE_EN_POS)
#define GLB_MIPIPLL_SSC_START_GATE_EN_UMSK (~(((1U << GLB_MIPIPLL_SSC_START_GATE_EN_LEN) - 1) << GLB_MIPIPLL_SSC_START_GATE_EN_POS))

/* 0x7D0 : uhs_pll_cfg0 */
#define GLB_UHS_PLL_CFG0_OFFSET   (0x7D0)
#define GLB_UHSPLL_SDM_RSTB       GLB_UHSPLL_SDM_RSTB
#define GLB_UHSPLL_SDM_RSTB_POS   (0U)
#define GLB_UHSPLL_SDM_RSTB_LEN   (1U)
#define GLB_UHSPLL_SDM_RSTB_MSK   (((1U << GLB_UHSPLL_SDM_RSTB_LEN) - 1) << GLB_UHSPLL_SDM_RSTB_POS)
#define GLB_UHSPLL_SDM_RSTB_UMSK  (~(((1U << GLB_UHSPLL_SDM_RSTB_LEN) - 1) << GLB_UHSPLL_SDM_RSTB_POS))
#define GLB_UHSPLL_FBDV_RSTB      GLB_UHSPLL_FBDV_RSTB
#define GLB_UHSPLL_FBDV_RSTB_POS  (2U)
#define GLB_UHSPLL_FBDV_RSTB_LEN  (1U)
#define GLB_UHSPLL_FBDV_RSTB_MSK  (((1U << GLB_UHSPLL_FBDV_RSTB_LEN) - 1) << GLB_UHSPLL_FBDV_RSTB_POS)
#define GLB_UHSPLL_FBDV_RSTB_UMSK (~(((1U << GLB_UHSPLL_FBDV_RSTB_LEN) - 1) << GLB_UHSPLL_FBDV_RSTB_POS))
#define GLB_PU_UHSPLL_FBDV        GLB_PU_UHSPLL_FBDV
#define GLB_PU_UHSPLL_FBDV_POS    (5U)
#define GLB_PU_UHSPLL_FBDV_LEN    (1U)
#define GLB_PU_UHSPLL_FBDV_MSK    (((1U << GLB_PU_UHSPLL_FBDV_LEN) - 1) << GLB_PU_UHSPLL_FBDV_POS)
#define GLB_PU_UHSPLL_FBDV_UMSK   (~(((1U << GLB_PU_UHSPLL_FBDV_LEN) - 1) << GLB_PU_UHSPLL_FBDV_POS))
#define GLB_PU_UHSPLL_CP          GLB_PU_UHSPLL_CP
#define GLB_PU_UHSPLL_CP_POS      (8U)
#define GLB_PU_UHSPLL_CP_LEN      (1U)
#define GLB_PU_UHSPLL_CP_MSK      (((1U << GLB_PU_UHSPLL_CP_LEN) - 1) << GLB_PU_UHSPLL_CP_POS)
#define GLB_PU_UHSPLL_CP_UMSK     (~(((1U << GLB_PU_UHSPLL_CP_LEN) - 1) << GLB_PU_UHSPLL_CP_POS))
#define GLB_PU_UHSPLL_SFREG       GLB_PU_UHSPLL_SFREG
#define GLB_PU_UHSPLL_SFREG_POS   (9U)
#define GLB_PU_UHSPLL_SFREG_LEN   (1U)
#define GLB_PU_UHSPLL_SFREG_MSK   (((1U << GLB_PU_UHSPLL_SFREG_LEN) - 1) << GLB_PU_UHSPLL_SFREG_POS)
#define GLB_PU_UHSPLL_SFREG_UMSK  (~(((1U << GLB_PU_UHSPLL_SFREG_LEN) - 1) << GLB_PU_UHSPLL_SFREG_POS))
#define GLB_PU_UHSPLL             GLB_PU_UHSPLL
#define GLB_PU_UHSPLL_POS         (10U)
#define GLB_PU_UHSPLL_LEN         (1U)
#define GLB_PU_UHSPLL_MSK         (((1U << GLB_PU_UHSPLL_LEN) - 1) << GLB_PU_UHSPLL_POS)
#define GLB_PU_UHSPLL_UMSK        (~(((1U << GLB_PU_UHSPLL_LEN) - 1) << GLB_PU_UHSPLL_POS))

/* 0x7D4 : uhs_pll_cfg1 */
#define GLB_UHS_PLL_CFG1_OFFSET        (0x7D4)
#define GLB_UHSPLL_EVEN_DIV_RATIO      GLB_UHSPLL_EVEN_DIV_RATIO
#define GLB_UHSPLL_EVEN_DIV_RATIO_POS  (0U)
#define GLB_UHSPLL_EVEN_DIV_RATIO_LEN  (7U)
#define GLB_UHSPLL_EVEN_DIV_RATIO_MSK  (((1U << GLB_UHSPLL_EVEN_DIV_RATIO_LEN) - 1) << GLB_UHSPLL_EVEN_DIV_RATIO_POS)
#define GLB_UHSPLL_EVEN_DIV_RATIO_UMSK (~(((1U << GLB_UHSPLL_EVEN_DIV_RATIO_LEN) - 1) << GLB_UHSPLL_EVEN_DIV_RATIO_POS))
#define GLB_UHSPLL_EVEN_DIV_EN         GLB_UHSPLL_EVEN_DIV_EN
#define GLB_UHSPLL_EVEN_DIV_EN_POS     (7U)
#define GLB_UHSPLL_EVEN_DIV_EN_LEN     (1U)
#define GLB_UHSPLL_EVEN_DIV_EN_MSK     (((1U << GLB_UHSPLL_EVEN_DIV_EN_LEN) - 1) << GLB_UHSPLL_EVEN_DIV_EN_POS)
#define GLB_UHSPLL_EVEN_DIV_EN_UMSK    (~(((1U << GLB_UHSPLL_EVEN_DIV_EN_LEN) - 1) << GLB_UHSPLL_EVEN_DIV_EN_POS))
#define GLB_UHSPLL_REFDIV_RATIO        GLB_UHSPLL_REFDIV_RATIO
#define GLB_UHSPLL_REFDIV_RATIO_POS    (8U)
#define GLB_UHSPLL_REFDIV_RATIO_LEN    (4U)
#define GLB_UHSPLL_REFDIV_RATIO_MSK    (((1U << GLB_UHSPLL_REFDIV_RATIO_LEN) - 1) << GLB_UHSPLL_REFDIV_RATIO_POS)
#define GLB_UHSPLL_REFDIV_RATIO_UMSK   (~(((1U << GLB_UHSPLL_REFDIV_RATIO_LEN) - 1) << GLB_UHSPLL_REFDIV_RATIO_POS))
#define GLB_UHSPLL_REFCLK_SEL          GLB_UHSPLL_REFCLK_SEL
#define GLB_UHSPLL_REFCLK_SEL_POS      (16U)
#define GLB_UHSPLL_REFCLK_SEL_LEN      (2U)
#define GLB_UHSPLL_REFCLK_SEL_MSK      (((1U << GLB_UHSPLL_REFCLK_SEL_LEN) - 1) << GLB_UHSPLL_REFCLK_SEL_POS)
#define GLB_UHSPLL_REFCLK_SEL_UMSK     (~(((1U << GLB_UHSPLL_REFCLK_SEL_LEN) - 1) << GLB_UHSPLL_REFCLK_SEL_POS))
#define GLB_UHSPLL_VG11_SEL            GLB_UHSPLL_VG11_SEL
#define GLB_UHSPLL_VG11_SEL_POS        (20U)
#define GLB_UHSPLL_VG11_SEL_LEN        (2U)
#define GLB_UHSPLL_VG11_SEL_MSK        (((1U << GLB_UHSPLL_VG11_SEL_LEN) - 1) << GLB_UHSPLL_VG11_SEL_POS)
#define GLB_UHSPLL_VG11_SEL_UMSK       (~(((1U << GLB_UHSPLL_VG11_SEL_LEN) - 1) << GLB_UHSPLL_VG11_SEL_POS))
#define GLB_UHSPLL_VG13_SEL            GLB_UHSPLL_VG13_SEL
#define GLB_UHSPLL_VG13_SEL_POS        (24U)
#define GLB_UHSPLL_VG13_SEL_LEN        (2U)
#define GLB_UHSPLL_VG13_SEL_MSK        (((1U << GLB_UHSPLL_VG13_SEL_LEN) - 1) << GLB_UHSPLL_VG13_SEL_POS)
#define GLB_UHSPLL_VG13_SEL_UMSK       (~(((1U << GLB_UHSPLL_VG13_SEL_LEN) - 1) << GLB_UHSPLL_VG13_SEL_POS))

/* 0x7D8 : uhs_pll_cfg2 */
#define GLB_UHS_PLL_CFG2_OFFSET       (0x7D8)
#define GLB_UHSPLL_SEL_CP_BIAS        GLB_UHSPLL_SEL_CP_BIAS
#define GLB_UHSPLL_SEL_CP_BIAS_POS    (0U)
#define GLB_UHSPLL_SEL_CP_BIAS_LEN    (1U)
#define GLB_UHSPLL_SEL_CP_BIAS_MSK    (((1U << GLB_UHSPLL_SEL_CP_BIAS_LEN) - 1) << GLB_UHSPLL_SEL_CP_BIAS_POS)
#define GLB_UHSPLL_SEL_CP_BIAS_UMSK   (~(((1U << GLB_UHSPLL_SEL_CP_BIAS_LEN) - 1) << GLB_UHSPLL_SEL_CP_BIAS_POS))
#define GLB_UHSPLL_ICP_5U             GLB_UHSPLL_ICP_5U
#define GLB_UHSPLL_ICP_5U_POS         (4U)
#define GLB_UHSPLL_ICP_5U_LEN         (2U)
#define GLB_UHSPLL_ICP_5U_MSK         (((1U << GLB_UHSPLL_ICP_5U_LEN) - 1) << GLB_UHSPLL_ICP_5U_POS)
#define GLB_UHSPLL_ICP_5U_UMSK        (~(((1U << GLB_UHSPLL_ICP_5U_LEN) - 1) << GLB_UHSPLL_ICP_5U_POS))
#define GLB_UHSPLL_ICP_1U             GLB_UHSPLL_ICP_1U
#define GLB_UHSPLL_ICP_1U_POS         (6U)
#define GLB_UHSPLL_ICP_1U_LEN         (2U)
#define GLB_UHSPLL_ICP_1U_MSK         (((1U << GLB_UHSPLL_ICP_1U_LEN) - 1) << GLB_UHSPLL_ICP_1U_POS)
#define GLB_UHSPLL_ICP_1U_UMSK        (~(((1U << GLB_UHSPLL_ICP_1U_LEN) - 1) << GLB_UHSPLL_ICP_1U_POS))
#define GLB_UHSPLL_INT_FRAC_SW        GLB_UHSPLL_INT_FRAC_SW
#define GLB_UHSPLL_INT_FRAC_SW_POS    (8U)
#define GLB_UHSPLL_INT_FRAC_SW_LEN    (1U)
#define GLB_UHSPLL_INT_FRAC_SW_MSK    (((1U << GLB_UHSPLL_INT_FRAC_SW_LEN) - 1) << GLB_UHSPLL_INT_FRAC_SW_POS)
#define GLB_UHSPLL_INT_FRAC_SW_UMSK   (~(((1U << GLB_UHSPLL_INT_FRAC_SW_LEN) - 1) << GLB_UHSPLL_INT_FRAC_SW_POS))
#define GLB_UHSPLL_CP_STARTUP_EN      GLB_UHSPLL_CP_STARTUP_EN
#define GLB_UHSPLL_CP_STARTUP_EN_POS  (9U)
#define GLB_UHSPLL_CP_STARTUP_EN_LEN  (1U)
#define GLB_UHSPLL_CP_STARTUP_EN_MSK  (((1U << GLB_UHSPLL_CP_STARTUP_EN_LEN) - 1) << GLB_UHSPLL_CP_STARTUP_EN_POS)
#define GLB_UHSPLL_CP_STARTUP_EN_UMSK (~(((1U << GLB_UHSPLL_CP_STARTUP_EN_LEN) - 1) << GLB_UHSPLL_CP_STARTUP_EN_POS))
#define GLB_UHSPLL_CP_OPAMP_EN        GLB_UHSPLL_CP_OPAMP_EN
#define GLB_UHSPLL_CP_OPAMP_EN_POS    (10U)
#define GLB_UHSPLL_CP_OPAMP_EN_LEN    (1U)
#define GLB_UHSPLL_CP_OPAMP_EN_MSK    (((1U << GLB_UHSPLL_CP_OPAMP_EN_LEN) - 1) << GLB_UHSPLL_CP_OPAMP_EN_POS)
#define GLB_UHSPLL_CP_OPAMP_EN_UMSK   (~(((1U << GLB_UHSPLL_CP_OPAMP_EN_LEN) - 1) << GLB_UHSPLL_CP_OPAMP_EN_POS))
#define GLB_UHSPLL_CP_OTA_EN          GLB_UHSPLL_CP_OTA_EN
#define GLB_UHSPLL_CP_OTA_EN_POS      (11U)
#define GLB_UHSPLL_CP_OTA_EN_LEN      (1U)
#define GLB_UHSPLL_CP_OTA_EN_MSK      (((1U << GLB_UHSPLL_CP_OTA_EN_LEN) - 1) << GLB_UHSPLL_CP_OTA_EN_POS)
#define GLB_UHSPLL_CP_OTA_EN_UMSK     (~(((1U << GLB_UHSPLL_CP_OTA_EN_LEN) - 1) << GLB_UHSPLL_CP_OTA_EN_POS))
#define GLB_UHSPLL_PFD_EN             GLB_UHSPLL_PFD_EN
#define GLB_UHSPLL_PFD_EN_POS         (12U)
#define GLB_UHSPLL_PFD_EN_LEN         (1U)
#define GLB_UHSPLL_PFD_EN_MSK         (((1U << GLB_UHSPLL_PFD_EN_LEN) - 1) << GLB_UHSPLL_PFD_EN_POS)
#define GLB_UHSPLL_PFD_EN_UMSK        (~(((1U << GLB_UHSPLL_PFD_EN_LEN) - 1) << GLB_UHSPLL_PFD_EN_POS))

/* 0x7DC : uhs_pll_cfg3 */
#define GLB_UHS_PLL_CFG3_OFFSET      (0x7DC)
#define GLB_UHSPLL_C4_EN             GLB_UHSPLL_C4_EN
#define GLB_UHSPLL_C4_EN_POS         (0U)
#define GLB_UHSPLL_C4_EN_LEN         (1U)
#define GLB_UHSPLL_C4_EN_MSK         (((1U << GLB_UHSPLL_C4_EN_LEN) - 1) << GLB_UHSPLL_C4_EN_POS)
#define GLB_UHSPLL_C4_EN_UMSK        (~(((1U << GLB_UHSPLL_C4_EN_LEN) - 1) << GLB_UHSPLL_C4_EN_POS))
#define GLB_UHSPLL_R4                GLB_UHSPLL_R4
#define GLB_UHSPLL_R4_POS            (4U)
#define GLB_UHSPLL_R4_LEN            (2U)
#define GLB_UHSPLL_R4_MSK            (((1U << GLB_UHSPLL_R4_LEN) - 1) << GLB_UHSPLL_R4_POS)
#define GLB_UHSPLL_R4_UMSK           (~(((1U << GLB_UHSPLL_R4_LEN) - 1) << GLB_UHSPLL_R4_POS))
#define GLB_UHSPLL_R4_SHORT          GLB_UHSPLL_R4_SHORT
#define GLB_UHSPLL_R4_SHORT_POS      (8U)
#define GLB_UHSPLL_R4_SHORT_LEN      (1U)
#define GLB_UHSPLL_R4_SHORT_MSK      (((1U << GLB_UHSPLL_R4_SHORT_LEN) - 1) << GLB_UHSPLL_R4_SHORT_POS)
#define GLB_UHSPLL_R4_SHORT_UMSK     (~(((1U << GLB_UHSPLL_R4_SHORT_LEN) - 1) << GLB_UHSPLL_R4_SHORT_POS))
#define GLB_UHSPLL_C3                GLB_UHSPLL_C3
#define GLB_UHSPLL_C3_POS            (12U)
#define GLB_UHSPLL_C3_LEN            (2U)
#define GLB_UHSPLL_C3_MSK            (((1U << GLB_UHSPLL_C3_LEN) - 1) << GLB_UHSPLL_C3_POS)
#define GLB_UHSPLL_C3_UMSK           (~(((1U << GLB_UHSPLL_C3_LEN) - 1) << GLB_UHSPLL_C3_POS))
#define GLB_UHSPLL_CZ                GLB_UHSPLL_CZ
#define GLB_UHSPLL_CZ_POS            (14U)
#define GLB_UHSPLL_CZ_LEN            (2U)
#define GLB_UHSPLL_CZ_MSK            (((1U << GLB_UHSPLL_CZ_LEN) - 1) << GLB_UHSPLL_CZ_POS)
#define GLB_UHSPLL_CZ_UMSK           (~(((1U << GLB_UHSPLL_CZ_LEN) - 1) << GLB_UHSPLL_CZ_POS))
#define GLB_UHSPLL_RZ                GLB_UHSPLL_RZ
#define GLB_UHSPLL_RZ_POS            (16U)
#define GLB_UHSPLL_RZ_LEN            (3U)
#define GLB_UHSPLL_RZ_MSK            (((1U << GLB_UHSPLL_RZ_LEN) - 1) << GLB_UHSPLL_RZ_POS)
#define GLB_UHSPLL_RZ_UMSK           (~(((1U << GLB_UHSPLL_RZ_LEN) - 1) << GLB_UHSPLL_RZ_POS))
#define GLB_UHSPLL_LF_TEST_EN        GLB_UHSPLL_LF_TEST_EN
#define GLB_UHSPLL_LF_TEST_EN_POS    (19U)
#define GLB_UHSPLL_LF_TEST_EN_LEN    (1U)
#define GLB_UHSPLL_LF_TEST_EN_MSK    (((1U << GLB_UHSPLL_LF_TEST_EN_LEN) - 1) << GLB_UHSPLL_LF_TEST_EN_POS)
#define GLB_UHSPLL_LF_TEST_EN_UMSK   (~(((1U << GLB_UHSPLL_LF_TEST_EN_LEN) - 1) << GLB_UHSPLL_LF_TEST_EN_POS))
#define GLB_UHSPLL_FAST_LOCK_EN      GLB_UHSPLL_FAST_LOCK_EN
#define GLB_UHSPLL_FAST_LOCK_EN_POS  (20U)
#define GLB_UHSPLL_FAST_LOCK_EN_LEN  (1U)
#define GLB_UHSPLL_FAST_LOCK_EN_MSK  (((1U << GLB_UHSPLL_FAST_LOCK_EN_LEN) - 1) << GLB_UHSPLL_FAST_LOCK_EN_POS)
#define GLB_UHSPLL_FAST_LOCK_EN_UMSK (~(((1U << GLB_UHSPLL_FAST_LOCK_EN_LEN) - 1) << GLB_UHSPLL_FAST_LOCK_EN_POS))

/* 0x7E0 : uhs_pll_cfg4 */
#define GLB_UHS_PLL_CFG4_OFFSET         (0x7E0)
#define GLB_UHSPLL_SEL_SAMPLE_CLK       GLB_UHSPLL_SEL_SAMPLE_CLK
#define GLB_UHSPLL_SEL_SAMPLE_CLK_POS   (0U)
#define GLB_UHSPLL_SEL_SAMPLE_CLK_LEN   (2U)
#define GLB_UHSPLL_SEL_SAMPLE_CLK_MSK   (((1U << GLB_UHSPLL_SEL_SAMPLE_CLK_LEN) - 1) << GLB_UHSPLL_SEL_SAMPLE_CLK_POS)
#define GLB_UHSPLL_SEL_SAMPLE_CLK_UMSK  (~(((1U << GLB_UHSPLL_SEL_SAMPLE_CLK_LEN) - 1) << GLB_UHSPLL_SEL_SAMPLE_CLK_POS))
#define GLB_UHSPLL_SEL_FB_CLK           GLB_UHSPLL_SEL_FB_CLK
#define GLB_UHSPLL_SEL_FB_CLK_POS       (4U)
#define GLB_UHSPLL_SEL_FB_CLK_LEN       (2U)
#define GLB_UHSPLL_SEL_FB_CLK_MSK       (((1U << GLB_UHSPLL_SEL_FB_CLK_LEN) - 1) << GLB_UHSPLL_SEL_FB_CLK_POS)
#define GLB_UHSPLL_SEL_FB_CLK_UMSK      (~(((1U << GLB_UHSPLL_SEL_FB_CLK_LEN) - 1) << GLB_UHSPLL_SEL_FB_CLK_POS))
#define GLB_UHSPLL_LOCK_DET_EN          GLB_UHSPLL_LOCK_DET_EN
#define GLB_UHSPLL_LOCK_DET_EN_POS      (8U)
#define GLB_UHSPLL_LOCK_DET_EN_LEN      (1U)
#define GLB_UHSPLL_LOCK_DET_EN_MSK      (((1U << GLB_UHSPLL_LOCK_DET_EN_LEN) - 1) << GLB_UHSPLL_LOCK_DET_EN_POS)
#define GLB_UHSPLL_LOCK_DET_EN_UMSK     (~(((1U << GLB_UHSPLL_LOCK_DET_EN_LEN) - 1) << GLB_UHSPLL_LOCK_DET_EN_POS))
#define GLB_UHSPLL_LOCK_CLK_SEL         GLB_UHSPLL_LOCK_CLK_SEL
#define GLB_UHSPLL_LOCK_CLK_SEL_POS     (9U)
#define GLB_UHSPLL_LOCK_CLK_SEL_LEN     (2U)
#define GLB_UHSPLL_LOCK_CLK_SEL_MSK     (((1U << GLB_UHSPLL_LOCK_CLK_SEL_LEN) - 1) << GLB_UHSPLL_LOCK_CLK_SEL_POS)
#define GLB_UHSPLL_LOCK_CLK_SEL_UMSK    (~(((1U << GLB_UHSPLL_LOCK_CLK_SEL_LEN) - 1) << GLB_UHSPLL_LOCK_CLK_SEL_POS))
#define GLB_UHSPLL_LOCK_CLK_INV_EN      GLB_UHSPLL_LOCK_CLK_INV_EN
#define GLB_UHSPLL_LOCK_CLK_INV_EN_POS  (12U)
#define GLB_UHSPLL_LOCK_CLK_INV_EN_LEN  (1U)
#define GLB_UHSPLL_LOCK_CLK_INV_EN_MSK  (((1U << GLB_UHSPLL_LOCK_CLK_INV_EN_LEN) - 1) << GLB_UHSPLL_LOCK_CLK_INV_EN_POS)
#define GLB_UHSPLL_LOCK_CLK_INV_EN_UMSK (~(((1U << GLB_UHSPLL_LOCK_CLK_INV_EN_LEN) - 1) << GLB_UHSPLL_LOCK_CLK_INV_EN_POS))
#define GLB_UHSPLL_LOCK_WIN_SEL         GLB_UHSPLL_LOCK_WIN_SEL
#define GLB_UHSPLL_LOCK_WIN_SEL_POS     (15U)
#define GLB_UHSPLL_LOCK_WIN_SEL_LEN     (2U)
#define GLB_UHSPLL_LOCK_WIN_SEL_MSK     (((1U << GLB_UHSPLL_LOCK_WIN_SEL_LEN) - 1) << GLB_UHSPLL_LOCK_WIN_SEL_POS)
#define GLB_UHSPLL_LOCK_WIN_SEL_UMSK    (~(((1U << GLB_UHSPLL_LOCK_WIN_SEL_LEN) - 1) << GLB_UHSPLL_LOCK_WIN_SEL_POS))

/* 0x7E4 : uhs_pll_cfg5 */
#define GLB_UHS_PLL_CFG5_OFFSET            (0x7E4)
#define GLB_UHSPLL_VCO_SPEED               GLB_UHSPLL_VCO_SPEED
#define GLB_UHSPLL_VCO_SPEED_POS           (0U)
#define GLB_UHSPLL_VCO_SPEED_LEN           (3U)
#define GLB_UHSPLL_VCO_SPEED_MSK           (((1U << GLB_UHSPLL_VCO_SPEED_LEN) - 1) << GLB_UHSPLL_VCO_SPEED_POS)
#define GLB_UHSPLL_VCO_SPEED_UMSK          (~(((1U << GLB_UHSPLL_VCO_SPEED_LEN) - 1) << GLB_UHSPLL_VCO_SPEED_POS))
#define GLB_UHSPLL_VCO_VDD_CTRL            GLB_UHSPLL_VCO_VDD_CTRL
#define GLB_UHSPLL_VCO_VDD_CTRL_POS        (3U)
#define GLB_UHSPLL_VCO_VDD_CTRL_LEN        (2U)
#define GLB_UHSPLL_VCO_VDD_CTRL_MSK        (((1U << GLB_UHSPLL_VCO_VDD_CTRL_LEN) - 1) << GLB_UHSPLL_VCO_VDD_CTRL_POS)
#define GLB_UHSPLL_VCO_VDD_CTRL_UMSK       (~(((1U << GLB_UHSPLL_VCO_VDD_CTRL_LEN) - 1) << GLB_UHSPLL_VCO_VDD_CTRL_POS))
#define GLB_UHSPLL_VCO_VDD_CTRL_EXTRA      GLB_UHSPLL_VCO_VDD_CTRL_EXTRA
#define GLB_UHSPLL_VCO_VDD_CTRL_EXTRA_POS  (5U)
#define GLB_UHSPLL_VCO_VDD_CTRL_EXTRA_LEN  (1U)
#define GLB_UHSPLL_VCO_VDD_CTRL_EXTRA_MSK  (((1U << GLB_UHSPLL_VCO_VDD_CTRL_EXTRA_LEN) - 1) << GLB_UHSPLL_VCO_VDD_CTRL_EXTRA_POS)
#define GLB_UHSPLL_VCO_VDD_CTRL_EXTRA_UMSK (~(((1U << GLB_UHSPLL_VCO_VDD_CTRL_EXTRA_LEN) - 1) << GLB_UHSPLL_VCO_VDD_CTRL_EXTRA_POS))
#define GLB_UHSPLL_VCO_POSTDIV_SEL         GLB_UHSPLL_VCO_POSTDIV_SEL
#define GLB_UHSPLL_VCO_POSTDIV_SEL_POS     (7U)
#define GLB_UHSPLL_VCO_POSTDIV_SEL_LEN     (3U)
#define GLB_UHSPLL_VCO_POSTDIV_SEL_MSK     (((1U << GLB_UHSPLL_VCO_POSTDIV_SEL_LEN) - 1) << GLB_UHSPLL_VCO_POSTDIV_SEL_POS)
#define GLB_UHSPLL_VCO_POSTDIV_SEL_UMSK    (~(((1U << GLB_UHSPLL_VCO_POSTDIV_SEL_LEN) - 1) << GLB_UHSPLL_VCO_POSTDIV_SEL_POS))
#define GLB_UHSPLL_VCO_POSTDIV_CLK_EN      GLB_UHSPLL_VCO_POSTDIV_CLK_EN
#define GLB_UHSPLL_VCO_POSTDIV_CLK_EN_POS  (10U)
#define GLB_UHSPLL_VCO_POSTDIV_CLK_EN_LEN  (1U)
#define GLB_UHSPLL_VCO_POSTDIV_CLK_EN_MSK  (((1U << GLB_UHSPLL_VCO_POSTDIV_CLK_EN_LEN) - 1) << GLB_UHSPLL_VCO_POSTDIV_CLK_EN_POS)
#define GLB_UHSPLL_VCO_POSTDIV_CLK_EN_UMSK (~(((1U << GLB_UHSPLL_VCO_POSTDIV_CLK_EN_LEN) - 1) << GLB_UHSPLL_VCO_POSTDIV_CLK_EN_POS))

/* 0x7E8 : uhs_pll_cfg6 */
#define GLB_UHS_PLL_CFG6_OFFSET    (0x7E8)
#define GLB_UHSPLL_SDMIN           GLB_UHSPLL_SDMIN
#define GLB_UHSPLL_SDMIN_POS       (0U)
#define GLB_UHSPLL_SDMIN_LEN       (19U)
#define GLB_UHSPLL_SDMIN_MSK       (((1U << GLB_UHSPLL_SDMIN_LEN) - 1) << GLB_UHSPLL_SDMIN_POS)
#define GLB_UHSPLL_SDMIN_UMSK      (~(((1U << GLB_UHSPLL_SDMIN_LEN) - 1) << GLB_UHSPLL_SDMIN_POS))
#define GLB_UHSPLL_SDM_BYPASS      GLB_UHSPLL_SDM_BYPASS
#define GLB_UHSPLL_SDM_BYPASS_POS  (24U)
#define GLB_UHSPLL_SDM_BYPASS_LEN  (1U)
#define GLB_UHSPLL_SDM_BYPASS_MSK  (((1U << GLB_UHSPLL_SDM_BYPASS_LEN) - 1) << GLB_UHSPLL_SDM_BYPASS_POS)
#define GLB_UHSPLL_SDM_BYPASS_UMSK (~(((1U << GLB_UHSPLL_SDM_BYPASS_LEN) - 1) << GLB_UHSPLL_SDM_BYPASS_POS))

