XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/glb_reg.h
/* 0x810 : wifi_pll_cfg0 */
#define GLB_WIFI_PLL_CFG0_OFFSET      (0x810)
#define GLB_WIFIPLL_SDM_RSTB          GLB_WIFIPLL_SDM_RSTB
#define GLB_WIFIPLL_SDM_RSTB_POS      (0U)
#define GLB_WIFIPLL_SDM_RSTB_LEN      (1U)
#define GLB_WIFIPLL_SDM_RSTB_MSK      (((1U << GLB_WIFIPLL_SDM_RSTB_LEN) - 1) << GLB_WIFIPLL_SDM_RSTB_POS)
#define GLB_WIFIPLL_SDM_RSTB_UMSK     (~(((1U << GLB_WIFIPLL_SDM_RSTB_LEN) - 1) << GLB_WIFIPLL_SDM_RSTB_POS))
#define GLB_WIFIPLL_POSTDIV_RSTB      GLB_WIFIPLL_POSTDIV_RSTB
#define GLB_WIFIPLL_POSTDIV_RSTB_POS  (1U)
#define GLB_WIFIPLL_POSTDIV_RSTB_LEN  (1U)
#define GLB_WIFIPLL_POSTDIV_RSTB_MSK  (((1U << GLB_WIFIPLL_POSTDIV_RSTB_LEN) - 1) << GLB_WIFIPLL_POSTDIV_RSTB_POS)
#define GLB_WIFIPLL_POSTDIV_RSTB_UMSK (~(((1U << GLB_WIFIPLL_POSTDIV_RSTB_LEN) - 1) << GLB_WIFIPLL_POSTDIV_RSTB_POS))
#define GLB_WIFIPLL_FBDV_RSTB         GLB_WIFIPLL_FBDV_RSTB
#define GLB_WIFIPLL_FBDV_RSTB_POS     (2U)
#define GLB_WIFIPLL_FBDV_RSTB_LEN     (1U)
#define GLB_WIFIPLL_FBDV_RSTB_MSK     (((1U << GLB_WIFIPLL_FBDV_RSTB_LEN) - 1) << GLB_WIFIPLL_FBDV_RSTB_POS)
#define GLB_WIFIPLL_FBDV_RSTB_UMSK    (~(((1U << GLB_WIFIPLL_FBDV_RSTB_LEN) - 1) << GLB_WIFIPLL_FBDV_RSTB_POS))
#define GLB_WIFIPLL_REFDIV_RSTB       GLB_WIFIPLL_REFDIV_RSTB
#define GLB_WIFIPLL_REFDIV_RSTB_POS   (3U)
#define GLB_WIFIPLL_REFDIV_RSTB_LEN   (1U)
#define GLB_WIFIPLL_REFDIV_RSTB_MSK   (((1U << GLB_WIFIPLL_REFDIV_RSTB_LEN) - 1) << GLB_WIFIPLL_REFDIV_RSTB_POS)
#define GLB_WIFIPLL_REFDIV_RSTB_UMSK  (~(((1U << GLB_WIFIPLL_REFDIV_RSTB_LEN) - 1) << GLB_WIFIPLL_REFDIV_RSTB_POS))
#define GLB_PU_WIFIPLL_POSTDIV        GLB_PU_WIFIPLL_POSTDIV
#define GLB_PU_WIFIPLL_POSTDIV_POS    (4U)
#define GLB_PU_WIFIPLL_POSTDIV_LEN    (1U)
#define GLB_PU_WIFIPLL_POSTDIV_MSK    (((1U << GLB_PU_WIFIPLL_POSTDIV_LEN) - 1) << GLB_PU_WIFIPLL_POSTDIV_POS)
#define GLB_PU_WIFIPLL_POSTDIV_UMSK   (~(((1U << GLB_PU_WIFIPLL_POSTDIV_LEN) - 1) << GLB_PU_WIFIPLL_POSTDIV_POS))
#define GLB_PU_WIFIPLL_FBDV           GLB_PU_WIFIPLL_FBDV
#define GLB_PU_WIFIPLL_FBDV_POS       (5U)
#define GLB_PU_WIFIPLL_FBDV_LEN       (1U)
#define GLB_PU_WIFIPLL_FBDV_MSK       (((1U << GLB_PU_WIFIPLL_FBDV_LEN) - 1) << GLB_PU_WIFIPLL_FBDV_POS)
#define GLB_PU_WIFIPLL_FBDV_UMSK      (~(((1U << GLB_PU_WIFIPLL_FBDV_LEN) - 1) << GLB_PU_WIFIPLL_FBDV_POS))
#define GLB_PU_WIFIPLL_CLAMP_OP       GLB_PU_WIFIPLL_CLAMP_OP
#define GLB_PU_WIFIPLL_CLAMP_OP_POS   (6U)
#define GLB_PU_WIFIPLL_CLAMP_OP_LEN   (1U)
#define GLB_PU_WIFIPLL_CLAMP_OP_MSK   (((1U << GLB_PU_WIFIPLL_CLAMP_OP_LEN) - 1) << GLB_PU_WIFIPLL_CLAMP_OP_POS)
#define GLB_PU_WIFIPLL_CLAMP_OP_UMSK  (~(((1U << GLB_PU_WIFIPLL_CLAMP_OP_LEN) - 1) << GLB_PU_WIFIPLL_CLAMP_OP_POS))
#define GLB_PU_WIFIPLL_PFD            GLB_PU_WIFIPLL_PFD
#define GLB_PU_WIFIPLL_PFD_POS        (7U)
#define GLB_PU_WIFIPLL_PFD_LEN        (1U)
#define GLB_PU_WIFIPLL_PFD_MSK        (((1U << GLB_PU_WIFIPLL_PFD_LEN) - 1) << GLB_PU_WIFIPLL_PFD_POS)
#define GLB_PU_WIFIPLL_PFD_UMSK       (~(((1U << GLB_PU_WIFIPLL_PFD_LEN) - 1) << GLB_PU_WIFIPLL_PFD_POS))
#define GLB_PU_WIFIPLL_CP             GLB_PU_WIFIPLL_CP
#define GLB_PU_WIFIPLL_CP_POS         (8U)
#define GLB_PU_WIFIPLL_CP_LEN         (1U)
#define GLB_PU_WIFIPLL_CP_MSK         (((1U << GLB_PU_WIFIPLL_CP_LEN) - 1) << GLB_PU_WIFIPLL_CP_POS)
#define GLB_PU_WIFIPLL_CP_UMSK        (~(((1U << GLB_PU_WIFIPLL_CP_LEN) - 1) << GLB_PU_WIFIPLL_CP_POS))
#define GLB_PU_WIFIPLL_SFREG          GLB_PU_WIFIPLL_SFREG
#define GLB_PU_WIFIPLL_SFREG_POS      (9U)
#define GLB_PU_WIFIPLL_SFREG_LEN      (1U)
#define GLB_PU_WIFIPLL_SFREG_MSK      (((1U << GLB_PU_WIFIPLL_SFREG_LEN) - 1) << GLB_PU_WIFIPLL_SFREG_POS)
#define GLB_PU_WIFIPLL_SFREG_UMSK     (~(((1U << GLB_PU_WIFIPLL_SFREG_LEN) - 1) << GLB_PU_WIFIPLL_SFREG_POS))
#define GLB_PU_WIFIPLL                GLB_PU_WIFIPLL
#define GLB_PU_WIFIPLL_POS            (10U)
#define GLB_PU_WIFIPLL_LEN            (1U)
#define GLB_PU_WIFIPLL_MSK            (((1U << GLB_PU_WIFIPLL_LEN) - 1) << GLB_PU_WIFIPLL_POS)
#define GLB_PU_WIFIPLL_UMSK           (~(((1U << GLB_PU_WIFIPLL_LEN) - 1) << GLB_PU_WIFIPLL_POS))
#define GLB_PU_WIFIPLL_CLKTREE        GLB_PU_WIFIPLL_CLKTREE
#define GLB_PU_WIFIPLL_CLKTREE_POS    (11U)
#define GLB_PU_WIFIPLL_CLKTREE_LEN    (1U)
#define GLB_PU_WIFIPLL_CLKTREE_MSK    (((1U << GLB_PU_WIFIPLL_CLKTREE_LEN) - 1) << GLB_PU_WIFIPLL_CLKTREE_POS)
#define GLB_PU_WIFIPLL_CLKTREE_UMSK   (~(((1U << GLB_PU_WIFIPLL_CLKTREE_LEN) - 1) << GLB_PU_WIFIPLL_CLKTREE_POS))

/* 0x814 : wifi_pll_cfg1 */
#define GLB_WIFI_PLL_CFG1_OFFSET      (0x814)
#define GLB_WIFIPLL_POSTDIV           GLB_WIFIPLL_POSTDIV
#define GLB_WIFIPLL_POSTDIV_POS       (0U)
#define GLB_WIFIPLL_POSTDIV_LEN       (7U)
#define GLB_WIFIPLL_POSTDIV_MSK       (((1U << GLB_WIFIPLL_POSTDIV_LEN) - 1) << GLB_WIFIPLL_POSTDIV_POS)
#define GLB_WIFIPLL_POSTDIV_UMSK      (~(((1U << GLB_WIFIPLL_POSTDIV_LEN) - 1) << GLB_WIFIPLL_POSTDIV_POS))
#define GLB_WIFIPLL_REFDIV_RATIO      GLB_WIFIPLL_REFDIV_RATIO
#define GLB_WIFIPLL_REFDIV_RATIO_POS  (8U)
#define GLB_WIFIPLL_REFDIV_RATIO_LEN  (4U)
#define GLB_WIFIPLL_REFDIV_RATIO_MSK  (((1U << GLB_WIFIPLL_REFDIV_RATIO_LEN) - 1) << GLB_WIFIPLL_REFDIV_RATIO_POS)
#define GLB_WIFIPLL_REFDIV_RATIO_UMSK (~(((1U << GLB_WIFIPLL_REFDIV_RATIO_LEN) - 1) << GLB_WIFIPLL_REFDIV_RATIO_POS))
#define GLB_WIFIPLL_REFCLK_SEL        GLB_WIFIPLL_REFCLK_SEL
#define GLB_WIFIPLL_REFCLK_SEL_POS    (16U)
#define GLB_WIFIPLL_REFCLK_SEL_LEN    (2U)
#define GLB_WIFIPLL_REFCLK_SEL_MSK    (((1U << GLB_WIFIPLL_REFCLK_SEL_LEN) - 1) << GLB_WIFIPLL_REFCLK_SEL_POS)
#define GLB_WIFIPLL_REFCLK_SEL_UMSK   (~(((1U << GLB_WIFIPLL_REFCLK_SEL_LEN) - 1) << GLB_WIFIPLL_REFCLK_SEL_POS))
#define GLB_WIFIPLL_VG11_SEL          GLB_WIFIPLL_VG11_SEL
#define GLB_WIFIPLL_VG11_SEL_POS      (20U)
#define GLB_WIFIPLL_VG11_SEL_LEN      (2U)
#define GLB_WIFIPLL_VG11_SEL_MSK      (((1U << GLB_WIFIPLL_VG11_SEL_LEN) - 1) << GLB_WIFIPLL_VG11_SEL_POS)
#define GLB_WIFIPLL_VG11_SEL_UMSK     (~(((1U << GLB_WIFIPLL_VG11_SEL_LEN) - 1) << GLB_WIFIPLL_VG11_SEL_POS))
#define GLB_WIFIPLL_VG13_SEL          GLB_WIFIPLL_VG13_SEL
#define GLB_WIFIPLL_VG13_SEL_POS      (24U)
#define GLB_WIFIPLL_VG13_SEL_LEN      (2U)
#define GLB_WIFIPLL_VG13_SEL_MSK      (((1U << GLB_WIFIPLL_VG13_SEL_LEN) - 1) << GLB_WIFIPLL_VG13_SEL_POS)
#define GLB_WIFIPLL_VG13_SEL_UMSK     (~(((1U << GLB_WIFIPLL_VG13_SEL_LEN) - 1) << GLB_WIFIPLL_VG13_SEL_POS))

/* 0x818 : wifi_pll_cfg2 */
#define GLB_WIFI_PLL_CFG2_OFFSET       (0x818)
#define GLB_WIFIPLL_SEL_CP_BIAS        GLB_WIFIPLL_SEL_CP_BIAS
#define GLB_WIFIPLL_SEL_CP_BIAS_POS    (0U)
#define GLB_WIFIPLL_SEL_CP_BIAS_LEN    (1U)
#define GLB_WIFIPLL_SEL_CP_BIAS_MSK    (((1U << GLB_WIFIPLL_SEL_CP_BIAS_LEN) - 1) << GLB_WIFIPLL_SEL_CP_BIAS_POS)
#define GLB_WIFIPLL_SEL_CP_BIAS_UMSK   (~(((1U << GLB_WIFIPLL_SEL_CP_BIAS_LEN) - 1) << GLB_WIFIPLL_SEL_CP_BIAS_POS))
#define GLB_WIFIPLL_ICP_5U             GLB_WIFIPLL_ICP_5U
#define GLB_WIFIPLL_ICP_5U_POS         (4U)
#define GLB_WIFIPLL_ICP_5U_LEN         (2U)
#define GLB_WIFIPLL_ICP_5U_MSK         (((1U << GLB_WIFIPLL_ICP_5U_LEN) - 1) << GLB_WIFIPLL_ICP_5U_POS)
#define GLB_WIFIPLL_ICP_5U_UMSK        (~(((1U << GLB_WIFIPLL_ICP_5U_LEN) - 1) << GLB_WIFIPLL_ICP_5U_POS))
#define GLB_WIFIPLL_ICP_1U             GLB_WIFIPLL_ICP_1U
#define GLB_WIFIPLL_ICP_1U_POS         (6U)
#define GLB_WIFIPLL_ICP_1U_LEN         (2U)
#define GLB_WIFIPLL_ICP_1U_MSK         (((1U << GLB_WIFIPLL_ICP_1U_LEN) - 1) << GLB_WIFIPLL_ICP_1U_POS)
#define GLB_WIFIPLL_ICP_1U_UMSK        (~(((1U << GLB_WIFIPLL_ICP_1U_LEN) - 1) << GLB_WIFIPLL_ICP_1U_POS))
#define GLB_WIFIPLL_INT_FRAC_SW        GLB_WIFIPLL_INT_FRAC_SW
#define GLB_WIFIPLL_INT_FRAC_SW_POS    (8U)
#define GLB_WIFIPLL_INT_FRAC_SW_LEN    (1U)
#define GLB_WIFIPLL_INT_FRAC_SW_MSK    (((1U << GLB_WIFIPLL_INT_FRAC_SW_LEN) - 1) << GLB_WIFIPLL_INT_FRAC_SW_POS)
#define GLB_WIFIPLL_INT_FRAC_SW_UMSK   (~(((1U << GLB_WIFIPLL_INT_FRAC_SW_LEN) - 1) << GLB_WIFIPLL_INT_FRAC_SW_POS))
#define GLB_WIFIPLL_CP_STARTUP_EN      GLB_WIFIPLL_CP_STARTUP_EN
#define GLB_WIFIPLL_CP_STARTUP_EN_POS  (9U)
#define GLB_WIFIPLL_CP_STARTUP_EN_LEN  (1U)
#define GLB_WIFIPLL_CP_STARTUP_EN_MSK  (((1U << GLB_WIFIPLL_CP_STARTUP_EN_LEN) - 1) << GLB_WIFIPLL_CP_STARTUP_EN_POS)
#define GLB_WIFIPLL_CP_STARTUP_EN_UMSK (~(((1U << GLB_WIFIPLL_CP_STARTUP_EN_LEN) - 1) << GLB_WIFIPLL_CP_STARTUP_EN_POS))
#define GLB_WIFIPLL_CP_OPAMP_EN        GLB_WIFIPLL_CP_OPAMP_EN
#define GLB_WIFIPLL_CP_OPAMP_EN_POS    (10U)
#define GLB_WIFIPLL_CP_OPAMP_EN_LEN    (1U)
#define GLB_WIFIPLL_CP_OPAMP_EN_MSK    (((1U << GLB_WIFIPLL_CP_OPAMP_EN_LEN) - 1) << GLB_WIFIPLL_CP_OPAMP_EN_POS)
#define GLB_WIFIPLL_CP_OPAMP_EN_UMSK   (~(((1U << GLB_WIFIPLL_CP_OPAMP_EN_LEN) - 1) << GLB_WIFIPLL_CP_OPAMP_EN_POS))

