XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/glb_reg.h
/* 0x81C : wifi_pll_cfg3 */
#define GLB_WIFI_PLL_CFG3_OFFSET  (0x81C)
#define GLB_WIFIPLL_C4_EN         GLB_WIFIPLL_C4_EN
#define GLB_WIFIPLL_C4_EN_POS     (0U)
#define GLB_WIFIPLL_C4_EN_LEN     (1U)
#define GLB_WIFIPLL_C4_EN_MSK     (((1U << GLB_WIFIPLL_C4_EN_LEN) - 1) << GLB_WIFIPLL_C4_EN_POS)
#define GLB_WIFIPLL_C4_EN_UMSK    (~(((1U << GLB_WIFIPLL_C4_EN_LEN) - 1) << GLB_WIFIPLL_C4_EN_POS))
#define GLB_WIFIPLL_R4            GLB_WIFIPLL_R4
#define GLB_WIFIPLL_R4_POS        (4U)
#define GLB_WIFIPLL_R4_LEN        (2U)
#define GLB_WIFIPLL_R4_MSK        (((1U << GLB_WIFIPLL_R4_LEN) - 1) << GLB_WIFIPLL_R4_POS)
#define GLB_WIFIPLL_R4_UMSK       (~(((1U << GLB_WIFIPLL_R4_LEN) - 1) << GLB_WIFIPLL_R4_POS))
#define GLB_WIFIPLL_R4_SHORT      GLB_WIFIPLL_R4_SHORT
#define GLB_WIFIPLL_R4_SHORT_POS  (8U)
#define GLB_WIFIPLL_R4_SHORT_LEN  (1U)
#define GLB_WIFIPLL_R4_SHORT_MSK  (((1U << GLB_WIFIPLL_R4_SHORT_LEN) - 1) << GLB_WIFIPLL_R4_SHORT_POS)
#define GLB_WIFIPLL_R4_SHORT_UMSK (~(((1U << GLB_WIFIPLL_R4_SHORT_LEN) - 1) << GLB_WIFIPLL_R4_SHORT_POS))
#define GLB_WIFIPLL_C3            GLB_WIFIPLL_C3
#define GLB_WIFIPLL_C3_POS        (12U)
#define GLB_WIFIPLL_C3_LEN        (2U)
#define GLB_WIFIPLL_C3_MSK        (((1U << GLB_WIFIPLL_C3_LEN) - 1) << GLB_WIFIPLL_C3_POS)
#define GLB_WIFIPLL_C3_UMSK       (~(((1U << GLB_WIFIPLL_C3_LEN) - 1) << GLB_WIFIPLL_C3_POS))
#define GLB_WIFIPLL_CZ            GLB_WIFIPLL_CZ
#define GLB_WIFIPLL_CZ_POS        (14U)
#define GLB_WIFIPLL_CZ_LEN        (2U)
#define GLB_WIFIPLL_CZ_MSK        (((1U << GLB_WIFIPLL_CZ_LEN) - 1) << GLB_WIFIPLL_CZ_POS)
#define GLB_WIFIPLL_CZ_UMSK       (~(((1U << GLB_WIFIPLL_CZ_LEN) - 1) << GLB_WIFIPLL_CZ_POS))
#define GLB_WIFIPLL_RZ            GLB_WIFIPLL_RZ
#define GLB_WIFIPLL_RZ_POS        (16U)
#define GLB_WIFIPLL_RZ_LEN        (3U)
#define GLB_WIFIPLL_RZ_MSK        (((1U << GLB_WIFIPLL_RZ_LEN) - 1) << GLB_WIFIPLL_RZ_POS)
#define GLB_WIFIPLL_RZ_UMSK       (~(((1U << GLB_WIFIPLL_RZ_LEN) - 1) << GLB_WIFIPLL_RZ_POS))

/* 0x820 : wifi_pll_cfg4 */
#define GLB_WIFI_PLL_CFG4_OFFSET        (0x820)
#define GLB_WIFIPLL_SEL_SAMPLE_CLK      GLB_WIFIPLL_SEL_SAMPLE_CLK
#define GLB_WIFIPLL_SEL_SAMPLE_CLK_POS  (0U)
#define GLB_WIFIPLL_SEL_SAMPLE_CLK_LEN  (2U)
#define GLB_WIFIPLL_SEL_SAMPLE_CLK_MSK  (((1U << GLB_WIFIPLL_SEL_SAMPLE_CLK_LEN) - 1) << GLB_WIFIPLL_SEL_SAMPLE_CLK_POS)
#define GLB_WIFIPLL_SEL_SAMPLE_CLK_UMSK (~(((1U << GLB_WIFIPLL_SEL_SAMPLE_CLK_LEN) - 1) << GLB_WIFIPLL_SEL_SAMPLE_CLK_POS))
#define GLB_WIFIPLL_SEL_FB_CLK          GLB_WIFIPLL_SEL_FB_CLK
#define GLB_WIFIPLL_SEL_FB_CLK_POS      (4U)
#define GLB_WIFIPLL_SEL_FB_CLK_LEN      (2U)
#define GLB_WIFIPLL_SEL_FB_CLK_MSK      (((1U << GLB_WIFIPLL_SEL_FB_CLK_LEN) - 1) << GLB_WIFIPLL_SEL_FB_CLK_POS)
#define GLB_WIFIPLL_SEL_FB_CLK_UMSK     (~(((1U << GLB_WIFIPLL_SEL_FB_CLK_LEN) - 1) << GLB_WIFIPLL_SEL_FB_CLK_POS))
#define GLB_WIFIPLL_SDMCLK_SEL          GLB_WIFIPLL_SDMCLK_SEL
#define GLB_WIFIPLL_SDMCLK_SEL_POS      (8U)
#define GLB_WIFIPLL_SDMCLK_SEL_LEN      (1U)
#define GLB_WIFIPLL_SDMCLK_SEL_MSK      (((1U << GLB_WIFIPLL_SDMCLK_SEL_LEN) - 1) << GLB_WIFIPLL_SDMCLK_SEL_POS)
#define GLB_WIFIPLL_SDMCLK_SEL_UMSK     (~(((1U << GLB_WIFIPLL_SDMCLK_SEL_LEN) - 1) << GLB_WIFIPLL_SDMCLK_SEL_POS))

/* 0x824 : wifi_pll_cfg5 */
#define GLB_WIFI_PLL_CFG5_OFFSET     (0x824)
#define GLB_WIFIPLL_VCO_SPEED        GLB_WIFIPLL_VCO_SPEED
#define GLB_WIFIPLL_VCO_SPEED_POS    (0U)
#define GLB_WIFIPLL_VCO_SPEED_LEN    (3U)
#define GLB_WIFIPLL_VCO_SPEED_MSK    (((1U << GLB_WIFIPLL_VCO_SPEED_LEN) - 1) << GLB_WIFIPLL_VCO_SPEED_POS)
#define GLB_WIFIPLL_VCO_SPEED_UMSK   (~(((1U << GLB_WIFIPLL_VCO_SPEED_LEN) - 1) << GLB_WIFIPLL_VCO_SPEED_POS))
#define GLB_WIFIPLL_VCO_DIV1_EN      GLB_WIFIPLL_VCO_DIV1_EN
#define GLB_WIFIPLL_VCO_DIV1_EN_POS  (4U)
#define GLB_WIFIPLL_VCO_DIV1_EN_LEN  (1U)
#define GLB_WIFIPLL_VCO_DIV1_EN_MSK  (((1U << GLB_WIFIPLL_VCO_DIV1_EN_LEN) - 1) << GLB_WIFIPLL_VCO_DIV1_EN_POS)
#define GLB_WIFIPLL_VCO_DIV1_EN_UMSK (~(((1U << GLB_WIFIPLL_VCO_DIV1_EN_LEN) - 1) << GLB_WIFIPLL_VCO_DIV1_EN_POS))
#define GLB_WIFIPLL_VCO_DIV2_EN      GLB_WIFIPLL_VCO_DIV2_EN
#define GLB_WIFIPLL_VCO_DIV2_EN_POS  (8U)
#define GLB_WIFIPLL_VCO_DIV2_EN_LEN  (1U)
#define GLB_WIFIPLL_VCO_DIV2_EN_MSK  (((1U << GLB_WIFIPLL_VCO_DIV2_EN_LEN) - 1) << GLB_WIFIPLL_VCO_DIV2_EN_POS)
#define GLB_WIFIPLL_VCO_DIV2_EN_UMSK (~(((1U << GLB_WIFIPLL_VCO_DIV2_EN_LEN) - 1) << GLB_WIFIPLL_VCO_DIV2_EN_POS))
#define GLB_WIFIPLL_VCO_DIV3_EN      GLB_WIFIPLL_VCO_DIV3_EN
#define GLB_WIFIPLL_VCO_DIV3_EN_POS  (12U)
#define GLB_WIFIPLL_VCO_DIV3_EN_LEN  (1U)
#define GLB_WIFIPLL_VCO_DIV3_EN_MSK  (((1U << GLB_WIFIPLL_VCO_DIV3_EN_LEN) - 1) << GLB_WIFIPLL_VCO_DIV3_EN_POS)
#define GLB_WIFIPLL_VCO_DIV3_EN_UMSK (~(((1U << GLB_WIFIPLL_VCO_DIV3_EN_LEN) - 1) << GLB_WIFIPLL_VCO_DIV3_EN_POS))

/* 0x828 : wifi_pll_cfg6 */
#define GLB_WIFI_PLL_CFG6_OFFSET       (0x828)
#define GLB_WIFIPLL_SDMIN              GLB_WIFIPLL_SDMIN
#define GLB_WIFIPLL_SDMIN_POS          (0U)
#define GLB_WIFIPLL_SDMIN_LEN          (26U)
#define GLB_WIFIPLL_SDMIN_MSK          (((1U << GLB_WIFIPLL_SDMIN_LEN) - 1) << GLB_WIFIPLL_SDMIN_POS)
#define GLB_WIFIPLL_SDMIN_UMSK         (~(((1U << GLB_WIFIPLL_SDMIN_LEN) - 1) << GLB_WIFIPLL_SDMIN_POS))
#define GLB_WIFIPLL_SDM_BYPASS         GLB_WIFIPLL_SDM_BYPASS
#define GLB_WIFIPLL_SDM_BYPASS_POS     (28U)
#define GLB_WIFIPLL_SDM_BYPASS_LEN     (1U)
#define GLB_WIFIPLL_SDM_BYPASS_MSK     (((1U << GLB_WIFIPLL_SDM_BYPASS_LEN) - 1) << GLB_WIFIPLL_SDM_BYPASS_POS)
#define GLB_WIFIPLL_SDM_BYPASS_UMSK    (~(((1U << GLB_WIFIPLL_SDM_BYPASS_LEN) - 1) << GLB_WIFIPLL_SDM_BYPASS_POS))
#define GLB_WIFIPLL_SDM_BYPASS_HW      GLB_WIFIPLL_SDM_BYPASS_HW
#define GLB_WIFIPLL_SDM_BYPASS_HW_POS  (29U)
#define GLB_WIFIPLL_SDM_BYPASS_HW_LEN  (1U)
#define GLB_WIFIPLL_SDM_BYPASS_HW_MSK  (((1U << GLB_WIFIPLL_SDM_BYPASS_HW_LEN) - 1) << GLB_WIFIPLL_SDM_BYPASS_HW_POS)
#define GLB_WIFIPLL_SDM_BYPASS_HW_UMSK (~(((1U << GLB_WIFIPLL_SDM_BYPASS_HW_LEN) - 1) << GLB_WIFIPLL_SDM_BYPASS_HW_POS))
#define GLB_WIFIPLL_SDM_CTRL_HW        GLB_WIFIPLL_SDM_CTRL_HW
#define GLB_WIFIPLL_SDM_CTRL_HW_POS    (31U)
#define GLB_WIFIPLL_SDM_CTRL_HW_LEN    (1U)
#define GLB_WIFIPLL_SDM_CTRL_HW_MSK    (((1U << GLB_WIFIPLL_SDM_CTRL_HW_LEN) - 1) << GLB_WIFIPLL_SDM_CTRL_HW_POS)
#define GLB_WIFIPLL_SDM_CTRL_HW_UMSK   (~(((1U << GLB_WIFIPLL_SDM_CTRL_HW_LEN) - 1) << GLB_WIFIPLL_SDM_CTRL_HW_POS))

