XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/glb_reg.h
/* 0x838 : wifi_pll_cfg10 */
#define GLB_WIFI_PLL_CFG10_OFFSET         (0x838)
#define GLB_USBPLL_SSC_START              GLB_USBPLL_SSC_START
#define GLB_USBPLL_SSC_START_POS          (2U)
#define GLB_USBPLL_SSC_START_LEN          (1U)
#define GLB_USBPLL_SSC_START_MSK          (((1U << GLB_USBPLL_SSC_START_LEN) - 1) << GLB_USBPLL_SSC_START_POS)
#define GLB_USBPLL_SSC_START_UMSK         (~(((1U << GLB_USBPLL_SSC_START_LEN) - 1) << GLB_USBPLL_SSC_START_POS))
#define GLB_USBPLL_SSC_START_GATE_EN      GLB_USBPLL_SSC_START_GATE_EN
#define GLB_USBPLL_SSC_START_GATE_EN_POS  (3U)
#define GLB_USBPLL_SSC_START_GATE_EN_LEN  (1U)
#define GLB_USBPLL_SSC_START_GATE_EN_MSK  (((1U << GLB_USBPLL_SSC_START_GATE_EN_LEN) - 1) << GLB_USBPLL_SSC_START_GATE_EN_POS)
#define GLB_USBPLL_SSC_START_GATE_EN_UMSK (~(((1U << GLB_USBPLL_SSC_START_GATE_EN_LEN) - 1) << GLB_USBPLL_SSC_START_GATE_EN_POS))
#define GLB_USBPLL_SSC_GAIN               GLB_USBPLL_SSC_GAIN
#define GLB_USBPLL_SSC_GAIN_POS           (4U)
#define GLB_USBPLL_SSC_GAIN_LEN           (3U)
#define GLB_USBPLL_SSC_GAIN_MSK           (((1U << GLB_USBPLL_SSC_GAIN_LEN) - 1) << GLB_USBPLL_SSC_GAIN_POS)
#define GLB_USBPLL_SSC_GAIN_UMSK          (~(((1U << GLB_USBPLL_SSC_GAIN_LEN) - 1) << GLB_USBPLL_SSC_GAIN_POS))
#define GLB_USBPLL_SSC_EN                 GLB_USBPLL_SSC_EN
#define GLB_USBPLL_SSC_EN_POS             (8U)
#define GLB_USBPLL_SSC_EN_LEN             (1U)
#define GLB_USBPLL_SSC_EN_MSK             (((1U << GLB_USBPLL_SSC_EN_LEN) - 1) << GLB_USBPLL_SSC_EN_POS)
#define GLB_USBPLL_SSC_EN_UMSK            (~(((1U << GLB_USBPLL_SSC_EN_LEN) - 1) << GLB_USBPLL_SSC_EN_POS))
#define GLB_USBPLL_SDM_BYPASS             GLB_USBPLL_SDM_BYPASS
#define GLB_USBPLL_SDM_BYPASS_POS         (9U)
#define GLB_USBPLL_SDM_BYPASS_LEN         (1U)
#define GLB_USBPLL_SDM_BYPASS_MSK         (((1U << GLB_USBPLL_SDM_BYPASS_LEN) - 1) << GLB_USBPLL_SDM_BYPASS_POS)
#define GLB_USBPLL_SDM_BYPASS_UMSK        (~(((1U << GLB_USBPLL_SDM_BYPASS_LEN) - 1) << GLB_USBPLL_SDM_BYPASS_POS))
#define GLB_USBPLL_SDM_ORDER_SEL          GLB_USBPLL_SDM_ORDER_SEL
#define GLB_USBPLL_SDM_ORDER_SEL_POS      (10U)
#define GLB_USBPLL_SDM_ORDER_SEL_LEN      (1U)
#define GLB_USBPLL_SDM_ORDER_SEL_MSK      (((1U << GLB_USBPLL_SDM_ORDER_SEL_LEN) - 1) << GLB_USBPLL_SDM_ORDER_SEL_POS)
#define GLB_USBPLL_SDM_ORDER_SEL_UMSK     (~(((1U << GLB_USBPLL_SDM_ORDER_SEL_LEN) - 1) << GLB_USBPLL_SDM_ORDER_SEL_POS))
#define GLB_USBPLL_SDM_SIG_DITH_SEL       GLB_USBPLL_SDM_SIG_DITH_SEL
#define GLB_USBPLL_SDM_SIG_DITH_SEL_POS   (16U)
#define GLB_USBPLL_SDM_SIG_DITH_SEL_LEN   (2U)
#define GLB_USBPLL_SDM_SIG_DITH_SEL_MSK   (((1U << GLB_USBPLL_SDM_SIG_DITH_SEL_LEN) - 1) << GLB_USBPLL_SDM_SIG_DITH_SEL_POS)
#define GLB_USBPLL_SDM_SIG_DITH_SEL_UMSK  (~(((1U << GLB_USBPLL_SDM_SIG_DITH_SEL_LEN) - 1) << GLB_USBPLL_SDM_SIG_DITH_SEL_POS))
#define GLB_USBPLL_DIV2_EN                GLB_USBPLL_DIV2_EN
#define GLB_USBPLL_DIV2_EN_POS            (20U)
#define GLB_USBPLL_DIV2_EN_LEN            (1U)
#define GLB_USBPLL_DIV2_EN_MSK            (((1U << GLB_USBPLL_DIV2_EN_LEN) - 1) << GLB_USBPLL_DIV2_EN_POS)
#define GLB_USBPLL_DIV2_EN_UMSK           (~(((1U << GLB_USBPLL_DIV2_EN_LEN) - 1) << GLB_USBPLL_DIV2_EN_POS))
#define GLB_USBPLL_CLKOUT_EN              GLB_USBPLL_CLKOUT_EN
#define GLB_USBPLL_CLKOUT_EN_POS          (21U)
#define GLB_USBPLL_CLKOUT_EN_LEN          (1U)
#define GLB_USBPLL_CLKOUT_EN_MSK          (((1U << GLB_USBPLL_CLKOUT_EN_LEN) - 1) << GLB_USBPLL_CLKOUT_EN_POS)
#define GLB_USBPLL_CLKOUT_EN_UMSK         (~(((1U << GLB_USBPLL_CLKOUT_EN_LEN) - 1) << GLB_USBPLL_CLKOUT_EN_POS))
#define GLB_USBPLL_SEL_SAMPLE_CLK         GLB_USBPLL_SEL_SAMPLE_CLK
#define GLB_USBPLL_SEL_SAMPLE_CLK_POS     (24U)
#define GLB_USBPLL_SEL_SAMPLE_CLK_LEN     (2U)
#define GLB_USBPLL_SEL_SAMPLE_CLK_MSK     (((1U << GLB_USBPLL_SEL_SAMPLE_CLK_LEN) - 1) << GLB_USBPLL_SEL_SAMPLE_CLK_POS)
#define GLB_USBPLL_SEL_SAMPLE_CLK_UMSK    (~(((1U << GLB_USBPLL_SEL_SAMPLE_CLK_LEN) - 1) << GLB_USBPLL_SEL_SAMPLE_CLK_POS))
#define GLB_USBPLL_RSTB                   GLB_USBPLL_RSTB
#define GLB_USBPLL_RSTB_POS               (28U)
#define GLB_USBPLL_RSTB_LEN               (1U)
#define GLB_USBPLL_RSTB_MSK               (((1U << GLB_USBPLL_RSTB_LEN) - 1) << GLB_USBPLL_RSTB_POS)
#define GLB_USBPLL_RSTB_UMSK              (~(((1U << GLB_USBPLL_RSTB_LEN) - 1) << GLB_USBPLL_RSTB_POS))
#define GLB_PU_USBPLL_MMDIV               GLB_PU_USBPLL_MMDIV
#define GLB_PU_USBPLL_MMDIV_POS           (29U)
#define GLB_PU_USBPLL_MMDIV_LEN           (1U)
#define GLB_PU_USBPLL_MMDIV_MSK           (((1U << GLB_PU_USBPLL_MMDIV_LEN) - 1) << GLB_PU_USBPLL_MMDIV_POS)
#define GLB_PU_USBPLL_MMDIV_UMSK          (~(((1U << GLB_PU_USBPLL_MMDIV_LEN) - 1) << GLB_PU_USBPLL_MMDIV_POS))

/* 0x83C : wifi_pll_cfg11 */
#define GLB_WIFI_PLL_CFG11_OFFSET (0x83C)
#define GLB_USBPLL_SDMIN          GLB_USBPLL_SDMIN
#define GLB_USBPLL_SDMIN_POS      (0U)
#define GLB_USBPLL_SDMIN_LEN      (19U)
#define GLB_USBPLL_SDMIN_MSK      (((1U << GLB_USBPLL_SDMIN_LEN) - 1) << GLB_USBPLL_SDMIN_POS)
#define GLB_USBPLL_SDMIN_UMSK     (~(((1U << GLB_USBPLL_SDMIN_LEN) - 1) << GLB_USBPLL_SDMIN_POS))

/* 0x840 : wifi_pll_cfg12 */
#define GLB_WIFI_PLL_CFG12_OFFSET (0x840)
#define GLB_USBPLL_SSC_CNT        GLB_USBPLL_SSC_CNT
#define GLB_USBPLL_SSC_CNT_POS    (0U)
#define GLB_USBPLL_SSC_CNT_LEN    (9U)
#define GLB_USBPLL_SSC_CNT_MSK    (((1U << GLB_USBPLL_SSC_CNT_LEN) - 1) << GLB_USBPLL_SSC_CNT_POS)
#define GLB_USBPLL_SSC_CNT_UMSK   (~(((1U << GLB_USBPLL_SSC_CNT_LEN) - 1) << GLB_USBPLL_SSC_CNT_POS))

/* 0x844 : wifi_pll_cfg13 */
#define GLB_WIFI_PLL_CFG13_OFFSET          (0x844)
#define GLB_WIFIPLL_RESV                   GLB_WIFIPLL_RESV
#define GLB_WIFIPLL_RESV_POS               (0U)
#define GLB_WIFIPLL_RESV_LEN               (16U)
#define GLB_WIFIPLL_RESV_MSK               (((1U << GLB_WIFIPLL_RESV_LEN) - 1) << GLB_WIFIPLL_RESV_POS)
#define GLB_WIFIPLL_RESV_UMSK              (~(((1U << GLB_WIFIPLL_RESV_LEN) - 1) << GLB_WIFIPLL_RESV_POS))
#define GLB_USBPLL_DL_CTRL                 GLB_USBPLL_DL_CTRL
#define GLB_USBPLL_DL_CTRL_POS             (21U)
#define GLB_USBPLL_DL_CTRL_LEN             (1U)
#define GLB_USBPLL_DL_CTRL_MSK             (((1U << GLB_USBPLL_DL_CTRL_LEN) - 1) << GLB_USBPLL_DL_CTRL_POS)
#define GLB_USBPLL_DL_CTRL_UMSK            (~(((1U << GLB_USBPLL_DL_CTRL_LEN) - 1) << GLB_USBPLL_DL_CTRL_POS))
#define GLB_WIFIPLL_DL_CTRL_30_BZ_ADC      GLB_WIFIPLL_DL_CTRL_30_BZ_ADC
#define GLB_WIFIPLL_DL_CTRL_30_BZ_ADC_POS  (22U)
#define GLB_WIFIPLL_DL_CTRL_30_BZ_ADC_LEN  (1U)
#define GLB_WIFIPLL_DL_CTRL_30_BZ_ADC_MSK  (((1U << GLB_WIFIPLL_DL_CTRL_30_BZ_ADC_LEN) - 1) << GLB_WIFIPLL_DL_CTRL_30_BZ_ADC_POS)
#define GLB_WIFIPLL_DL_CTRL_30_BZ_ADC_UMSK (~(((1U << GLB_WIFIPLL_DL_CTRL_30_BZ_ADC_LEN) - 1) << GLB_WIFIPLL_DL_CTRL_30_BZ_ADC_POS))
#define GLB_WIFIPLL_DL_CTRL_30             GLB_WIFIPLL_DL_CTRL_30
#define GLB_WIFIPLL_DL_CTRL_30_POS         (23U)
#define GLB_WIFIPLL_DL_CTRL_30_LEN         (1U)
#define GLB_WIFIPLL_DL_CTRL_30_MSK         (((1U << GLB_WIFIPLL_DL_CTRL_30_LEN) - 1) << GLB_WIFIPLL_DL_CTRL_30_POS)
#define GLB_WIFIPLL_DL_CTRL_30_UMSK        (~(((1U << GLB_WIFIPLL_DL_CTRL_30_LEN) - 1) << GLB_WIFIPLL_DL_CTRL_30_POS))
#define GLB_WIFIPLL_DL_CTRL_20             GLB_WIFIPLL_DL_CTRL_20
#define GLB_WIFIPLL_DL_CTRL_20_POS         (24U)
#define GLB_WIFIPLL_DL_CTRL_20_LEN         (1U)
#define GLB_WIFIPLL_DL_CTRL_20_MSK         (((1U << GLB_WIFIPLL_DL_CTRL_20_LEN) - 1) << GLB_WIFIPLL_DL_CTRL_20_POS)
#define GLB_WIFIPLL_DL_CTRL_20_UMSK        (~(((1U << GLB_WIFIPLL_DL_CTRL_20_LEN) - 1) << GLB_WIFIPLL_DL_CTRL_20_POS))
#define GLB_WIFIPLL_DL_CTRL_12             GLB_WIFIPLL_DL_CTRL_12
#define GLB_WIFIPLL_DL_CTRL_12_POS         (25U)
#define GLB_WIFIPLL_DL_CTRL_12_LEN         (1U)
#define GLB_WIFIPLL_DL_CTRL_12_MSK         (((1U << GLB_WIFIPLL_DL_CTRL_12_LEN) - 1) << GLB_WIFIPLL_DL_CTRL_12_POS)
#define GLB_WIFIPLL_DL_CTRL_12_UMSK        (~(((1U << GLB_WIFIPLL_DL_CTRL_12_LEN) - 1) << GLB_WIFIPLL_DL_CTRL_12_POS))
#define GLB_WIFIPLL_DL_CTRL_10             GLB_WIFIPLL_DL_CTRL_10
#define GLB_WIFIPLL_DL_CTRL_10_POS         (26U)
#define GLB_WIFIPLL_DL_CTRL_10_LEN         (1U)
#define GLB_WIFIPLL_DL_CTRL_10_MSK         (((1U << GLB_WIFIPLL_DL_CTRL_10_LEN) - 1) << GLB_WIFIPLL_DL_CTRL_10_POS)
#define GLB_WIFIPLL_DL_CTRL_10_UMSK        (~(((1U << GLB_WIFIPLL_DL_CTRL_10_LEN) - 1) << GLB_WIFIPLL_DL_CTRL_10_POS))
#define GLB_WIFIPLL_DL_CTRL_8              GLB_WIFIPLL_DL_CTRL_8
#define GLB_WIFIPLL_DL_CTRL_8_POS          (27U)
#define GLB_WIFIPLL_DL_CTRL_8_LEN          (1U)
#define GLB_WIFIPLL_DL_CTRL_8_MSK          (((1U << GLB_WIFIPLL_DL_CTRL_8_LEN) - 1) << GLB_WIFIPLL_DL_CTRL_8_POS)
#define GLB_WIFIPLL_DL_CTRL_8_UMSK         (~(((1U << GLB_WIFIPLL_DL_CTRL_8_LEN) - 1) << GLB_WIFIPLL_DL_CTRL_8_POS))
#define GLB_WIFIPLL_DL_CTRL_6              GLB_WIFIPLL_DL_CTRL_6
#define GLB_WIFIPLL_DL_CTRL_6_POS          (28U)
#define GLB_WIFIPLL_DL_CTRL_6_LEN          (1U)
#define GLB_WIFIPLL_DL_CTRL_6_MSK          (((1U << GLB_WIFIPLL_DL_CTRL_6_LEN) - 1) << GLB_WIFIPLL_DL_CTRL_6_POS)
#define GLB_WIFIPLL_DL_CTRL_6_UMSK         (~(((1U << GLB_WIFIPLL_DL_CTRL_6_LEN) - 1) << GLB_WIFIPLL_DL_CTRL_6_POS))
#define GLB_WIFIPLL_DL_CTRL_5              GLB_WIFIPLL_DL_CTRL_5
#define GLB_WIFIPLL_DL_CTRL_5_POS          (29U)
#define GLB_WIFIPLL_DL_CTRL_5_LEN          (1U)
#define GLB_WIFIPLL_DL_CTRL_5_MSK          (((1U << GLB_WIFIPLL_DL_CTRL_5_LEN) - 1) << GLB_WIFIPLL_DL_CTRL_5_POS)
#define GLB_WIFIPLL_DL_CTRL_5_UMSK         (~(((1U << GLB_WIFIPLL_DL_CTRL_5_LEN) - 1) << GLB_WIFIPLL_DL_CTRL_5_POS))
#define GLB_WIFIPLL_DL_CTRL_4              GLB_WIFIPLL_DL_CTRL_4
#define GLB_WIFIPLL_DL_CTRL_4_POS          (30U)
#define GLB_WIFIPLL_DL_CTRL_4_LEN          (1U)
#define GLB_WIFIPLL_DL_CTRL_4_MSK          (((1U << GLB_WIFIPLL_DL_CTRL_4_LEN) - 1) << GLB_WIFIPLL_DL_CTRL_4_POS)
#define GLB_WIFIPLL_DL_CTRL_4_UMSK         (~(((1U << GLB_WIFIPLL_DL_CTRL_4_LEN) - 1) << GLB_WIFIPLL_DL_CTRL_4_POS))
#define GLB_WIFIPLL_DL_CTRL_2              GLB_WIFIPLL_DL_CTRL_2
#define GLB_WIFIPLL_DL_CTRL_2_POS          (31U)
#define GLB_WIFIPLL_DL_CTRL_2_LEN          (1U)
#define GLB_WIFIPLL_DL_CTRL_2_MSK          (((1U << GLB_WIFIPLL_DL_CTRL_2_LEN) - 1) << GLB_WIFIPLL_DL_CTRL_2_POS)
#define GLB_WIFIPLL_DL_CTRL_2_UMSK         (~(((1U << GLB_WIFIPLL_DL_CTRL_2_LEN) - 1) << GLB_WIFIPLL_DL_CTRL_2_POS))

/* 0x8A4 : gauge */
#define GLB_GAUGE_OFFSET           (0x8A4)
#define GLB_GAUGE_RESERVE          GLB_GAUGE_RESERVE
#define GLB_GAUGE_RESERVE_POS      (0U)
#define GLB_GAUGE_RESERVE_LEN      (3U)
#define GLB_GAUGE_RESERVE_MSK      (((1U << GLB_GAUGE_RESERVE_LEN) - 1) << GLB_GAUGE_RESERVE_POS)
#define GLB_GAUGE_RESERVE_UMSK     (~(((1U << GLB_GAUGE_RESERVE_LEN) - 1) << GLB_GAUGE_RESERVE_POS))
#define GLB_GAUGE_ICTRL_ADC        GLB_GAUGE_ICTRL_ADC
#define GLB_GAUGE_ICTRL_ADC_POS    (3U)
#define GLB_GAUGE_ICTRL_ADC_LEN    (2U)
#define GLB_GAUGE_ICTRL_ADC_MSK    (((1U << GLB_GAUGE_ICTRL_ADC_LEN) - 1) << GLB_GAUGE_ICTRL_ADC_POS)
#define GLB_GAUGE_ICTRL_ADC_UMSK   (~(((1U << GLB_GAUGE_ICTRL_ADC_LEN) - 1) << GLB_GAUGE_ICTRL_ADC_POS))
#define GLB_GAUGE_DEM_EN           GLB_GAUGE_DEM_EN
#define GLB_GAUGE_DEM_EN_POS       (5U)
#define GLB_GAUGE_DEM_EN_LEN       (1U)
#define GLB_GAUGE_DEM_EN_MSK       (((1U << GLB_GAUGE_DEM_EN_LEN) - 1) << GLB_GAUGE_DEM_EN_POS)
#define GLB_GAUGE_DEM_EN_UMSK      (~(((1U << GLB_GAUGE_DEM_EN_LEN) - 1) << GLB_GAUGE_DEM_EN_POS))
#define GLB_GAUGE_CKB_EN           GLB_GAUGE_CKB_EN
#define GLB_GAUGE_CKB_EN_POS       (6U)
#define GLB_GAUGE_CKB_EN_LEN       (1U)
#define GLB_GAUGE_CKB_EN_MSK       (((1U << GLB_GAUGE_CKB_EN_LEN) - 1) << GLB_GAUGE_CKB_EN_POS)
#define GLB_GAUGE_CKB_EN_UMSK      (~(((1U << GLB_GAUGE_CKB_EN_LEN) - 1) << GLB_GAUGE_CKB_EN_POS))
#define GLB_GAUGE_CHOP_PHAS        GLB_GAUGE_CHOP_PHAS
#define GLB_GAUGE_CHOP_PHAS_POS    (7U)
#define GLB_GAUGE_CHOP_PHAS_LEN    (1U)
#define GLB_GAUGE_CHOP_PHAS_MSK    (((1U << GLB_GAUGE_CHOP_PHAS_LEN) - 1) << GLB_GAUGE_CHOP_PHAS_POS)
#define GLB_GAUGE_CHOP_PHAS_UMSK   (~(((1U << GLB_GAUGE_CHOP_PHAS_LEN) - 1) << GLB_GAUGE_CHOP_PHAS_POS))
#define GLB_GAUGE_CHOP_FREQ        GLB_GAUGE_CHOP_FREQ
#define GLB_GAUGE_CHOP_FREQ_POS    (8U)
#define GLB_GAUGE_CHOP_FREQ_LEN    (3U)
#define GLB_GAUGE_CHOP_FREQ_MSK    (((1U << GLB_GAUGE_CHOP_FREQ_LEN) - 1) << GLB_GAUGE_CHOP_FREQ_POS)
#define GLB_GAUGE_CHOP_FREQ_UMSK   (~(((1U << GLB_GAUGE_CHOP_FREQ_LEN) - 1) << GLB_GAUGE_CHOP_FREQ_POS))
#define GLB_GAUGE_CHOP_EN          GLB_GAUGE_CHOP_EN
#define GLB_GAUGE_CHOP_EN_POS      (11U)
#define GLB_GAUGE_CHOP_EN_LEN      (1U)
#define GLB_GAUGE_CHOP_EN_MSK      (((1U << GLB_GAUGE_CHOP_EN_LEN) - 1) << GLB_GAUGE_CHOP_EN_POS)
#define GLB_GAUGE_CHOP_EN_UMSK     (~(((1U << GLB_GAUGE_CHOP_EN_LEN) - 1) << GLB_GAUGE_CHOP_EN_POS))
#define GLB_GAUGE_SEL_EDGE         GLB_GAUGE_SEL_EDGE
#define GLB_GAUGE_SEL_EDGE_POS     (12U)
#define GLB_GAUGE_SEL_EDGE_LEN     (1U)
#define GLB_GAUGE_SEL_EDGE_MSK     (((1U << GLB_GAUGE_SEL_EDGE_LEN) - 1) << GLB_GAUGE_SEL_EDGE_POS)
#define GLB_GAUGE_SEL_EDGE_UMSK    (~(((1U << GLB_GAUGE_SEL_EDGE_LEN) - 1) << GLB_GAUGE_SEL_EDGE_POS))
#define GLB_GAUGE_QUAN_GAIN        GLB_GAUGE_QUAN_GAIN
#define GLB_GAUGE_QUAN_GAIN_POS    (13U)
#define GLB_GAUGE_QUAN_GAIN_LEN    (2U)
#define GLB_GAUGE_QUAN_GAIN_MSK    (((1U << GLB_GAUGE_QUAN_GAIN_LEN) - 1) << GLB_GAUGE_QUAN_GAIN_POS)
#define GLB_GAUGE_QUAN_GAIN_UMSK   (~(((1U << GLB_GAUGE_QUAN_GAIN_LEN) - 1) << GLB_GAUGE_QUAN_GAIN_POS))
#define GLB_GAUGE_SDM_PU           GLB_GAUGE_SDM_PU
#define GLB_GAUGE_SDM_PU_POS       (15U)
#define GLB_GAUGE_SDM_PU_LEN       (1U)
#define GLB_GAUGE_SDM_PU_MSK       (((1U << GLB_GAUGE_SDM_PU_LEN) - 1) << GLB_GAUGE_SDM_PU_POS)
#define GLB_GAUGE_SDM_PU_UMSK      (~(((1U << GLB_GAUGE_SDM_PU_LEN) - 1) << GLB_GAUGE_SDM_PU_POS))
#define GLB_GAUGE_CHANNEL_SEL      GLB_GAUGE_CHANNEL_SEL
#define GLB_GAUGE_CHANNEL_SEL_POS  (16U)
#define GLB_GAUGE_CHANNEL_SEL_LEN  (1U)
#define GLB_GAUGE_CHANNEL_SEL_MSK  (((1U << GLB_GAUGE_CHANNEL_SEL_LEN) - 1) << GLB_GAUGE_CHANNEL_SEL_POS)
#define GLB_GAUGE_CHANNEL_SEL_UMSK (~(((1U << GLB_GAUGE_CHANNEL_SEL_LEN) - 1) << GLB_GAUGE_CHANNEL_SEL_POS))
#define GLB_GAUGE_CHANNEL_EN       GLB_GAUGE_CHANNEL_EN
#define GLB_GAUGE_CHANNEL_EN_POS   (17U)
#define GLB_GAUGE_CHANNEL_EN_LEN   (1U)
#define GLB_GAUGE_CHANNEL_EN_MSK   (((1U << GLB_GAUGE_CHANNEL_EN_LEN) - 1) << GLB_GAUGE_CHANNEL_EN_POS)
#define GLB_GAUGE_CHANNEL_EN_UMSK  (~(((1U << GLB_GAUGE_CHANNEL_EN_LEN) - 1) << GLB_GAUGE_CHANNEL_EN_POS))
#define GLB_GAUGE_LP_MODE          GLB_GAUGE_LP_MODE
#define GLB_GAUGE_LP_MODE_POS      (18U)
#define GLB_GAUGE_LP_MODE_LEN      (1U)
#define GLB_GAUGE_LP_MODE_MSK      (((1U << GLB_GAUGE_LP_MODE_LEN) - 1) << GLB_GAUGE_LP_MODE_POS)
#define GLB_GAUGE_LP_MODE_UMSK     (~(((1U << GLB_GAUGE_LP_MODE_LEN) - 1) << GLB_GAUGE_LP_MODE_POS))
#define GLB_TMUX_GAUGE_POWER       GLB_TMUX_GAUGE_POWER
#define GLB_TMUX_GAUGE_POWER_POS   (20U)
#define GLB_TMUX_GAUGE_POWER_LEN   (3U)
#define GLB_TMUX_GAUGE_POWER_MSK   (((1U << GLB_TMUX_GAUGE_POWER_LEN) - 1) << GLB_TMUX_GAUGE_POWER_POS)
#define GLB_TMUX_GAUGE_POWER_UMSK  (~(((1U << GLB_TMUX_GAUGE_POWER_LEN) - 1) << GLB_TMUX_GAUGE_POWER_POS))
#define GLB_TEN_GAUGE_POWER        GLB_TEN_GAUGE_POWER
#define GLB_TEN_GAUGE_POWER_POS    (23U)
#define GLB_TEN_GAUGE_POWER_LEN    (1U)
#define GLB_TEN_GAUGE_POWER_MSK    (((1U << GLB_TEN_GAUGE_POWER_LEN) - 1) << GLB_TEN_GAUGE_POWER_POS)
#define GLB_TEN_GAUGE_POWER_UMSK   (~(((1U << GLB_TEN_GAUGE_POWER_LEN) - 1) << GLB_TEN_GAUGE_POWER_POS))
#define GLB_NTC_BIAS_SEL           GLB_NTC_BIAS_SEL
#define GLB_NTC_BIAS_SEL_POS       (24U)
#define GLB_NTC_BIAS_SEL_LEN       (4U)
#define GLB_NTC_BIAS_SEL_MSK       (((1U << GLB_NTC_BIAS_SEL_LEN) - 1) << GLB_NTC_BIAS_SEL_POS)
#define GLB_NTC_BIAS_SEL_UMSK      (~(((1U << GLB_NTC_BIAS_SEL_LEN) - 1) << GLB_NTC_BIAS_SEL_POS))
#define GLB_NTC_BIAS_EN            GLB_NTC_BIAS_EN
#define GLB_NTC_BIAS_EN_POS        (28U)
#define GLB_NTC_BIAS_EN_LEN        (1U)
#define GLB_NTC_BIAS_EN_MSK        (((1U << GLB_NTC_BIAS_EN_LEN) - 1) << GLB_NTC_BIAS_EN_POS)
#define GLB_NTC_BIAS_EN_UMSK       (~(((1U << GLB_NTC_BIAS_EN_LEN) - 1) << GLB_NTC_BIAS_EN_POS))
#define GLB_GAUGE_LDO_PU           GLB_GAUGE_LDO_PU
#define GLB_GAUGE_LDO_PU_POS       (29U)
#define GLB_GAUGE_LDO_PU_LEN       (1U)
#define GLB_GAUGE_LDO_PU_MSK       (((1U << GLB_GAUGE_LDO_PU_LEN) - 1) << GLB_GAUGE_LDO_PU_POS)
#define GLB_GAUGE_LDO_PU_UMSK      (~(((1U << GLB_GAUGE_LDO_PU_LEN) - 1) << GLB_GAUGE_LDO_PU_POS))
#define GLB_GAUGE_VCM_PU           GLB_GAUGE_VCM_PU
#define GLB_GAUGE_VCM_PU_POS       (30U)
#define GLB_GAUGE_VCM_PU_LEN       (1U)
#define GLB_GAUGE_VCM_PU_MSK       (((1U << GLB_GAUGE_VCM_PU_LEN) - 1) << GLB_GAUGE_VCM_PU_POS)
#define GLB_GAUGE_VCM_PU_UMSK      (~(((1U << GLB_GAUGE_VCM_PU_LEN) - 1) << GLB_GAUGE_VCM_PU_POS))
#define GLB_GAUGE_BG_PU            GLB_GAUGE_BG_PU
#define GLB_GAUGE_BG_PU_POS        (31U)
#define GLB_GAUGE_BG_PU_LEN        (1U)
#define GLB_GAUGE_BG_PU_MSK        (((1U << GLB_GAUGE_BG_PU_LEN) - 1) << GLB_GAUGE_BG_PU_POS)
#define GLB_GAUGE_BG_PU_UMSK       (~(((1U << GLB_GAUGE_BG_PU_LEN) - 1) << GLB_GAUGE_BG_PU_POS))

/* 0x8B8 : gauge_rx_fifo_ctrl */
#define GLB_GAUGE_RX_FIFO_CTRL_OFFSET (0x8B8)
#define GLB_GAUGE_RX_FIFO_FLUSH       GLB_GAUGE_RX_FIFO_FLUSH
#define GLB_GAUGE_RX_FIFO_FLUSH_POS   (0U)
#define GLB_GAUGE_RX_FIFO_FLUSH_LEN   (1U)
#define GLB_GAUGE_RX_FIFO_FLUSH_MSK   (((1U << GLB_GAUGE_RX_FIFO_FLUSH_LEN) - 1) << GLB_GAUGE_RX_FIFO_FLUSH_POS)
#define GLB_GAUGE_RX_FIFO_FLUSH_UMSK  (~(((1U << GLB_GAUGE_RX_FIFO_FLUSH_LEN) - 1) << GLB_GAUGE_RX_FIFO_FLUSH_POS))
#define GLB_GAUGE_RXO_INT_EN          GLB_GAUGE_RXO_INT_EN
#define GLB_GAUGE_RXO_INT_EN_POS      (1U)
#define GLB_GAUGE_RXO_INT_EN_LEN      (1U)
#define GLB_GAUGE_RXO_INT_EN_MSK      (((1U << GLB_GAUGE_RXO_INT_EN_LEN) - 1) << GLB_GAUGE_RXO_INT_EN_POS)
#define GLB_GAUGE_RXO_INT_EN_UMSK     (~(((1U << GLB_GAUGE_RXO_INT_EN_LEN) - 1) << GLB_GAUGE_RXO_INT_EN_POS))
#define GLB_GAUGE_RXU_INT_EN          GLB_GAUGE_RXU_INT_EN
#define GLB_GAUGE_RXU_INT_EN_POS      (2U)
#define GLB_GAUGE_RXU_INT_EN_LEN      (1U)
#define GLB_GAUGE_RXU_INT_EN_MSK      (((1U << GLB_GAUGE_RXU_INT_EN_LEN) - 1) << GLB_GAUGE_RXU_INT_EN_POS)
#define GLB_GAUGE_RXU_INT_EN_UMSK     (~(((1U << GLB_GAUGE_RXU_INT_EN_LEN) - 1) << GLB_GAUGE_RXU_INT_EN_POS))
#define GLB_GAUGE_RXA_INT_EN          GLB_GAUGE_RXA_INT_EN
#define GLB_GAUGE_RXA_INT_EN_POS      (3U)
#define GLB_GAUGE_RXA_INT_EN_LEN      (1U)
#define GLB_GAUGE_RXA_INT_EN_MSK      (((1U << GLB_GAUGE_RXA_INT_EN_LEN) - 1) << GLB_GAUGE_RXA_INT_EN_POS)
#define GLB_GAUGE_RXA_INT_EN_UMSK     (~(((1U << GLB_GAUGE_RXA_INT_EN_LEN) - 1) << GLB_GAUGE_RXA_INT_EN_POS))
#define GLB_GAUGE_RX_DRQ_EN           GLB_GAUGE_RX_DRQ_EN
#define GLB_GAUGE_RX_DRQ_EN_POS       (4U)
#define GLB_GAUGE_RX_DRQ_EN_LEN       (1U)
#define GLB_GAUGE_RX_DRQ_EN_MSK       (((1U << GLB_GAUGE_RX_DRQ_EN_LEN) - 1) << GLB_GAUGE_RX_DRQ_EN_POS)
#define GLB_GAUGE_RX_DRQ_EN_UMSK      (~(((1U << GLB_GAUGE_RX_DRQ_EN_LEN) - 1) << GLB_GAUGE_RX_DRQ_EN_POS))
#define GLB_GAUGE_RX_DATA_RES         GLB_GAUGE_RX_DATA_RES
#define GLB_GAUGE_RX_DATA_RES_POS     (5U)
#define GLB_GAUGE_RX_DATA_RES_LEN     (1U)
#define GLB_GAUGE_RX_DATA_RES_MSK     (((1U << GLB_GAUGE_RX_DATA_RES_LEN) - 1) << GLB_GAUGE_RX_DATA_RES_POS)
#define GLB_GAUGE_RX_DATA_RES_UMSK    (~(((1U << GLB_GAUGE_RX_DATA_RES_LEN) - 1) << GLB_GAUGE_RX_DATA_RES_POS))
#define GLB_GAUGE_RX_CH_EN            GLB_GAUGE_RX_CH_EN
#define GLB_GAUGE_RX_CH_EN_POS        (8U)
#define GLB_GAUGE_RX_CH_EN_LEN        (1U)
#define GLB_GAUGE_RX_CH_EN_MSK        (((1U << GLB_GAUGE_RX_CH_EN_LEN) - 1) << GLB_GAUGE_RX_CH_EN_POS)
#define GLB_GAUGE_RX_CH_EN_UMSK       (~(((1U << GLB_GAUGE_RX_CH_EN_LEN) - 1) << GLB_GAUGE_RX_CH_EN_POS))
#define GLB_GAUGE_RX_DRQ_CNT          GLB_GAUGE_RX_DRQ_CNT
#define GLB_GAUGE_RX_DRQ_CNT_POS      (14U)
#define GLB_GAUGE_RX_DRQ_CNT_LEN      (2U)
#define GLB_GAUGE_RX_DRQ_CNT_MSK      (((1U << GLB_GAUGE_RX_DRQ_CNT_LEN) - 1) << GLB_GAUGE_RX_DRQ_CNT_POS)
#define GLB_GAUGE_RX_DRQ_CNT_UMSK     (~(((1U << GLB_GAUGE_RX_DRQ_CNT_LEN) - 1) << GLB_GAUGE_RX_DRQ_CNT_POS))
#define GLB_GAUGE_RX_TRG_LEVEL        GLB_GAUGE_RX_TRG_LEVEL
#define GLB_GAUGE_RX_TRG_LEVEL_POS    (16U)
#define GLB_GAUGE_RX_TRG_LEVEL_LEN    (3U)
#define GLB_GAUGE_RX_TRG_LEVEL_MSK    (((1U << GLB_GAUGE_RX_TRG_LEVEL_LEN) - 1) << GLB_GAUGE_RX_TRG_LEVEL_POS)
#define GLB_GAUGE_RX_TRG_LEVEL_UMSK   (~(((1U << GLB_GAUGE_RX_TRG_LEVEL_LEN) - 1) << GLB_GAUGE_RX_TRG_LEVEL_POS))
#define GLB_GAUGE_RX_DATA_MODE        GLB_GAUGE_RX_DATA_MODE
#define GLB_GAUGE_RX_DATA_MODE_POS    (24U)
#define GLB_GAUGE_RX_DATA_MODE_LEN    (2U)
#define GLB_GAUGE_RX_DATA_MODE_MSK    (((1U << GLB_GAUGE_RX_DATA_MODE_LEN) - 1) << GLB_GAUGE_RX_DATA_MODE_POS)
#define GLB_GAUGE_RX_DATA_MODE_UMSK   (~(((1U << GLB_GAUGE_RX_DATA_MODE_LEN) - 1) << GLB_GAUGE_RX_DATA_MODE_POS))

/* 0x8BC : gauge_rx_fifo_status */
#define GLB_GAUGE_RX_FIFO_STATUS_OFFSET (0x8BC)
#define GLB_GAUGE_RXO_INT               GLB_GAUGE_RXO_INT
#define GLB_GAUGE_RXO_INT_POS           (1U)
#define GLB_GAUGE_RXO_INT_LEN           (1U)
#define GLB_GAUGE_RXO_INT_MSK           (((1U << GLB_GAUGE_RXO_INT_LEN) - 1) << GLB_GAUGE_RXO_INT_POS)
#define GLB_GAUGE_RXO_INT_UMSK          (~(((1U << GLB_GAUGE_RXO_INT_LEN) - 1) << GLB_GAUGE_RXO_INT_POS))
#define GLB_GAUGE_RXU_INT               GLB_GAUGE_RXU_INT
#define GLB_GAUGE_RXU_INT_POS           (2U)
#define GLB_GAUGE_RXU_INT_LEN           (1U)
#define GLB_GAUGE_RXU_INT_MSK           (((1U << GLB_GAUGE_RXU_INT_LEN) - 1) << GLB_GAUGE_RXU_INT_POS)
#define GLB_GAUGE_RXU_INT_UMSK          (~(((1U << GLB_GAUGE_RXU_INT_LEN) - 1) << GLB_GAUGE_RXU_INT_POS))
#define GLB_GAUGE_RXA_INT               GLB_GAUGE_RXA_INT
#define GLB_GAUGE_RXA_INT_POS           (4U)
#define GLB_GAUGE_RXA_INT_LEN           (1U)
#define GLB_GAUGE_RXA_INT_MSK           (((1U << GLB_GAUGE_RXA_INT_LEN) - 1) << GLB_GAUGE_RXA_INT_POS)
#define GLB_GAUGE_RXA_INT_UMSK          (~(((1U << GLB_GAUGE_RXA_INT_LEN) - 1) << GLB_GAUGE_RXA_INT_POS))
#define GLB_GAUGE_RXA_CNT               GLB_GAUGE_RXA_CNT
#define GLB_GAUGE_RXA_CNT_POS           (16U)
#define GLB_GAUGE_RXA_CNT_LEN           (3U)
#define GLB_GAUGE_RXA_CNT_MSK           (((1U << GLB_GAUGE_RXA_CNT_LEN) - 1) << GLB_GAUGE_RXA_CNT_POS)
#define GLB_GAUGE_RXA_CNT_UMSK          (~(((1U << GLB_GAUGE_RXA_CNT_LEN) - 1) << GLB_GAUGE_RXA_CNT_POS))
#define GLB_GAUGE_RXA                   GLB_GAUGE_RXA
#define GLB_GAUGE_RXA_POS               (24U)
#define GLB_GAUGE_RXA_LEN               (1U)
#define GLB_GAUGE_RXA_MSK               (((1U << GLB_GAUGE_RXA_LEN) - 1) << GLB_GAUGE_RXA_POS)
#define GLB_GAUGE_RXA_UMSK              (~(((1U << GLB_GAUGE_RXA_LEN) - 1) << GLB_GAUGE_RXA_POS))

/* 0x8C0 : gauge_rx_fifo_data */
#define GLB_GAUGE_RX_FIFO_DATA_OFFSET (0x8C0)
#define GLB_GAUGE_RX_DATA             GLB_GAUGE_RX_DATA
#define GLB_GAUGE_RX_DATA_POS         (0U)
#define GLB_GAUGE_RX_DATA_LEN         (32U)
#define GLB_GAUGE_RX_DATA_MSK         (((1U << GLB_GAUGE_RX_DATA_LEN) - 1) << GLB_GAUGE_RX_DATA_POS)
#define GLB_GAUGE_RX_DATA_UMSK        (~(((1U << GLB_GAUGE_RX_DATA_LEN) - 1) << GLB_GAUGE_RX_DATA_POS))

