XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/glb_reg.h
/* 0x91C : gpio_cfg22 */
#define GLB_GPIO_CFG22_OFFSET             (0x91C)
#define GLB_REG_GPIO_22_IE                GLB_REG_GPIO_22_IE
#define GLB_REG_GPIO_22_IE_POS            (0U)
#define GLB_REG_GPIO_22_IE_LEN            (1U)
#define GLB_REG_GPIO_22_IE_MSK            (((1U << GLB_REG_GPIO_22_IE_LEN) - 1) << GLB_REG_GPIO_22_IE_POS)
#define GLB_REG_GPIO_22_IE_UMSK           (~(((1U << GLB_REG_GPIO_22_IE_LEN) - 1) << GLB_REG_GPIO_22_IE_POS))
#define GLB_REG_GPIO_22_SMT               GLB_REG_GPIO_22_SMT
#define GLB_REG_GPIO_22_SMT_POS           (1U)
#define GLB_REG_GPIO_22_SMT_LEN           (1U)
#define GLB_REG_GPIO_22_SMT_MSK           (((1U << GLB_REG_GPIO_22_SMT_LEN) - 1) << GLB_REG_GPIO_22_SMT_POS)
#define GLB_REG_GPIO_22_SMT_UMSK          (~(((1U << GLB_REG_GPIO_22_SMT_LEN) - 1) << GLB_REG_GPIO_22_SMT_POS))
#define GLB_REG_GPIO_22_DRV               GLB_REG_GPIO_22_DRV
#define GLB_REG_GPIO_22_DRV_POS           (2U)
#define GLB_REG_GPIO_22_DRV_LEN           (2U)
#define GLB_REG_GPIO_22_DRV_MSK           (((1U << GLB_REG_GPIO_22_DRV_LEN) - 1) << GLB_REG_GPIO_22_DRV_POS)
#define GLB_REG_GPIO_22_DRV_UMSK          (~(((1U << GLB_REG_GPIO_22_DRV_LEN) - 1) << GLB_REG_GPIO_22_DRV_POS))
#define GLB_REG_GPIO_22_PU                GLB_REG_GPIO_22_PU
#define GLB_REG_GPIO_22_PU_POS            (4U)
#define GLB_REG_GPIO_22_PU_LEN            (1U)
#define GLB_REG_GPIO_22_PU_MSK            (((1U << GLB_REG_GPIO_22_PU_LEN) - 1) << GLB_REG_GPIO_22_PU_POS)
#define GLB_REG_GPIO_22_PU_UMSK           (~(((1U << GLB_REG_GPIO_22_PU_LEN) - 1) << GLB_REG_GPIO_22_PU_POS))
#define GLB_REG_GPIO_22_PD                GLB_REG_GPIO_22_PD
#define GLB_REG_GPIO_22_PD_POS            (5U)
#define GLB_REG_GPIO_22_PD_LEN            (1U)
#define GLB_REG_GPIO_22_PD_MSK            (((1U << GLB_REG_GPIO_22_PD_LEN) - 1) << GLB_REG_GPIO_22_PD_POS)
#define GLB_REG_GPIO_22_PD_UMSK           (~(((1U << GLB_REG_GPIO_22_PD_LEN) - 1) << GLB_REG_GPIO_22_PD_POS))
#define GLB_REG_GPIO_22_OE                GLB_REG_GPIO_22_OE
#define GLB_REG_GPIO_22_OE_POS            (6U)
#define GLB_REG_GPIO_22_OE_LEN            (1U)
#define GLB_REG_GPIO_22_OE_MSK            (((1U << GLB_REG_GPIO_22_OE_LEN) - 1) << GLB_REG_GPIO_22_OE_POS)
#define GLB_REG_GPIO_22_OE_UMSK           (~(((1U << GLB_REG_GPIO_22_OE_LEN) - 1) << GLB_REG_GPIO_22_OE_POS))
#define GLB_REG_GPIO_22_FUNC_SEL          GLB_REG_GPIO_22_FUNC_SEL
#define GLB_REG_GPIO_22_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_22_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_22_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_22_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_22_FUNC_SEL_POS)
#define GLB_REG_GPIO_22_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_22_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_22_FUNC_SEL_POS))
#define GLB_REG_GPIO_22_INT_MODE_SET      GLB_REG_GPIO_22_INT_MODE_SET
#define GLB_REG_GPIO_22_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_22_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_22_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_22_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_22_INT_MODE_SET_POS)
#define GLB_REG_GPIO_22_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_22_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_22_INT_MODE_SET_POS))
#define GLB_REG_GPIO_22_INT_CLR           GLB_REG_GPIO_22_INT_CLR
#define GLB_REG_GPIO_22_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_22_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_22_INT_CLR_MSK       (((1U << GLB_REG_GPIO_22_INT_CLR_LEN) - 1) << GLB_REG_GPIO_22_INT_CLR_POS)
#define GLB_REG_GPIO_22_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_22_INT_CLR_LEN) - 1) << GLB_REG_GPIO_22_INT_CLR_POS))
#define GLB_GPIO_22_INT_STAT              GLB_GPIO_22_INT_STAT
#define GLB_GPIO_22_INT_STAT_POS          (21U)
#define GLB_GPIO_22_INT_STAT_LEN          (1U)
#define GLB_GPIO_22_INT_STAT_MSK          (((1U << GLB_GPIO_22_INT_STAT_LEN) - 1) << GLB_GPIO_22_INT_STAT_POS)
#define GLB_GPIO_22_INT_STAT_UMSK         (~(((1U << GLB_GPIO_22_INT_STAT_LEN) - 1) << GLB_GPIO_22_INT_STAT_POS))
#define GLB_REG_GPIO_22_INT_MASK          GLB_REG_GPIO_22_INT_MASK
#define GLB_REG_GPIO_22_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_22_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_22_INT_MASK_MSK      (((1U << GLB_REG_GPIO_22_INT_MASK_LEN) - 1) << GLB_REG_GPIO_22_INT_MASK_POS)
#define GLB_REG_GPIO_22_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_22_INT_MASK_LEN) - 1) << GLB_REG_GPIO_22_INT_MASK_POS))
#define GLB_REG_GPIO_22_O                 GLB_REG_GPIO_22_O
#define GLB_REG_GPIO_22_O_POS             (24U)
#define GLB_REG_GPIO_22_O_LEN             (1U)
#define GLB_REG_GPIO_22_O_MSK             (((1U << GLB_REG_GPIO_22_O_LEN) - 1) << GLB_REG_GPIO_22_O_POS)
#define GLB_REG_GPIO_22_O_UMSK            (~(((1U << GLB_REG_GPIO_22_O_LEN) - 1) << GLB_REG_GPIO_22_O_POS))
#define GLB_REG_GPIO_22_SET               GLB_REG_GPIO_22_SET
#define GLB_REG_GPIO_22_SET_POS           (25U)
#define GLB_REG_GPIO_22_SET_LEN           (1U)
#define GLB_REG_GPIO_22_SET_MSK           (((1U << GLB_REG_GPIO_22_SET_LEN) - 1) << GLB_REG_GPIO_22_SET_POS)
#define GLB_REG_GPIO_22_SET_UMSK          (~(((1U << GLB_REG_GPIO_22_SET_LEN) - 1) << GLB_REG_GPIO_22_SET_POS))
#define GLB_REG_GPIO_22_CLR               GLB_REG_GPIO_22_CLR
#define GLB_REG_GPIO_22_CLR_POS           (26U)
#define GLB_REG_GPIO_22_CLR_LEN           (1U)
#define GLB_REG_GPIO_22_CLR_MSK           (((1U << GLB_REG_GPIO_22_CLR_LEN) - 1) << GLB_REG_GPIO_22_CLR_POS)
#define GLB_REG_GPIO_22_CLR_UMSK          (~(((1U << GLB_REG_GPIO_22_CLR_LEN) - 1) << GLB_REG_GPIO_22_CLR_POS))
#define GLB_REG_GPIO_22_I                 GLB_REG_GPIO_22_I
#define GLB_REG_GPIO_22_I_POS             (28U)
#define GLB_REG_GPIO_22_I_LEN             (1U)
#define GLB_REG_GPIO_22_I_MSK             (((1U << GLB_REG_GPIO_22_I_LEN) - 1) << GLB_REG_GPIO_22_I_POS)
#define GLB_REG_GPIO_22_I_UMSK            (~(((1U << GLB_REG_GPIO_22_I_LEN) - 1) << GLB_REG_GPIO_22_I_POS))
#define GLB_REG_GPIO_22_MODE              GLB_REG_GPIO_22_MODE
#define GLB_REG_GPIO_22_MODE_POS          (30U)
#define GLB_REG_GPIO_22_MODE_LEN          (2U)
#define GLB_REG_GPIO_22_MODE_MSK          (((1U << GLB_REG_GPIO_22_MODE_LEN) - 1) << GLB_REG_GPIO_22_MODE_POS)
#define GLB_REG_GPIO_22_MODE_UMSK         (~(((1U << GLB_REG_GPIO_22_MODE_LEN) - 1) << GLB_REG_GPIO_22_MODE_POS))

