XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/glb_reg.h
/* 0x920 : gpio_cfg23 */
#define GLB_GPIO_CFG23_OFFSET             (0x920)
#define GLB_REG_GPIO_23_IE                GLB_REG_GPIO_23_IE
#define GLB_REG_GPIO_23_IE_POS            (0U)
#define GLB_REG_GPIO_23_IE_LEN            (1U)
#define GLB_REG_GPIO_23_IE_MSK            (((1U << GLB_REG_GPIO_23_IE_LEN) - 1) << GLB_REG_GPIO_23_IE_POS)
#define GLB_REG_GPIO_23_IE_UMSK           (~(((1U << GLB_REG_GPIO_23_IE_LEN) - 1) << GLB_REG_GPIO_23_IE_POS))
#define GLB_REG_GPIO_23_SMT               GLB_REG_GPIO_23_SMT
#define GLB_REG_GPIO_23_SMT_POS           (1U)
#define GLB_REG_GPIO_23_SMT_LEN           (1U)
#define GLB_REG_GPIO_23_SMT_MSK           (((1U << GLB_REG_GPIO_23_SMT_LEN) - 1) << GLB_REG_GPIO_23_SMT_POS)
#define GLB_REG_GPIO_23_SMT_UMSK          (~(((1U << GLB_REG_GPIO_23_SMT_LEN) - 1) << GLB_REG_GPIO_23_SMT_POS))
#define GLB_REG_GPIO_23_DRV               GLB_REG_GPIO_23_DRV
#define GLB_REG_GPIO_23_DRV_POS           (2U)
#define GLB_REG_GPIO_23_DRV_LEN           (2U)
#define GLB_REG_GPIO_23_DRV_MSK           (((1U << GLB_REG_GPIO_23_DRV_LEN) - 1) << GLB_REG_GPIO_23_DRV_POS)
#define GLB_REG_GPIO_23_DRV_UMSK          (~(((1U << GLB_REG_GPIO_23_DRV_LEN) - 1) << GLB_REG_GPIO_23_DRV_POS))
#define GLB_REG_GPIO_23_PU                GLB_REG_GPIO_23_PU
#define GLB_REG_GPIO_23_PU_POS            (4U)
#define GLB_REG_GPIO_23_PU_LEN            (1U)
#define GLB_REG_GPIO_23_PU_MSK            (((1U << GLB_REG_GPIO_23_PU_LEN) - 1) << GLB_REG_GPIO_23_PU_POS)
#define GLB_REG_GPIO_23_PU_UMSK           (~(((1U << GLB_REG_GPIO_23_PU_LEN) - 1) << GLB_REG_GPIO_23_PU_POS))
#define GLB_REG_GPIO_23_PD                GLB_REG_GPIO_23_PD
#define GLB_REG_GPIO_23_PD_POS            (5U)
#define GLB_REG_GPIO_23_PD_LEN            (1U)
#define GLB_REG_GPIO_23_PD_MSK            (((1U << GLB_REG_GPIO_23_PD_LEN) - 1) << GLB_REG_GPIO_23_PD_POS)
#define GLB_REG_GPIO_23_PD_UMSK           (~(((1U << GLB_REG_GPIO_23_PD_LEN) - 1) << GLB_REG_GPIO_23_PD_POS))
#define GLB_REG_GPIO_23_OE                GLB_REG_GPIO_23_OE
#define GLB_REG_GPIO_23_OE_POS            (6U)
#define GLB_REG_GPIO_23_OE_LEN            (1U)
#define GLB_REG_GPIO_23_OE_MSK            (((1U << GLB_REG_GPIO_23_OE_LEN) - 1) << GLB_REG_GPIO_23_OE_POS)
#define GLB_REG_GPIO_23_OE_UMSK           (~(((1U << GLB_REG_GPIO_23_OE_LEN) - 1) << GLB_REG_GPIO_23_OE_POS))
#define GLB_REG_GPIO_23_FUNC_SEL          GLB_REG_GPIO_23_FUNC_SEL
#define GLB_REG_GPIO_23_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_23_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_23_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_23_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_23_FUNC_SEL_POS)
#define GLB_REG_GPIO_23_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_23_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_23_FUNC_SEL_POS))
#define GLB_REG_GPIO_23_INT_MODE_SET      GLB_REG_GPIO_23_INT_MODE_SET
#define GLB_REG_GPIO_23_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_23_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_23_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_23_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_23_INT_MODE_SET_POS)
#define GLB_REG_GPIO_23_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_23_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_23_INT_MODE_SET_POS))
#define GLB_REG_GPIO_23_INT_CLR           GLB_REG_GPIO_23_INT_CLR
#define GLB_REG_GPIO_23_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_23_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_23_INT_CLR_MSK       (((1U << GLB_REG_GPIO_23_INT_CLR_LEN) - 1) << GLB_REG_GPIO_23_INT_CLR_POS)
#define GLB_REG_GPIO_23_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_23_INT_CLR_LEN) - 1) << GLB_REG_GPIO_23_INT_CLR_POS))
#define GLB_GPIO_23_INT_STAT              GLB_GPIO_23_INT_STAT
#define GLB_GPIO_23_INT_STAT_POS          (21U)
#define GLB_GPIO_23_INT_STAT_LEN          (1U)
#define GLB_GPIO_23_INT_STAT_MSK          (((1U << GLB_GPIO_23_INT_STAT_LEN) - 1) << GLB_GPIO_23_INT_STAT_POS)
#define GLB_GPIO_23_INT_STAT_UMSK         (~(((1U << GLB_GPIO_23_INT_STAT_LEN) - 1) << GLB_GPIO_23_INT_STAT_POS))
#define GLB_REG_GPIO_23_INT_MASK          GLB_REG_GPIO_23_INT_MASK
#define GLB_REG_GPIO_23_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_23_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_23_INT_MASK_MSK      (((1U << GLB_REG_GPIO_23_INT_MASK_LEN) - 1) << GLB_REG_GPIO_23_INT_MASK_POS)
#define GLB_REG_GPIO_23_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_23_INT_MASK_LEN) - 1) << GLB_REG_GPIO_23_INT_MASK_POS))
#define GLB_REG_GPIO_23_O                 GLB_REG_GPIO_23_O
#define GLB_REG_GPIO_23_O_POS             (24U)
#define GLB_REG_GPIO_23_O_LEN             (1U)
#define GLB_REG_GPIO_23_O_MSK             (((1U << GLB_REG_GPIO_23_O_LEN) - 1) << GLB_REG_GPIO_23_O_POS)
#define GLB_REG_GPIO_23_O_UMSK            (~(((1U << GLB_REG_GPIO_23_O_LEN) - 1) << GLB_REG_GPIO_23_O_POS))
#define GLB_REG_GPIO_23_SET               GLB_REG_GPIO_23_SET
#define GLB_REG_GPIO_23_SET_POS           (25U)
#define GLB_REG_GPIO_23_SET_LEN           (1U)
#define GLB_REG_GPIO_23_SET_MSK           (((1U << GLB_REG_GPIO_23_SET_LEN) - 1) << GLB_REG_GPIO_23_SET_POS)
#define GLB_REG_GPIO_23_SET_UMSK          (~(((1U << GLB_REG_GPIO_23_SET_LEN) - 1) << GLB_REG_GPIO_23_SET_POS))
#define GLB_REG_GPIO_23_CLR               GLB_REG_GPIO_23_CLR
#define GLB_REG_GPIO_23_CLR_POS           (26U)
#define GLB_REG_GPIO_23_CLR_LEN           (1U)
#define GLB_REG_GPIO_23_CLR_MSK           (((1U << GLB_REG_GPIO_23_CLR_LEN) - 1) << GLB_REG_GPIO_23_CLR_POS)
#define GLB_REG_GPIO_23_CLR_UMSK          (~(((1U << GLB_REG_GPIO_23_CLR_LEN) - 1) << GLB_REG_GPIO_23_CLR_POS))
#define GLB_REG_GPIO_23_I                 GLB_REG_GPIO_23_I
#define GLB_REG_GPIO_23_I_POS             (28U)
#define GLB_REG_GPIO_23_I_LEN             (1U)
#define GLB_REG_GPIO_23_I_MSK             (((1U << GLB_REG_GPIO_23_I_LEN) - 1) << GLB_REG_GPIO_23_I_POS)
#define GLB_REG_GPIO_23_I_UMSK            (~(((1U << GLB_REG_GPIO_23_I_LEN) - 1) << GLB_REG_GPIO_23_I_POS))
#define GLB_REG_GPIO_23_MODE              GLB_REG_GPIO_23_MODE
#define GLB_REG_GPIO_23_MODE_POS          (30U)
#define GLB_REG_GPIO_23_MODE_LEN          (2U)
#define GLB_REG_GPIO_23_MODE_MSK          (((1U << GLB_REG_GPIO_23_MODE_LEN) - 1) << GLB_REG_GPIO_23_MODE_POS)
#define GLB_REG_GPIO_23_MODE_UMSK         (~(((1U << GLB_REG_GPIO_23_MODE_LEN) - 1) << GLB_REG_GPIO_23_MODE_POS))

/* 0x924 : gpio_cfg24 */
#define GLB_GPIO_CFG24_OFFSET             (0x924)
#define GLB_REG_GPIO_24_IE                GLB_REG_GPIO_24_IE
#define GLB_REG_GPIO_24_IE_POS            (0U)
#define GLB_REG_GPIO_24_IE_LEN            (1U)
#define GLB_REG_GPIO_24_IE_MSK            (((1U << GLB_REG_GPIO_24_IE_LEN) - 1) << GLB_REG_GPIO_24_IE_POS)
#define GLB_REG_GPIO_24_IE_UMSK           (~(((1U << GLB_REG_GPIO_24_IE_LEN) - 1) << GLB_REG_GPIO_24_IE_POS))
#define GLB_REG_GPIO_24_SMT               GLB_REG_GPIO_24_SMT
#define GLB_REG_GPIO_24_SMT_POS           (1U)
#define GLB_REG_GPIO_24_SMT_LEN           (1U)
#define GLB_REG_GPIO_24_SMT_MSK           (((1U << GLB_REG_GPIO_24_SMT_LEN) - 1) << GLB_REG_GPIO_24_SMT_POS)
#define GLB_REG_GPIO_24_SMT_UMSK          (~(((1U << GLB_REG_GPIO_24_SMT_LEN) - 1) << GLB_REG_GPIO_24_SMT_POS))
#define GLB_REG_GPIO_24_DRV               GLB_REG_GPIO_24_DRV
#define GLB_REG_GPIO_24_DRV_POS           (2U)
#define GLB_REG_GPIO_24_DRV_LEN           (2U)
#define GLB_REG_GPIO_24_DRV_MSK           (((1U << GLB_REG_GPIO_24_DRV_LEN) - 1) << GLB_REG_GPIO_24_DRV_POS)
#define GLB_REG_GPIO_24_DRV_UMSK          (~(((1U << GLB_REG_GPIO_24_DRV_LEN) - 1) << GLB_REG_GPIO_24_DRV_POS))
#define GLB_REG_GPIO_24_PU                GLB_REG_GPIO_24_PU
#define GLB_REG_GPIO_24_PU_POS            (4U)
#define GLB_REG_GPIO_24_PU_LEN            (1U)
#define GLB_REG_GPIO_24_PU_MSK            (((1U << GLB_REG_GPIO_24_PU_LEN) - 1) << GLB_REG_GPIO_24_PU_POS)
#define GLB_REG_GPIO_24_PU_UMSK           (~(((1U << GLB_REG_GPIO_24_PU_LEN) - 1) << GLB_REG_GPIO_24_PU_POS))
#define GLB_REG_GPIO_24_PD                GLB_REG_GPIO_24_PD
#define GLB_REG_GPIO_24_PD_POS            (5U)
#define GLB_REG_GPIO_24_PD_LEN            (1U)
#define GLB_REG_GPIO_24_PD_MSK            (((1U << GLB_REG_GPIO_24_PD_LEN) - 1) << GLB_REG_GPIO_24_PD_POS)
#define GLB_REG_GPIO_24_PD_UMSK           (~(((1U << GLB_REG_GPIO_24_PD_LEN) - 1) << GLB_REG_GPIO_24_PD_POS))
#define GLB_REG_GPIO_24_OE                GLB_REG_GPIO_24_OE
#define GLB_REG_GPIO_24_OE_POS            (6U)
#define GLB_REG_GPIO_24_OE_LEN            (1U)
#define GLB_REG_GPIO_24_OE_MSK            (((1U << GLB_REG_GPIO_24_OE_LEN) - 1) << GLB_REG_GPIO_24_OE_POS)
#define GLB_REG_GPIO_24_OE_UMSK           (~(((1U << GLB_REG_GPIO_24_OE_LEN) - 1) << GLB_REG_GPIO_24_OE_POS))
#define GLB_REG_GPIO_24_FUNC_SEL          GLB_REG_GPIO_24_FUNC_SEL
#define GLB_REG_GPIO_24_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_24_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_24_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_24_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_24_FUNC_SEL_POS)
#define GLB_REG_GPIO_24_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_24_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_24_FUNC_SEL_POS))
#define GLB_REG_GPIO_24_INT_MODE_SET      GLB_REG_GPIO_24_INT_MODE_SET
#define GLB_REG_GPIO_24_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_24_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_24_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_24_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_24_INT_MODE_SET_POS)
#define GLB_REG_GPIO_24_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_24_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_24_INT_MODE_SET_POS))
#define GLB_REG_GPIO_24_INT_CLR           GLB_REG_GPIO_24_INT_CLR
#define GLB_REG_GPIO_24_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_24_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_24_INT_CLR_MSK       (((1U << GLB_REG_GPIO_24_INT_CLR_LEN) - 1) << GLB_REG_GPIO_24_INT_CLR_POS)
#define GLB_REG_GPIO_24_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_24_INT_CLR_LEN) - 1) << GLB_REG_GPIO_24_INT_CLR_POS))
#define GLB_GPIO_24_INT_STAT              GLB_GPIO_24_INT_STAT
#define GLB_GPIO_24_INT_STAT_POS          (21U)
#define GLB_GPIO_24_INT_STAT_LEN          (1U)
#define GLB_GPIO_24_INT_STAT_MSK          (((1U << GLB_GPIO_24_INT_STAT_LEN) - 1) << GLB_GPIO_24_INT_STAT_POS)
#define GLB_GPIO_24_INT_STAT_UMSK         (~(((1U << GLB_GPIO_24_INT_STAT_LEN) - 1) << GLB_GPIO_24_INT_STAT_POS))
#define GLB_REG_GPIO_24_INT_MASK          GLB_REG_GPIO_24_INT_MASK
#define GLB_REG_GPIO_24_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_24_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_24_INT_MASK_MSK      (((1U << GLB_REG_GPIO_24_INT_MASK_LEN) - 1) << GLB_REG_GPIO_24_INT_MASK_POS)
#define GLB_REG_GPIO_24_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_24_INT_MASK_LEN) - 1) << GLB_REG_GPIO_24_INT_MASK_POS))
#define GLB_REG_GPIO_24_O                 GLB_REG_GPIO_24_O
#define GLB_REG_GPIO_24_O_POS             (24U)
#define GLB_REG_GPIO_24_O_LEN             (1U)
#define GLB_REG_GPIO_24_O_MSK             (((1U << GLB_REG_GPIO_24_O_LEN) - 1) << GLB_REG_GPIO_24_O_POS)
#define GLB_REG_GPIO_24_O_UMSK            (~(((1U << GLB_REG_GPIO_24_O_LEN) - 1) << GLB_REG_GPIO_24_O_POS))
#define GLB_REG_GPIO_24_SET               GLB_REG_GPIO_24_SET
#define GLB_REG_GPIO_24_SET_POS           (25U)
#define GLB_REG_GPIO_24_SET_LEN           (1U)
#define GLB_REG_GPIO_24_SET_MSK           (((1U << GLB_REG_GPIO_24_SET_LEN) - 1) << GLB_REG_GPIO_24_SET_POS)
#define GLB_REG_GPIO_24_SET_UMSK          (~(((1U << GLB_REG_GPIO_24_SET_LEN) - 1) << GLB_REG_GPIO_24_SET_POS))
#define GLB_REG_GPIO_24_CLR               GLB_REG_GPIO_24_CLR
#define GLB_REG_GPIO_24_CLR_POS           (26U)
#define GLB_REG_GPIO_24_CLR_LEN           (1U)
#define GLB_REG_GPIO_24_CLR_MSK           (((1U << GLB_REG_GPIO_24_CLR_LEN) - 1) << GLB_REG_GPIO_24_CLR_POS)
#define GLB_REG_GPIO_24_CLR_UMSK          (~(((1U << GLB_REG_GPIO_24_CLR_LEN) - 1) << GLB_REG_GPIO_24_CLR_POS))
#define GLB_REG_GPIO_24_I                 GLB_REG_GPIO_24_I
#define GLB_REG_GPIO_24_I_POS             (28U)
#define GLB_REG_GPIO_24_I_LEN             (1U)
#define GLB_REG_GPIO_24_I_MSK             (((1U << GLB_REG_GPIO_24_I_LEN) - 1) << GLB_REG_GPIO_24_I_POS)
#define GLB_REG_GPIO_24_I_UMSK            (~(((1U << GLB_REG_GPIO_24_I_LEN) - 1) << GLB_REG_GPIO_24_I_POS))
#define GLB_REG_GPIO_24_MODE              GLB_REG_GPIO_24_MODE
#define GLB_REG_GPIO_24_MODE_POS          (30U)
#define GLB_REG_GPIO_24_MODE_LEN          (2U)
#define GLB_REG_GPIO_24_MODE_MSK          (((1U << GLB_REG_GPIO_24_MODE_LEN) - 1) << GLB_REG_GPIO_24_MODE_POS)
#define GLB_REG_GPIO_24_MODE_UMSK         (~(((1U << GLB_REG_GPIO_24_MODE_LEN) - 1) << GLB_REG_GPIO_24_MODE_POS))

/* 0x928 : gpio_cfg25 */
#define GLB_GPIO_CFG25_OFFSET             (0x928)
#define GLB_REG_GPIO_25_IE                GLB_REG_GPIO_25_IE
#define GLB_REG_GPIO_25_IE_POS            (0U)
#define GLB_REG_GPIO_25_IE_LEN            (1U)
#define GLB_REG_GPIO_25_IE_MSK            (((1U << GLB_REG_GPIO_25_IE_LEN) - 1) << GLB_REG_GPIO_25_IE_POS)
#define GLB_REG_GPIO_25_IE_UMSK           (~(((1U << GLB_REG_GPIO_25_IE_LEN) - 1) << GLB_REG_GPIO_25_IE_POS))
#define GLB_REG_GPIO_25_SMT               GLB_REG_GPIO_25_SMT
#define GLB_REG_GPIO_25_SMT_POS           (1U)
#define GLB_REG_GPIO_25_SMT_LEN           (1U)
#define GLB_REG_GPIO_25_SMT_MSK           (((1U << GLB_REG_GPIO_25_SMT_LEN) - 1) << GLB_REG_GPIO_25_SMT_POS)
#define GLB_REG_GPIO_25_SMT_UMSK          (~(((1U << GLB_REG_GPIO_25_SMT_LEN) - 1) << GLB_REG_GPIO_25_SMT_POS))
#define GLB_REG_GPIO_25_DRV               GLB_REG_GPIO_25_DRV
#define GLB_REG_GPIO_25_DRV_POS           (2U)
#define GLB_REG_GPIO_25_DRV_LEN           (2U)
#define GLB_REG_GPIO_25_DRV_MSK           (((1U << GLB_REG_GPIO_25_DRV_LEN) - 1) << GLB_REG_GPIO_25_DRV_POS)
#define GLB_REG_GPIO_25_DRV_UMSK          (~(((1U << GLB_REG_GPIO_25_DRV_LEN) - 1) << GLB_REG_GPIO_25_DRV_POS))
#define GLB_REG_GPIO_25_PU                GLB_REG_GPIO_25_PU
#define GLB_REG_GPIO_25_PU_POS            (4U)
#define GLB_REG_GPIO_25_PU_LEN            (1U)
#define GLB_REG_GPIO_25_PU_MSK            (((1U << GLB_REG_GPIO_25_PU_LEN) - 1) << GLB_REG_GPIO_25_PU_POS)
#define GLB_REG_GPIO_25_PU_UMSK           (~(((1U << GLB_REG_GPIO_25_PU_LEN) - 1) << GLB_REG_GPIO_25_PU_POS))
#define GLB_REG_GPIO_25_PD                GLB_REG_GPIO_25_PD
#define GLB_REG_GPIO_25_PD_POS            (5U)
#define GLB_REG_GPIO_25_PD_LEN            (1U)
#define GLB_REG_GPIO_25_PD_MSK            (((1U << GLB_REG_GPIO_25_PD_LEN) - 1) << GLB_REG_GPIO_25_PD_POS)
#define GLB_REG_GPIO_25_PD_UMSK           (~(((1U << GLB_REG_GPIO_25_PD_LEN) - 1) << GLB_REG_GPIO_25_PD_POS))
#define GLB_REG_GPIO_25_OE                GLB_REG_GPIO_25_OE
#define GLB_REG_GPIO_25_OE_POS            (6U)
#define GLB_REG_GPIO_25_OE_LEN            (1U)
#define GLB_REG_GPIO_25_OE_MSK            (((1U << GLB_REG_GPIO_25_OE_LEN) - 1) << GLB_REG_GPIO_25_OE_POS)
#define GLB_REG_GPIO_25_OE_UMSK           (~(((1U << GLB_REG_GPIO_25_OE_LEN) - 1) << GLB_REG_GPIO_25_OE_POS))
#define GLB_REG_GPIO_25_FUNC_SEL          GLB_REG_GPIO_25_FUNC_SEL
#define GLB_REG_GPIO_25_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_25_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_25_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_25_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_25_FUNC_SEL_POS)
#define GLB_REG_GPIO_25_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_25_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_25_FUNC_SEL_POS))
#define GLB_REG_GPIO_25_INT_MODE_SET      GLB_REG_GPIO_25_INT_MODE_SET
#define GLB_REG_GPIO_25_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_25_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_25_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_25_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_25_INT_MODE_SET_POS)
#define GLB_REG_GPIO_25_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_25_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_25_INT_MODE_SET_POS))
#define GLB_REG_GPIO_25_INT_CLR           GLB_REG_GPIO_25_INT_CLR
#define GLB_REG_GPIO_25_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_25_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_25_INT_CLR_MSK       (((1U << GLB_REG_GPIO_25_INT_CLR_LEN) - 1) << GLB_REG_GPIO_25_INT_CLR_POS)
#define GLB_REG_GPIO_25_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_25_INT_CLR_LEN) - 1) << GLB_REG_GPIO_25_INT_CLR_POS))
#define GLB_GPIO_25_INT_STAT              GLB_GPIO_25_INT_STAT
#define GLB_GPIO_25_INT_STAT_POS          (21U)
#define GLB_GPIO_25_INT_STAT_LEN          (1U)
#define GLB_GPIO_25_INT_STAT_MSK          (((1U << GLB_GPIO_25_INT_STAT_LEN) - 1) << GLB_GPIO_25_INT_STAT_POS)
#define GLB_GPIO_25_INT_STAT_UMSK         (~(((1U << GLB_GPIO_25_INT_STAT_LEN) - 1) << GLB_GPIO_25_INT_STAT_POS))
#define GLB_REG_GPIO_25_INT_MASK          GLB_REG_GPIO_25_INT_MASK
#define GLB_REG_GPIO_25_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_25_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_25_INT_MASK_MSK      (((1U << GLB_REG_GPIO_25_INT_MASK_LEN) - 1) << GLB_REG_GPIO_25_INT_MASK_POS)
#define GLB_REG_GPIO_25_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_25_INT_MASK_LEN) - 1) << GLB_REG_GPIO_25_INT_MASK_POS))
#define GLB_REG_GPIO_25_O                 GLB_REG_GPIO_25_O
#define GLB_REG_GPIO_25_O_POS             (24U)
#define GLB_REG_GPIO_25_O_LEN             (1U)
#define GLB_REG_GPIO_25_O_MSK             (((1U << GLB_REG_GPIO_25_O_LEN) - 1) << GLB_REG_GPIO_25_O_POS)
#define GLB_REG_GPIO_25_O_UMSK            (~(((1U << GLB_REG_GPIO_25_O_LEN) - 1) << GLB_REG_GPIO_25_O_POS))
#define GLB_REG_GPIO_25_SET               GLB_REG_GPIO_25_SET
#define GLB_REG_GPIO_25_SET_POS           (25U)
#define GLB_REG_GPIO_25_SET_LEN           (1U)
#define GLB_REG_GPIO_25_SET_MSK           (((1U << GLB_REG_GPIO_25_SET_LEN) - 1) << GLB_REG_GPIO_25_SET_POS)
#define GLB_REG_GPIO_25_SET_UMSK          (~(((1U << GLB_REG_GPIO_25_SET_LEN) - 1) << GLB_REG_GPIO_25_SET_POS))
#define GLB_REG_GPIO_25_CLR               GLB_REG_GPIO_25_CLR
#define GLB_REG_GPIO_25_CLR_POS           (26U)
#define GLB_REG_GPIO_25_CLR_LEN           (1U)
#define GLB_REG_GPIO_25_CLR_MSK           (((1U << GLB_REG_GPIO_25_CLR_LEN) - 1) << GLB_REG_GPIO_25_CLR_POS)
#define GLB_REG_GPIO_25_CLR_UMSK          (~(((1U << GLB_REG_GPIO_25_CLR_LEN) - 1) << GLB_REG_GPIO_25_CLR_POS))
#define GLB_REG_GPIO_25_I                 GLB_REG_GPIO_25_I
#define GLB_REG_GPIO_25_I_POS             (28U)
#define GLB_REG_GPIO_25_I_LEN             (1U)
#define GLB_REG_GPIO_25_I_MSK             (((1U << GLB_REG_GPIO_25_I_LEN) - 1) << GLB_REG_GPIO_25_I_POS)
#define GLB_REG_GPIO_25_I_UMSK            (~(((1U << GLB_REG_GPIO_25_I_LEN) - 1) << GLB_REG_GPIO_25_I_POS))
#define GLB_REG_GPIO_25_MODE              GLB_REG_GPIO_25_MODE
#define GLB_REG_GPIO_25_MODE_POS          (30U)
#define GLB_REG_GPIO_25_MODE_LEN          (2U)
#define GLB_REG_GPIO_25_MODE_MSK          (((1U << GLB_REG_GPIO_25_MODE_LEN) - 1) << GLB_REG_GPIO_25_MODE_POS)
#define GLB_REG_GPIO_25_MODE_UMSK         (~(((1U << GLB_REG_GPIO_25_MODE_LEN) - 1) << GLB_REG_GPIO_25_MODE_POS))

