XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/glb_reg.h
/* 0x950 : gpio_cfg35 */
#define GLB_GPIO_CFG35_OFFSET             (0x950)
#define GLB_REG_GPIO_35_IE                GLB_REG_GPIO_35_IE
#define GLB_REG_GPIO_35_IE_POS            (0U)
#define GLB_REG_GPIO_35_IE_LEN            (1U)
#define GLB_REG_GPIO_35_IE_MSK            (((1U << GLB_REG_GPIO_35_IE_LEN) - 1) << GLB_REG_GPIO_35_IE_POS)
#define GLB_REG_GPIO_35_IE_UMSK           (~(((1U << GLB_REG_GPIO_35_IE_LEN) - 1) << GLB_REG_GPIO_35_IE_POS))
#define GLB_REG_GPIO_35_SMT               GLB_REG_GPIO_35_SMT
#define GLB_REG_GPIO_35_SMT_POS           (1U)
#define GLB_REG_GPIO_35_SMT_LEN           (1U)
#define GLB_REG_GPIO_35_SMT_MSK           (((1U << GLB_REG_GPIO_35_SMT_LEN) - 1) << GLB_REG_GPIO_35_SMT_POS)
#define GLB_REG_GPIO_35_SMT_UMSK          (~(((1U << GLB_REG_GPIO_35_SMT_LEN) - 1) << GLB_REG_GPIO_35_SMT_POS))
#define GLB_REG_GPIO_35_DRV               GLB_REG_GPIO_35_DRV
#define GLB_REG_GPIO_35_DRV_POS           (2U)
#define GLB_REG_GPIO_35_DRV_LEN           (2U)
#define GLB_REG_GPIO_35_DRV_MSK           (((1U << GLB_REG_GPIO_35_DRV_LEN) - 1) << GLB_REG_GPIO_35_DRV_POS)
#define GLB_REG_GPIO_35_DRV_UMSK          (~(((1U << GLB_REG_GPIO_35_DRV_LEN) - 1) << GLB_REG_GPIO_35_DRV_POS))
#define GLB_REG_GPIO_35_PU                GLB_REG_GPIO_35_PU
#define GLB_REG_GPIO_35_PU_POS            (4U)
#define GLB_REG_GPIO_35_PU_LEN            (1U)
#define GLB_REG_GPIO_35_PU_MSK            (((1U << GLB_REG_GPIO_35_PU_LEN) - 1) << GLB_REG_GPIO_35_PU_POS)
#define GLB_REG_GPIO_35_PU_UMSK           (~(((1U << GLB_REG_GPIO_35_PU_LEN) - 1) << GLB_REG_GPIO_35_PU_POS))
#define GLB_REG_GPIO_35_PD                GLB_REG_GPIO_35_PD
#define GLB_REG_GPIO_35_PD_POS            (5U)
#define GLB_REG_GPIO_35_PD_LEN            (1U)
#define GLB_REG_GPIO_35_PD_MSK            (((1U << GLB_REG_GPIO_35_PD_LEN) - 1) << GLB_REG_GPIO_35_PD_POS)
#define GLB_REG_GPIO_35_PD_UMSK           (~(((1U << GLB_REG_GPIO_35_PD_LEN) - 1) << GLB_REG_GPIO_35_PD_POS))
#define GLB_REG_GPIO_35_OE                GLB_REG_GPIO_35_OE
#define GLB_REG_GPIO_35_OE_POS            (6U)
#define GLB_REG_GPIO_35_OE_LEN            (1U)
#define GLB_REG_GPIO_35_OE_MSK            (((1U << GLB_REG_GPIO_35_OE_LEN) - 1) << GLB_REG_GPIO_35_OE_POS)
#define GLB_REG_GPIO_35_OE_UMSK           (~(((1U << GLB_REG_GPIO_35_OE_LEN) - 1) << GLB_REG_GPIO_35_OE_POS))
#define GLB_REG_GPIO_35_FUNC_SEL          GLB_REG_GPIO_35_FUNC_SEL
#define GLB_REG_GPIO_35_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_35_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_35_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_35_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_35_FUNC_SEL_POS)
#define GLB_REG_GPIO_35_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_35_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_35_FUNC_SEL_POS))
#define GLB_REG_GPIO_35_INT_MODE_SET      GLB_REG_GPIO_35_INT_MODE_SET
#define GLB_REG_GPIO_35_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_35_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_35_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_35_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_35_INT_MODE_SET_POS)
#define GLB_REG_GPIO_35_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_35_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_35_INT_MODE_SET_POS))
#define GLB_REG_GPIO_35_INT_CLR           GLB_REG_GPIO_35_INT_CLR
#define GLB_REG_GPIO_35_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_35_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_35_INT_CLR_MSK       (((1U << GLB_REG_GPIO_35_INT_CLR_LEN) - 1) << GLB_REG_GPIO_35_INT_CLR_POS)
#define GLB_REG_GPIO_35_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_35_INT_CLR_LEN) - 1) << GLB_REG_GPIO_35_INT_CLR_POS))
#define GLB_GPIO_35_INT_STAT              GLB_GPIO_35_INT_STAT
#define GLB_GPIO_35_INT_STAT_POS          (21U)
#define GLB_GPIO_35_INT_STAT_LEN          (1U)
#define GLB_GPIO_35_INT_STAT_MSK          (((1U << GLB_GPIO_35_INT_STAT_LEN) - 1) << GLB_GPIO_35_INT_STAT_POS)
#define GLB_GPIO_35_INT_STAT_UMSK         (~(((1U << GLB_GPIO_35_INT_STAT_LEN) - 1) << GLB_GPIO_35_INT_STAT_POS))
#define GLB_REG_GPIO_35_INT_MASK          GLB_REG_GPIO_35_INT_MASK
#define GLB_REG_GPIO_35_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_35_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_35_INT_MASK_MSK      (((1U << GLB_REG_GPIO_35_INT_MASK_LEN) - 1) << GLB_REG_GPIO_35_INT_MASK_POS)
#define GLB_REG_GPIO_35_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_35_INT_MASK_LEN) - 1) << GLB_REG_GPIO_35_INT_MASK_POS))
#define GLB_REG_GPIO_35_O                 GLB_REG_GPIO_35_O
#define GLB_REG_GPIO_35_O_POS             (24U)
#define GLB_REG_GPIO_35_O_LEN             (1U)
#define GLB_REG_GPIO_35_O_MSK             (((1U << GLB_REG_GPIO_35_O_LEN) - 1) << GLB_REG_GPIO_35_O_POS)
#define GLB_REG_GPIO_35_O_UMSK            (~(((1U << GLB_REG_GPIO_35_O_LEN) - 1) << GLB_REG_GPIO_35_O_POS))
#define GLB_REG_GPIO_35_SET               GLB_REG_GPIO_35_SET
#define GLB_REG_GPIO_35_SET_POS           (25U)
#define GLB_REG_GPIO_35_SET_LEN           (1U)
#define GLB_REG_GPIO_35_SET_MSK           (((1U << GLB_REG_GPIO_35_SET_LEN) - 1) << GLB_REG_GPIO_35_SET_POS)
#define GLB_REG_GPIO_35_SET_UMSK          (~(((1U << GLB_REG_GPIO_35_SET_LEN) - 1) << GLB_REG_GPIO_35_SET_POS))
#define GLB_REG_GPIO_35_CLR               GLB_REG_GPIO_35_CLR
#define GLB_REG_GPIO_35_CLR_POS           (26U)
#define GLB_REG_GPIO_35_CLR_LEN           (1U)
#define GLB_REG_GPIO_35_CLR_MSK           (((1U << GLB_REG_GPIO_35_CLR_LEN) - 1) << GLB_REG_GPIO_35_CLR_POS)
#define GLB_REG_GPIO_35_CLR_UMSK          (~(((1U << GLB_REG_GPIO_35_CLR_LEN) - 1) << GLB_REG_GPIO_35_CLR_POS))
#define GLB_REG_GPIO_35_I                 GLB_REG_GPIO_35_I
#define GLB_REG_GPIO_35_I_POS             (28U)
#define GLB_REG_GPIO_35_I_LEN             (1U)
#define GLB_REG_GPIO_35_I_MSK             (((1U << GLB_REG_GPIO_35_I_LEN) - 1) << GLB_REG_GPIO_35_I_POS)
#define GLB_REG_GPIO_35_I_UMSK            (~(((1U << GLB_REG_GPIO_35_I_LEN) - 1) << GLB_REG_GPIO_35_I_POS))
#define GLB_REG_GPIO_35_MODE              GLB_REG_GPIO_35_MODE
#define GLB_REG_GPIO_35_MODE_POS          (30U)
#define GLB_REG_GPIO_35_MODE_LEN          (2U)
#define GLB_REG_GPIO_35_MODE_MSK          (((1U << GLB_REG_GPIO_35_MODE_LEN) - 1) << GLB_REG_GPIO_35_MODE_POS)
#define GLB_REG_GPIO_35_MODE_UMSK         (~(((1U << GLB_REG_GPIO_35_MODE_LEN) - 1) << GLB_REG_GPIO_35_MODE_POS))

/* 0x954 : gpio_cfg36 */
#define GLB_GPIO_CFG36_OFFSET             (0x954)
#define GLB_REG_GPIO_36_IE                GLB_REG_GPIO_36_IE
#define GLB_REG_GPIO_36_IE_POS            (0U)
#define GLB_REG_GPIO_36_IE_LEN            (1U)
#define GLB_REG_GPIO_36_IE_MSK            (((1U << GLB_REG_GPIO_36_IE_LEN) - 1) << GLB_REG_GPIO_36_IE_POS)
#define GLB_REG_GPIO_36_IE_UMSK           (~(((1U << GLB_REG_GPIO_36_IE_LEN) - 1) << GLB_REG_GPIO_36_IE_POS))
#define GLB_REG_GPIO_36_SMT               GLB_REG_GPIO_36_SMT
#define GLB_REG_GPIO_36_SMT_POS           (1U)
#define GLB_REG_GPIO_36_SMT_LEN           (1U)
#define GLB_REG_GPIO_36_SMT_MSK           (((1U << GLB_REG_GPIO_36_SMT_LEN) - 1) << GLB_REG_GPIO_36_SMT_POS)
#define GLB_REG_GPIO_36_SMT_UMSK          (~(((1U << GLB_REG_GPIO_36_SMT_LEN) - 1) << GLB_REG_GPIO_36_SMT_POS))
#define GLB_REG_GPIO_36_DRV               GLB_REG_GPIO_36_DRV
#define GLB_REG_GPIO_36_DRV_POS           (2U)
#define GLB_REG_GPIO_36_DRV_LEN           (2U)
#define GLB_REG_GPIO_36_DRV_MSK           (((1U << GLB_REG_GPIO_36_DRV_LEN) - 1) << GLB_REG_GPIO_36_DRV_POS)
#define GLB_REG_GPIO_36_DRV_UMSK          (~(((1U << GLB_REG_GPIO_36_DRV_LEN) - 1) << GLB_REG_GPIO_36_DRV_POS))
#define GLB_REG_GPIO_36_PU                GLB_REG_GPIO_36_PU
#define GLB_REG_GPIO_36_PU_POS            (4U)
#define GLB_REG_GPIO_36_PU_LEN            (1U)
#define GLB_REG_GPIO_36_PU_MSK            (((1U << GLB_REG_GPIO_36_PU_LEN) - 1) << GLB_REG_GPIO_36_PU_POS)
#define GLB_REG_GPIO_36_PU_UMSK           (~(((1U << GLB_REG_GPIO_36_PU_LEN) - 1) << GLB_REG_GPIO_36_PU_POS))
#define GLB_REG_GPIO_36_PD                GLB_REG_GPIO_36_PD
#define GLB_REG_GPIO_36_PD_POS            (5U)
#define GLB_REG_GPIO_36_PD_LEN            (1U)
#define GLB_REG_GPIO_36_PD_MSK            (((1U << GLB_REG_GPIO_36_PD_LEN) - 1) << GLB_REG_GPIO_36_PD_POS)
#define GLB_REG_GPIO_36_PD_UMSK           (~(((1U << GLB_REG_GPIO_36_PD_LEN) - 1) << GLB_REG_GPIO_36_PD_POS))
#define GLB_REG_GPIO_36_OE                GLB_REG_GPIO_36_OE
#define GLB_REG_GPIO_36_OE_POS            (6U)
#define GLB_REG_GPIO_36_OE_LEN            (1U)
#define GLB_REG_GPIO_36_OE_MSK            (((1U << GLB_REG_GPIO_36_OE_LEN) - 1) << GLB_REG_GPIO_36_OE_POS)
#define GLB_REG_GPIO_36_OE_UMSK           (~(((1U << GLB_REG_GPIO_36_OE_LEN) - 1) << GLB_REG_GPIO_36_OE_POS))
#define GLB_REG_GPIO_36_FUNC_SEL          GLB_REG_GPIO_36_FUNC_SEL
#define GLB_REG_GPIO_36_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_36_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_36_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_36_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_36_FUNC_SEL_POS)
#define GLB_REG_GPIO_36_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_36_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_36_FUNC_SEL_POS))
#define GLB_REG_GPIO_36_INT_MODE_SET      GLB_REG_GPIO_36_INT_MODE_SET
#define GLB_REG_GPIO_36_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_36_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_36_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_36_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_36_INT_MODE_SET_POS)
#define GLB_REG_GPIO_36_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_36_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_36_INT_MODE_SET_POS))
#define GLB_REG_GPIO_36_INT_CLR           GLB_REG_GPIO_36_INT_CLR
#define GLB_REG_GPIO_36_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_36_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_36_INT_CLR_MSK       (((1U << GLB_REG_GPIO_36_INT_CLR_LEN) - 1) << GLB_REG_GPIO_36_INT_CLR_POS)
#define GLB_REG_GPIO_36_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_36_INT_CLR_LEN) - 1) << GLB_REG_GPIO_36_INT_CLR_POS))
#define GLB_GPIO_36_INT_STAT              GLB_GPIO_36_INT_STAT
#define GLB_GPIO_36_INT_STAT_POS          (21U)
#define GLB_GPIO_36_INT_STAT_LEN          (1U)
#define GLB_GPIO_36_INT_STAT_MSK          (((1U << GLB_GPIO_36_INT_STAT_LEN) - 1) << GLB_GPIO_36_INT_STAT_POS)
#define GLB_GPIO_36_INT_STAT_UMSK         (~(((1U << GLB_GPIO_36_INT_STAT_LEN) - 1) << GLB_GPIO_36_INT_STAT_POS))
#define GLB_REG_GPIO_36_INT_MASK          GLB_REG_GPIO_36_INT_MASK
#define GLB_REG_GPIO_36_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_36_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_36_INT_MASK_MSK      (((1U << GLB_REG_GPIO_36_INT_MASK_LEN) - 1) << GLB_REG_GPIO_36_INT_MASK_POS)
#define GLB_REG_GPIO_36_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_36_INT_MASK_LEN) - 1) << GLB_REG_GPIO_36_INT_MASK_POS))
#define GLB_REG_GPIO_36_O                 GLB_REG_GPIO_36_O
#define GLB_REG_GPIO_36_O_POS             (24U)
#define GLB_REG_GPIO_36_O_LEN             (1U)
#define GLB_REG_GPIO_36_O_MSK             (((1U << GLB_REG_GPIO_36_O_LEN) - 1) << GLB_REG_GPIO_36_O_POS)
#define GLB_REG_GPIO_36_O_UMSK            (~(((1U << GLB_REG_GPIO_36_O_LEN) - 1) << GLB_REG_GPIO_36_O_POS))
#define GLB_REG_GPIO_36_SET               GLB_REG_GPIO_36_SET
#define GLB_REG_GPIO_36_SET_POS           (25U)
#define GLB_REG_GPIO_36_SET_LEN           (1U)
#define GLB_REG_GPIO_36_SET_MSK           (((1U << GLB_REG_GPIO_36_SET_LEN) - 1) << GLB_REG_GPIO_36_SET_POS)
#define GLB_REG_GPIO_36_SET_UMSK          (~(((1U << GLB_REG_GPIO_36_SET_LEN) - 1) << GLB_REG_GPIO_36_SET_POS))
#define GLB_REG_GPIO_36_CLR               GLB_REG_GPIO_36_CLR
#define GLB_REG_GPIO_36_CLR_POS           (26U)
#define GLB_REG_GPIO_36_CLR_LEN           (1U)
#define GLB_REG_GPIO_36_CLR_MSK           (((1U << GLB_REG_GPIO_36_CLR_LEN) - 1) << GLB_REG_GPIO_36_CLR_POS)
#define GLB_REG_GPIO_36_CLR_UMSK          (~(((1U << GLB_REG_GPIO_36_CLR_LEN) - 1) << GLB_REG_GPIO_36_CLR_POS))
#define GLB_REG_GPIO_36_I                 GLB_REG_GPIO_36_I
#define GLB_REG_GPIO_36_I_POS             (28U)
#define GLB_REG_GPIO_36_I_LEN             (1U)
#define GLB_REG_GPIO_36_I_MSK             (((1U << GLB_REG_GPIO_36_I_LEN) - 1) << GLB_REG_GPIO_36_I_POS)
#define GLB_REG_GPIO_36_I_UMSK            (~(((1U << GLB_REG_GPIO_36_I_LEN) - 1) << GLB_REG_GPIO_36_I_POS))
#define GLB_REG_GPIO_36_MODE              GLB_REG_GPIO_36_MODE
#define GLB_REG_GPIO_36_MODE_POS          (30U)
#define GLB_REG_GPIO_36_MODE_LEN          (2U)
#define GLB_REG_GPIO_36_MODE_MSK          (((1U << GLB_REG_GPIO_36_MODE_LEN) - 1) << GLB_REG_GPIO_36_MODE_POS)
#define GLB_REG_GPIO_36_MODE_UMSK         (~(((1U << GLB_REG_GPIO_36_MODE_LEN) - 1) << GLB_REG_GPIO_36_MODE_POS))

/* 0x958 : gpio_cfg37 */
#define GLB_GPIO_CFG37_OFFSET             (0x958)
#define GLB_REG_GPIO_37_IE                GLB_REG_GPIO_37_IE
#define GLB_REG_GPIO_37_IE_POS            (0U)
#define GLB_REG_GPIO_37_IE_LEN            (1U)
#define GLB_REG_GPIO_37_IE_MSK            (((1U << GLB_REG_GPIO_37_IE_LEN) - 1) << GLB_REG_GPIO_37_IE_POS)
#define GLB_REG_GPIO_37_IE_UMSK           (~(((1U << GLB_REG_GPIO_37_IE_LEN) - 1) << GLB_REG_GPIO_37_IE_POS))
#define GLB_REG_GPIO_37_SMT               GLB_REG_GPIO_37_SMT
#define GLB_REG_GPIO_37_SMT_POS           (1U)
#define GLB_REG_GPIO_37_SMT_LEN           (1U)
#define GLB_REG_GPIO_37_SMT_MSK           (((1U << GLB_REG_GPIO_37_SMT_LEN) - 1) << GLB_REG_GPIO_37_SMT_POS)
#define GLB_REG_GPIO_37_SMT_UMSK          (~(((1U << GLB_REG_GPIO_37_SMT_LEN) - 1) << GLB_REG_GPIO_37_SMT_POS))
#define GLB_REG_GPIO_37_DRV               GLB_REG_GPIO_37_DRV
#define GLB_REG_GPIO_37_DRV_POS           (2U)
#define GLB_REG_GPIO_37_DRV_LEN           (2U)
#define GLB_REG_GPIO_37_DRV_MSK           (((1U << GLB_REG_GPIO_37_DRV_LEN) - 1) << GLB_REG_GPIO_37_DRV_POS)
#define GLB_REG_GPIO_37_DRV_UMSK          (~(((1U << GLB_REG_GPIO_37_DRV_LEN) - 1) << GLB_REG_GPIO_37_DRV_POS))
#define GLB_REG_GPIO_37_PU                GLB_REG_GPIO_37_PU
#define GLB_REG_GPIO_37_PU_POS            (4U)
#define GLB_REG_GPIO_37_PU_LEN            (1U)
#define GLB_REG_GPIO_37_PU_MSK            (((1U << GLB_REG_GPIO_37_PU_LEN) - 1) << GLB_REG_GPIO_37_PU_POS)
#define GLB_REG_GPIO_37_PU_UMSK           (~(((1U << GLB_REG_GPIO_37_PU_LEN) - 1) << GLB_REG_GPIO_37_PU_POS))
#define GLB_REG_GPIO_37_PD                GLB_REG_GPIO_37_PD
#define GLB_REG_GPIO_37_PD_POS            (5U)
#define GLB_REG_GPIO_37_PD_LEN            (1U)
#define GLB_REG_GPIO_37_PD_MSK            (((1U << GLB_REG_GPIO_37_PD_LEN) - 1) << GLB_REG_GPIO_37_PD_POS)
#define GLB_REG_GPIO_37_PD_UMSK           (~(((1U << GLB_REG_GPIO_37_PD_LEN) - 1) << GLB_REG_GPIO_37_PD_POS))
#define GLB_REG_GPIO_37_OE                GLB_REG_GPIO_37_OE
#define GLB_REG_GPIO_37_OE_POS            (6U)
#define GLB_REG_GPIO_37_OE_LEN            (1U)
#define GLB_REG_GPIO_37_OE_MSK            (((1U << GLB_REG_GPIO_37_OE_LEN) - 1) << GLB_REG_GPIO_37_OE_POS)
#define GLB_REG_GPIO_37_OE_UMSK           (~(((1U << GLB_REG_GPIO_37_OE_LEN) - 1) << GLB_REG_GPIO_37_OE_POS))
#define GLB_REG_GPIO_37_FUNC_SEL          GLB_REG_GPIO_37_FUNC_SEL
#define GLB_REG_GPIO_37_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_37_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_37_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_37_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_37_FUNC_SEL_POS)
#define GLB_REG_GPIO_37_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_37_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_37_FUNC_SEL_POS))
#define GLB_REG_GPIO_37_INT_MODE_SET      GLB_REG_GPIO_37_INT_MODE_SET
#define GLB_REG_GPIO_37_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_37_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_37_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_37_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_37_INT_MODE_SET_POS)
#define GLB_REG_GPIO_37_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_37_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_37_INT_MODE_SET_POS))
#define GLB_REG_GPIO_37_INT_CLR           GLB_REG_GPIO_37_INT_CLR
#define GLB_REG_GPIO_37_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_37_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_37_INT_CLR_MSK       (((1U << GLB_REG_GPIO_37_INT_CLR_LEN) - 1) << GLB_REG_GPIO_37_INT_CLR_POS)
#define GLB_REG_GPIO_37_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_37_INT_CLR_LEN) - 1) << GLB_REG_GPIO_37_INT_CLR_POS))
#define GLB_GPIO_37_INT_STAT              GLB_GPIO_37_INT_STAT
#define GLB_GPIO_37_INT_STAT_POS          (21U)
#define GLB_GPIO_37_INT_STAT_LEN          (1U)
#define GLB_GPIO_37_INT_STAT_MSK          (((1U << GLB_GPIO_37_INT_STAT_LEN) - 1) << GLB_GPIO_37_INT_STAT_POS)
#define GLB_GPIO_37_INT_STAT_UMSK         (~(((1U << GLB_GPIO_37_INT_STAT_LEN) - 1) << GLB_GPIO_37_INT_STAT_POS))
#define GLB_REG_GPIO_37_INT_MASK          GLB_REG_GPIO_37_INT_MASK
#define GLB_REG_GPIO_37_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_37_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_37_INT_MASK_MSK      (((1U << GLB_REG_GPIO_37_INT_MASK_LEN) - 1) << GLB_REG_GPIO_37_INT_MASK_POS)
#define GLB_REG_GPIO_37_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_37_INT_MASK_LEN) - 1) << GLB_REG_GPIO_37_INT_MASK_POS))
#define GLB_REG_GPIO_37_O                 GLB_REG_GPIO_37_O
#define GLB_REG_GPIO_37_O_POS             (24U)
#define GLB_REG_GPIO_37_O_LEN             (1U)
#define GLB_REG_GPIO_37_O_MSK             (((1U << GLB_REG_GPIO_37_O_LEN) - 1) << GLB_REG_GPIO_37_O_POS)
#define GLB_REG_GPIO_37_O_UMSK            (~(((1U << GLB_REG_GPIO_37_O_LEN) - 1) << GLB_REG_GPIO_37_O_POS))
#define GLB_REG_GPIO_37_SET               GLB_REG_GPIO_37_SET
#define GLB_REG_GPIO_37_SET_POS           (25U)
#define GLB_REG_GPIO_37_SET_LEN           (1U)
#define GLB_REG_GPIO_37_SET_MSK           (((1U << GLB_REG_GPIO_37_SET_LEN) - 1) << GLB_REG_GPIO_37_SET_POS)
#define GLB_REG_GPIO_37_SET_UMSK          (~(((1U << GLB_REG_GPIO_37_SET_LEN) - 1) << GLB_REG_GPIO_37_SET_POS))
#define GLB_REG_GPIO_37_CLR               GLB_REG_GPIO_37_CLR
#define GLB_REG_GPIO_37_CLR_POS           (26U)
#define GLB_REG_GPIO_37_CLR_LEN           (1U)
#define GLB_REG_GPIO_37_CLR_MSK           (((1U << GLB_REG_GPIO_37_CLR_LEN) - 1) << GLB_REG_GPIO_37_CLR_POS)
#define GLB_REG_GPIO_37_CLR_UMSK          (~(((1U << GLB_REG_GPIO_37_CLR_LEN) - 1) << GLB_REG_GPIO_37_CLR_POS))
#define GLB_REG_GPIO_37_I                 GLB_REG_GPIO_37_I
#define GLB_REG_GPIO_37_I_POS             (28U)
#define GLB_REG_GPIO_37_I_LEN             (1U)
#define GLB_REG_GPIO_37_I_MSK             (((1U << GLB_REG_GPIO_37_I_LEN) - 1) << GLB_REG_GPIO_37_I_POS)
#define GLB_REG_GPIO_37_I_UMSK            (~(((1U << GLB_REG_GPIO_37_I_LEN) - 1) << GLB_REG_GPIO_37_I_POS))
#define GLB_REG_GPIO_37_MODE              GLB_REG_GPIO_37_MODE
#define GLB_REG_GPIO_37_MODE_POS          (30U)
#define GLB_REG_GPIO_37_MODE_LEN          (2U)
#define GLB_REG_GPIO_37_MODE_MSK          (((1U << GLB_REG_GPIO_37_MODE_LEN) - 1) << GLB_REG_GPIO_37_MODE_POS)
#define GLB_REG_GPIO_37_MODE_UMSK         (~(((1U << GLB_REG_GPIO_37_MODE_LEN) - 1) << GLB_REG_GPIO_37_MODE_POS))

