XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/glb_reg.h
/* 0x9AC : gpio_cfg58 */
#define GLB_GPIO_CFG58_OFFSET    (0x9AC)
#define GLB_REG_GPIO_58_IE       GLB_REG_GPIO_58_IE
#define GLB_REG_GPIO_58_IE_POS   (0U)
#define GLB_REG_GPIO_58_IE_LEN   (1U)
#define GLB_REG_GPIO_58_IE_MSK   (((1U << GLB_REG_GPIO_58_IE_LEN) - 1) << GLB_REG_GPIO_58_IE_POS)
#define GLB_REG_GPIO_58_IE_UMSK  (~(((1U << GLB_REG_GPIO_58_IE_LEN) - 1) << GLB_REG_GPIO_58_IE_POS))
#define GLB_REG_GPIO_58_SMT      GLB_REG_GPIO_58_SMT
#define GLB_REG_GPIO_58_SMT_POS  (1U)
#define GLB_REG_GPIO_58_SMT_LEN  (1U)
#define GLB_REG_GPIO_58_SMT_MSK  (((1U << GLB_REG_GPIO_58_SMT_LEN) - 1) << GLB_REG_GPIO_58_SMT_POS)
#define GLB_REG_GPIO_58_SMT_UMSK (~(((1U << GLB_REG_GPIO_58_SMT_LEN) - 1) << GLB_REG_GPIO_58_SMT_POS))
#define GLB_REG_GPIO_58_DRV      GLB_REG_GPIO_58_DRV
#define GLB_REG_GPIO_58_DRV_POS  (2U)
#define GLB_REG_GPIO_58_DRV_LEN  (2U)
#define GLB_REG_GPIO_58_DRV_MSK  (((1U << GLB_REG_GPIO_58_DRV_LEN) - 1) << GLB_REG_GPIO_58_DRV_POS)
#define GLB_REG_GPIO_58_DRV_UMSK (~(((1U << GLB_REG_GPIO_58_DRV_LEN) - 1) << GLB_REG_GPIO_58_DRV_POS))
#define GLB_REG_GPIO_58_PU       GLB_REG_GPIO_58_PU
#define GLB_REG_GPIO_58_PU_POS   (4U)
#define GLB_REG_GPIO_58_PU_LEN   (1U)
#define GLB_REG_GPIO_58_PU_MSK   (((1U << GLB_REG_GPIO_58_PU_LEN) - 1) << GLB_REG_GPIO_58_PU_POS)
#define GLB_REG_GPIO_58_PU_UMSK  (~(((1U << GLB_REG_GPIO_58_PU_LEN) - 1) << GLB_REG_GPIO_58_PU_POS))
#define GLB_REG_GPIO_58_PD       GLB_REG_GPIO_58_PD
#define GLB_REG_GPIO_58_PD_POS   (5U)
#define GLB_REG_GPIO_58_PD_LEN   (1U)
#define GLB_REG_GPIO_58_PD_MSK   (((1U << GLB_REG_GPIO_58_PD_LEN) - 1) << GLB_REG_GPIO_58_PD_POS)
#define GLB_REG_GPIO_58_PD_UMSK  (~(((1U << GLB_REG_GPIO_58_PD_LEN) - 1) << GLB_REG_GPIO_58_PD_POS))

/* 0x9B0 : gpio_cfg59 */
#define GLB_GPIO_CFG59_OFFSET    (0x9B0)
#define GLB_REG_GPIO_59_IE       GLB_REG_GPIO_59_IE
#define GLB_REG_GPIO_59_IE_POS   (0U)
#define GLB_REG_GPIO_59_IE_LEN   (1U)
#define GLB_REG_GPIO_59_IE_MSK   (((1U << GLB_REG_GPIO_59_IE_LEN) - 1) << GLB_REG_GPIO_59_IE_POS)
#define GLB_REG_GPIO_59_IE_UMSK  (~(((1U << GLB_REG_GPIO_59_IE_LEN) - 1) << GLB_REG_GPIO_59_IE_POS))
#define GLB_REG_GPIO_59_SMT      GLB_REG_GPIO_59_SMT
#define GLB_REG_GPIO_59_SMT_POS  (1U)
#define GLB_REG_GPIO_59_SMT_LEN  (1U)
#define GLB_REG_GPIO_59_SMT_MSK  (((1U << GLB_REG_GPIO_59_SMT_LEN) - 1) << GLB_REG_GPIO_59_SMT_POS)
#define GLB_REG_GPIO_59_SMT_UMSK (~(((1U << GLB_REG_GPIO_59_SMT_LEN) - 1) << GLB_REG_GPIO_59_SMT_POS))
#define GLB_REG_GPIO_59_DRV      GLB_REG_GPIO_59_DRV
#define GLB_REG_GPIO_59_DRV_POS  (2U)
#define GLB_REG_GPIO_59_DRV_LEN  (2U)
#define GLB_REG_GPIO_59_DRV_MSK  (((1U << GLB_REG_GPIO_59_DRV_LEN) - 1) << GLB_REG_GPIO_59_DRV_POS)
#define GLB_REG_GPIO_59_DRV_UMSK (~(((1U << GLB_REG_GPIO_59_DRV_LEN) - 1) << GLB_REG_GPIO_59_DRV_POS))
#define GLB_REG_GPIO_59_PU       GLB_REG_GPIO_59_PU
#define GLB_REG_GPIO_59_PU_POS   (4U)
#define GLB_REG_GPIO_59_PU_LEN   (1U)
#define GLB_REG_GPIO_59_PU_MSK   (((1U << GLB_REG_GPIO_59_PU_LEN) - 1) << GLB_REG_GPIO_59_PU_POS)
#define GLB_REG_GPIO_59_PU_UMSK  (~(((1U << GLB_REG_GPIO_59_PU_LEN) - 1) << GLB_REG_GPIO_59_PU_POS))
#define GLB_REG_GPIO_59_PD       GLB_REG_GPIO_59_PD
#define GLB_REG_GPIO_59_PD_POS   (5U)
#define GLB_REG_GPIO_59_PD_LEN   (1U)
#define GLB_REG_GPIO_59_PD_MSK   (((1U << GLB_REG_GPIO_59_PD_LEN) - 1) << GLB_REG_GPIO_59_PD_POS)
#define GLB_REG_GPIO_59_PD_UMSK  (~(((1U << GLB_REG_GPIO_59_PD_LEN) - 1) << GLB_REG_GPIO_59_PD_POS))

/* 0x9B4 : gpio_cfg60 */
#define GLB_GPIO_CFG60_OFFSET    (0x9B4)
#define GLB_REG_GPIO_60_IE       GLB_REG_GPIO_60_IE
#define GLB_REG_GPIO_60_IE_POS   (0U)
#define GLB_REG_GPIO_60_IE_LEN   (1U)
#define GLB_REG_GPIO_60_IE_MSK   (((1U << GLB_REG_GPIO_60_IE_LEN) - 1) << GLB_REG_GPIO_60_IE_POS)
#define GLB_REG_GPIO_60_IE_UMSK  (~(((1U << GLB_REG_GPIO_60_IE_LEN) - 1) << GLB_REG_GPIO_60_IE_POS))
#define GLB_REG_GPIO_60_SMT      GLB_REG_GPIO_60_SMT
#define GLB_REG_GPIO_60_SMT_POS  (1U)
#define GLB_REG_GPIO_60_SMT_LEN  (1U)
#define GLB_REG_GPIO_60_SMT_MSK  (((1U << GLB_REG_GPIO_60_SMT_LEN) - 1) << GLB_REG_GPIO_60_SMT_POS)
#define GLB_REG_GPIO_60_SMT_UMSK (~(((1U << GLB_REG_GPIO_60_SMT_LEN) - 1) << GLB_REG_GPIO_60_SMT_POS))
#define GLB_REG_GPIO_60_DRV      GLB_REG_GPIO_60_DRV
#define GLB_REG_GPIO_60_DRV_POS  (2U)
#define GLB_REG_GPIO_60_DRV_LEN  (2U)
#define GLB_REG_GPIO_60_DRV_MSK  (((1U << GLB_REG_GPIO_60_DRV_LEN) - 1) << GLB_REG_GPIO_60_DRV_POS)
#define GLB_REG_GPIO_60_DRV_UMSK (~(((1U << GLB_REG_GPIO_60_DRV_LEN) - 1) << GLB_REG_GPIO_60_DRV_POS))
#define GLB_REG_GPIO_60_PU       GLB_REG_GPIO_60_PU
#define GLB_REG_GPIO_60_PU_POS   (4U)
#define GLB_REG_GPIO_60_PU_LEN   (1U)
#define GLB_REG_GPIO_60_PU_MSK   (((1U << GLB_REG_GPIO_60_PU_LEN) - 1) << GLB_REG_GPIO_60_PU_POS)
#define GLB_REG_GPIO_60_PU_UMSK  (~(((1U << GLB_REG_GPIO_60_PU_LEN) - 1) << GLB_REG_GPIO_60_PU_POS))
#define GLB_REG_GPIO_60_PD       GLB_REG_GPIO_60_PD
#define GLB_REG_GPIO_60_PD_POS   (5U)
#define GLB_REG_GPIO_60_PD_LEN   (1U)
#define GLB_REG_GPIO_60_PD_MSK   (((1U << GLB_REG_GPIO_60_PD_LEN) - 1) << GLB_REG_GPIO_60_PD_POS)
#define GLB_REG_GPIO_60_PD_UMSK  (~(((1U << GLB_REG_GPIO_60_PD_LEN) - 1) << GLB_REG_GPIO_60_PD_POS))

/* 0x9B8 : gpio_cfg61 */
#define GLB_GPIO_CFG61_OFFSET    (0x9B8)
#define GLB_REG_GPIO_61_IE       GLB_REG_GPIO_61_IE
#define GLB_REG_GPIO_61_IE_POS   (0U)
#define GLB_REG_GPIO_61_IE_LEN   (1U)
#define GLB_REG_GPIO_61_IE_MSK   (((1U << GLB_REG_GPIO_61_IE_LEN) - 1) << GLB_REG_GPIO_61_IE_POS)
#define GLB_REG_GPIO_61_IE_UMSK  (~(((1U << GLB_REG_GPIO_61_IE_LEN) - 1) << GLB_REG_GPIO_61_IE_POS))
#define GLB_REG_GPIO_61_SMT      GLB_REG_GPIO_61_SMT
#define GLB_REG_GPIO_61_SMT_POS  (1U)
#define GLB_REG_GPIO_61_SMT_LEN  (1U)
#define GLB_REG_GPIO_61_SMT_MSK  (((1U << GLB_REG_GPIO_61_SMT_LEN) - 1) << GLB_REG_GPIO_61_SMT_POS)
#define GLB_REG_GPIO_61_SMT_UMSK (~(((1U << GLB_REG_GPIO_61_SMT_LEN) - 1) << GLB_REG_GPIO_61_SMT_POS))
#define GLB_REG_GPIO_61_DRV      GLB_REG_GPIO_61_DRV
#define GLB_REG_GPIO_61_DRV_POS  (2U)
#define GLB_REG_GPIO_61_DRV_LEN  (2U)
#define GLB_REG_GPIO_61_DRV_MSK  (((1U << GLB_REG_GPIO_61_DRV_LEN) - 1) << GLB_REG_GPIO_61_DRV_POS)
#define GLB_REG_GPIO_61_DRV_UMSK (~(((1U << GLB_REG_GPIO_61_DRV_LEN) - 1) << GLB_REG_GPIO_61_DRV_POS))
#define GLB_REG_GPIO_61_PU       GLB_REG_GPIO_61_PU
#define GLB_REG_GPIO_61_PU_POS   (4U)
#define GLB_REG_GPIO_61_PU_LEN   (1U)
#define GLB_REG_GPIO_61_PU_MSK   (((1U << GLB_REG_GPIO_61_PU_LEN) - 1) << GLB_REG_GPIO_61_PU_POS)
#define GLB_REG_GPIO_61_PU_UMSK  (~(((1U << GLB_REG_GPIO_61_PU_LEN) - 1) << GLB_REG_GPIO_61_PU_POS))
#define GLB_REG_GPIO_61_PD       GLB_REG_GPIO_61_PD
#define GLB_REG_GPIO_61_PD_POS   (5U)
#define GLB_REG_GPIO_61_PD_LEN   (1U)
#define GLB_REG_GPIO_61_PD_MSK   (((1U << GLB_REG_GPIO_61_PD_LEN) - 1) << GLB_REG_GPIO_61_PD_POS)
#define GLB_REG_GPIO_61_PD_UMSK  (~(((1U << GLB_REG_GPIO_61_PD_LEN) - 1) << GLB_REG_GPIO_61_PD_POS))

/* 0x9BC : gpio_cfg62 */
#define GLB_GPIO_CFG62_OFFSET    (0x9BC)
#define GLB_REG_GPIO_62_IE       GLB_REG_GPIO_62_IE
#define GLB_REG_GPIO_62_IE_POS   (0U)
#define GLB_REG_GPIO_62_IE_LEN   (1U)
#define GLB_REG_GPIO_62_IE_MSK   (((1U << GLB_REG_GPIO_62_IE_LEN) - 1) << GLB_REG_GPIO_62_IE_POS)
#define GLB_REG_GPIO_62_IE_UMSK  (~(((1U << GLB_REG_GPIO_62_IE_LEN) - 1) << GLB_REG_GPIO_62_IE_POS))
#define GLB_REG_GPIO_62_SMT      GLB_REG_GPIO_62_SMT
#define GLB_REG_GPIO_62_SMT_POS  (1U)
#define GLB_REG_GPIO_62_SMT_LEN  (1U)
#define GLB_REG_GPIO_62_SMT_MSK  (((1U << GLB_REG_GPIO_62_SMT_LEN) - 1) << GLB_REG_GPIO_62_SMT_POS)
#define GLB_REG_GPIO_62_SMT_UMSK (~(((1U << GLB_REG_GPIO_62_SMT_LEN) - 1) << GLB_REG_GPIO_62_SMT_POS))
#define GLB_REG_GPIO_62_DRV      GLB_REG_GPIO_62_DRV
#define GLB_REG_GPIO_62_DRV_POS  (2U)
#define GLB_REG_GPIO_62_DRV_LEN  (2U)
#define GLB_REG_GPIO_62_DRV_MSK  (((1U << GLB_REG_GPIO_62_DRV_LEN) - 1) << GLB_REG_GPIO_62_DRV_POS)
#define GLB_REG_GPIO_62_DRV_UMSK (~(((1U << GLB_REG_GPIO_62_DRV_LEN) - 1) << GLB_REG_GPIO_62_DRV_POS))
#define GLB_REG_GPIO_62_PU       GLB_REG_GPIO_62_PU
#define GLB_REG_GPIO_62_PU_POS   (4U)
#define GLB_REG_GPIO_62_PU_LEN   (1U)
#define GLB_REG_GPIO_62_PU_MSK   (((1U << GLB_REG_GPIO_62_PU_LEN) - 1) << GLB_REG_GPIO_62_PU_POS)
#define GLB_REG_GPIO_62_PU_UMSK  (~(((1U << GLB_REG_GPIO_62_PU_LEN) - 1) << GLB_REG_GPIO_62_PU_POS))
#define GLB_REG_GPIO_62_PD       GLB_REG_GPIO_62_PD
#define GLB_REG_GPIO_62_PD_POS   (5U)
#define GLB_REG_GPIO_62_PD_LEN   (1U)
#define GLB_REG_GPIO_62_PD_MSK   (((1U << GLB_REG_GPIO_62_PD_LEN) - 1) << GLB_REG_GPIO_62_PD_POS)
#define GLB_REG_GPIO_62_PD_UMSK  (~(((1U << GLB_REG_GPIO_62_PD_LEN) - 1) << GLB_REG_GPIO_62_PD_POS))

/* 0x9C0 : gpio_cfg63 */
#define GLB_GPIO_CFG63_OFFSET    (0x9C0)
#define GLB_REG_GPIO_63_IE       GLB_REG_GPIO_63_IE
#define GLB_REG_GPIO_63_IE_POS   (0U)
#define GLB_REG_GPIO_63_IE_LEN   (1U)
#define GLB_REG_GPIO_63_IE_MSK   (((1U << GLB_REG_GPIO_63_IE_LEN) - 1) << GLB_REG_GPIO_63_IE_POS)
#define GLB_REG_GPIO_63_IE_UMSK  (~(((1U << GLB_REG_GPIO_63_IE_LEN) - 1) << GLB_REG_GPIO_63_IE_POS))
#define GLB_REG_GPIO_63_SMT      GLB_REG_GPIO_63_SMT
#define GLB_REG_GPIO_63_SMT_POS  (1U)
#define GLB_REG_GPIO_63_SMT_LEN  (1U)
#define GLB_REG_GPIO_63_SMT_MSK  (((1U << GLB_REG_GPIO_63_SMT_LEN) - 1) << GLB_REG_GPIO_63_SMT_POS)
#define GLB_REG_GPIO_63_SMT_UMSK (~(((1U << GLB_REG_GPIO_63_SMT_LEN) - 1) << GLB_REG_GPIO_63_SMT_POS))
#define GLB_REG_GPIO_63_DRV      GLB_REG_GPIO_63_DRV
#define GLB_REG_GPIO_63_DRV_POS  (2U)
#define GLB_REG_GPIO_63_DRV_LEN  (2U)
#define GLB_REG_GPIO_63_DRV_MSK  (((1U << GLB_REG_GPIO_63_DRV_LEN) - 1) << GLB_REG_GPIO_63_DRV_POS)
#define GLB_REG_GPIO_63_DRV_UMSK (~(((1U << GLB_REG_GPIO_63_DRV_LEN) - 1) << GLB_REG_GPIO_63_DRV_POS))
#define GLB_REG_GPIO_63_PU       GLB_REG_GPIO_63_PU
#define GLB_REG_GPIO_63_PU_POS   (4U)
#define GLB_REG_GPIO_63_PU_LEN   (1U)
#define GLB_REG_GPIO_63_PU_MSK   (((1U << GLB_REG_GPIO_63_PU_LEN) - 1) << GLB_REG_GPIO_63_PU_POS)
#define GLB_REG_GPIO_63_PU_UMSK  (~(((1U << GLB_REG_GPIO_63_PU_LEN) - 1) << GLB_REG_GPIO_63_PU_POS))
#define GLB_REG_GPIO_63_PD       GLB_REG_GPIO_63_PD
#define GLB_REG_GPIO_63_PD_POS   (5U)
#define GLB_REG_GPIO_63_PD_LEN   (1U)
#define GLB_REG_GPIO_63_PD_MSK   (((1U << GLB_REG_GPIO_63_PD_LEN) - 1) << GLB_REG_GPIO_63_PD_POS)
#define GLB_REG_GPIO_63_PD_UMSK  (~(((1U << GLB_REG_GPIO_63_PD_LEN) - 1) << GLB_REG_GPIO_63_PD_POS))

/* 0xAC4 : gpio_cfg128 */
#define GLB_GPIO_CFG128_OFFSET  (0xAC4)
#define GLB_REG2_GPIO_0_I       GLB_REG2_GPIO_0_I
#define GLB_REG2_GPIO_0_I_POS   (0U)
#define GLB_REG2_GPIO_0_I_LEN   (1U)
#define GLB_REG2_GPIO_0_I_MSK   (((1U << GLB_REG2_GPIO_0_I_LEN) - 1) << GLB_REG2_GPIO_0_I_POS)
#define GLB_REG2_GPIO_0_I_UMSK  (~(((1U << GLB_REG2_GPIO_0_I_LEN) - 1) << GLB_REG2_GPIO_0_I_POS))
#define GLB_REG2_GPIO_1_I       GLB_REG2_GPIO_1_I
#define GLB_REG2_GPIO_1_I_POS   (1U)
#define GLB_REG2_GPIO_1_I_LEN   (1U)
#define GLB_REG2_GPIO_1_I_MSK   (((1U << GLB_REG2_GPIO_1_I_LEN) - 1) << GLB_REG2_GPIO_1_I_POS)
#define GLB_REG2_GPIO_1_I_UMSK  (~(((1U << GLB_REG2_GPIO_1_I_LEN) - 1) << GLB_REG2_GPIO_1_I_POS))
#define GLB_REG2_GPIO_2_I       GLB_REG2_GPIO_2_I
#define GLB_REG2_GPIO_2_I_POS   (2U)
#define GLB_REG2_GPIO_2_I_LEN   (1U)
#define GLB_REG2_GPIO_2_I_MSK   (((1U << GLB_REG2_GPIO_2_I_LEN) - 1) << GLB_REG2_GPIO_2_I_POS)
#define GLB_REG2_GPIO_2_I_UMSK  (~(((1U << GLB_REG2_GPIO_2_I_LEN) - 1) << GLB_REG2_GPIO_2_I_POS))
#define GLB_REG2_GPIO_3_I       GLB_REG2_GPIO_3_I
#define GLB_REG2_GPIO_3_I_POS   (3U)
#define GLB_REG2_GPIO_3_I_LEN   (1U)
#define GLB_REG2_GPIO_3_I_MSK   (((1U << GLB_REG2_GPIO_3_I_LEN) - 1) << GLB_REG2_GPIO_3_I_POS)
#define GLB_REG2_GPIO_3_I_UMSK  (~(((1U << GLB_REG2_GPIO_3_I_LEN) - 1) << GLB_REG2_GPIO_3_I_POS))
#define GLB_REG2_GPIO_4_I       GLB_REG2_GPIO_4_I
#define GLB_REG2_GPIO_4_I_POS   (4U)
#define GLB_REG2_GPIO_4_I_LEN   (1U)
#define GLB_REG2_GPIO_4_I_MSK   (((1U << GLB_REG2_GPIO_4_I_LEN) - 1) << GLB_REG2_GPIO_4_I_POS)
#define GLB_REG2_GPIO_4_I_UMSK  (~(((1U << GLB_REG2_GPIO_4_I_LEN) - 1) << GLB_REG2_GPIO_4_I_POS))
#define GLB_REG2_GPIO_5_I       GLB_REG2_GPIO_5_I
#define GLB_REG2_GPIO_5_I_POS   (5U)
#define GLB_REG2_GPIO_5_I_LEN   (1U)
#define GLB_REG2_GPIO_5_I_MSK   (((1U << GLB_REG2_GPIO_5_I_LEN) - 1) << GLB_REG2_GPIO_5_I_POS)
#define GLB_REG2_GPIO_5_I_UMSK  (~(((1U << GLB_REG2_GPIO_5_I_LEN) - 1) << GLB_REG2_GPIO_5_I_POS))
#define GLB_REG2_GPIO_6_I       GLB_REG2_GPIO_6_I
#define GLB_REG2_GPIO_6_I_POS   (6U)
#define GLB_REG2_GPIO_6_I_LEN   (1U)
#define GLB_REG2_GPIO_6_I_MSK   (((1U << GLB_REG2_GPIO_6_I_LEN) - 1) << GLB_REG2_GPIO_6_I_POS)
#define GLB_REG2_GPIO_6_I_UMSK  (~(((1U << GLB_REG2_GPIO_6_I_LEN) - 1) << GLB_REG2_GPIO_6_I_POS))
#define GLB_REG2_GPIO_7_I       GLB_REG2_GPIO_7_I
#define GLB_REG2_GPIO_7_I_POS   (7U)
#define GLB_REG2_GPIO_7_I_LEN   (1U)
#define GLB_REG2_GPIO_7_I_MSK   (((1U << GLB_REG2_GPIO_7_I_LEN) - 1) << GLB_REG2_GPIO_7_I_POS)
#define GLB_REG2_GPIO_7_I_UMSK  (~(((1U << GLB_REG2_GPIO_7_I_LEN) - 1) << GLB_REG2_GPIO_7_I_POS))
#define GLB_REG2_GPIO_8_I       GLB_REG2_GPIO_8_I
#define GLB_REG2_GPIO_8_I_POS   (8U)
#define GLB_REG2_GPIO_8_I_LEN   (1U)
#define GLB_REG2_GPIO_8_I_MSK   (((1U << GLB_REG2_GPIO_8_I_LEN) - 1) << GLB_REG2_GPIO_8_I_POS)
#define GLB_REG2_GPIO_8_I_UMSK  (~(((1U << GLB_REG2_GPIO_8_I_LEN) - 1) << GLB_REG2_GPIO_8_I_POS))
#define GLB_REG2_GPIO_9_I       GLB_REG2_GPIO_9_I
#define GLB_REG2_GPIO_9_I_POS   (9U)
#define GLB_REG2_GPIO_9_I_LEN   (1U)
#define GLB_REG2_GPIO_9_I_MSK   (((1U << GLB_REG2_GPIO_9_I_LEN) - 1) << GLB_REG2_GPIO_9_I_POS)
#define GLB_REG2_GPIO_9_I_UMSK  (~(((1U << GLB_REG2_GPIO_9_I_LEN) - 1) << GLB_REG2_GPIO_9_I_POS))
#define GLB_REG2_GPIO_10_I      GLB_REG2_GPIO_10_I
#define GLB_REG2_GPIO_10_I_POS  (10U)
#define GLB_REG2_GPIO_10_I_LEN  (1U)
#define GLB_REG2_GPIO_10_I_MSK  (((1U << GLB_REG2_GPIO_10_I_LEN) - 1) << GLB_REG2_GPIO_10_I_POS)
#define GLB_REG2_GPIO_10_I_UMSK (~(((1U << GLB_REG2_GPIO_10_I_LEN) - 1) << GLB_REG2_GPIO_10_I_POS))
#define GLB_REG2_GPIO_11_I      GLB_REG2_GPIO_11_I
#define GLB_REG2_GPIO_11_I_POS  (11U)
#define GLB_REG2_GPIO_11_I_LEN  (1U)
#define GLB_REG2_GPIO_11_I_MSK  (((1U << GLB_REG2_GPIO_11_I_LEN) - 1) << GLB_REG2_GPIO_11_I_POS)
#define GLB_REG2_GPIO_11_I_UMSK (~(((1U << GLB_REG2_GPIO_11_I_LEN) - 1) << GLB_REG2_GPIO_11_I_POS))
#define GLB_REG2_GPIO_12_I      GLB_REG2_GPIO_12_I
#define GLB_REG2_GPIO_12_I_POS  (12U)
#define GLB_REG2_GPIO_12_I_LEN  (1U)
#define GLB_REG2_GPIO_12_I_MSK  (((1U << GLB_REG2_GPIO_12_I_LEN) - 1) << GLB_REG2_GPIO_12_I_POS)
#define GLB_REG2_GPIO_12_I_UMSK (~(((1U << GLB_REG2_GPIO_12_I_LEN) - 1) << GLB_REG2_GPIO_12_I_POS))
#define GLB_REG2_GPIO_13_I      GLB_REG2_GPIO_13_I
#define GLB_REG2_GPIO_13_I_POS  (13U)
#define GLB_REG2_GPIO_13_I_LEN  (1U)
#define GLB_REG2_GPIO_13_I_MSK  (((1U << GLB_REG2_GPIO_13_I_LEN) - 1) << GLB_REG2_GPIO_13_I_POS)
#define GLB_REG2_GPIO_13_I_UMSK (~(((1U << GLB_REG2_GPIO_13_I_LEN) - 1) << GLB_REG2_GPIO_13_I_POS))
#define GLB_REG2_GPIO_14_I      GLB_REG2_GPIO_14_I
#define GLB_REG2_GPIO_14_I_POS  (14U)
#define GLB_REG2_GPIO_14_I_LEN  (1U)
#define GLB_REG2_GPIO_14_I_MSK  (((1U << GLB_REG2_GPIO_14_I_LEN) - 1) << GLB_REG2_GPIO_14_I_POS)
#define GLB_REG2_GPIO_14_I_UMSK (~(((1U << GLB_REG2_GPIO_14_I_LEN) - 1) << GLB_REG2_GPIO_14_I_POS))
#define GLB_REG2_GPIO_15_I      GLB_REG2_GPIO_15_I
#define GLB_REG2_GPIO_15_I_POS  (15U)
#define GLB_REG2_GPIO_15_I_LEN  (1U)
#define GLB_REG2_GPIO_15_I_MSK  (((1U << GLB_REG2_GPIO_15_I_LEN) - 1) << GLB_REG2_GPIO_15_I_POS)
#define GLB_REG2_GPIO_15_I_UMSK (~(((1U << GLB_REG2_GPIO_15_I_LEN) - 1) << GLB_REG2_GPIO_15_I_POS))
#define GLB_REG2_GPIO_16_I      GLB_REG2_GPIO_16_I
#define GLB_REG2_GPIO_16_I_POS  (16U)
#define GLB_REG2_GPIO_16_I_LEN  (1U)
#define GLB_REG2_GPIO_16_I_MSK  (((1U << GLB_REG2_GPIO_16_I_LEN) - 1) << GLB_REG2_GPIO_16_I_POS)
#define GLB_REG2_GPIO_16_I_UMSK (~(((1U << GLB_REG2_GPIO_16_I_LEN) - 1) << GLB_REG2_GPIO_16_I_POS))
#define GLB_REG2_GPIO_17_I      GLB_REG2_GPIO_17_I
#define GLB_REG2_GPIO_17_I_POS  (17U)
#define GLB_REG2_GPIO_17_I_LEN  (1U)
#define GLB_REG2_GPIO_17_I_MSK  (((1U << GLB_REG2_GPIO_17_I_LEN) - 1) << GLB_REG2_GPIO_17_I_POS)
#define GLB_REG2_GPIO_17_I_UMSK (~(((1U << GLB_REG2_GPIO_17_I_LEN) - 1) << GLB_REG2_GPIO_17_I_POS))
#define GLB_REG2_GPIO_18_I      GLB_REG2_GPIO_18_I
#define GLB_REG2_GPIO_18_I_POS  (18U)
#define GLB_REG2_GPIO_18_I_LEN  (1U)
#define GLB_REG2_GPIO_18_I_MSK  (((1U << GLB_REG2_GPIO_18_I_LEN) - 1) << GLB_REG2_GPIO_18_I_POS)
#define GLB_REG2_GPIO_18_I_UMSK (~(((1U << GLB_REG2_GPIO_18_I_LEN) - 1) << GLB_REG2_GPIO_18_I_POS))
#define GLB_REG2_GPIO_19_I      GLB_REG2_GPIO_19_I
#define GLB_REG2_GPIO_19_I_POS  (19U)
#define GLB_REG2_GPIO_19_I_LEN  (1U)
#define GLB_REG2_GPIO_19_I_MSK  (((1U << GLB_REG2_GPIO_19_I_LEN) - 1) << GLB_REG2_GPIO_19_I_POS)
#define GLB_REG2_GPIO_19_I_UMSK (~(((1U << GLB_REG2_GPIO_19_I_LEN) - 1) << GLB_REG2_GPIO_19_I_POS))
#define GLB_REG2_GPIO_20_I      GLB_REG2_GPIO_20_I
#define GLB_REG2_GPIO_20_I_POS  (20U)
#define GLB_REG2_GPIO_20_I_LEN  (1U)
#define GLB_REG2_GPIO_20_I_MSK  (((1U << GLB_REG2_GPIO_20_I_LEN) - 1) << GLB_REG2_GPIO_20_I_POS)
#define GLB_REG2_GPIO_20_I_UMSK (~(((1U << GLB_REG2_GPIO_20_I_LEN) - 1) << GLB_REG2_GPIO_20_I_POS))
#define GLB_REG2_GPIO_21_I      GLB_REG2_GPIO_21_I
#define GLB_REG2_GPIO_21_I_POS  (21U)
#define GLB_REG2_GPIO_21_I_LEN  (1U)
#define GLB_REG2_GPIO_21_I_MSK  (((1U << GLB_REG2_GPIO_21_I_LEN) - 1) << GLB_REG2_GPIO_21_I_POS)
#define GLB_REG2_GPIO_21_I_UMSK (~(((1U << GLB_REG2_GPIO_21_I_LEN) - 1) << GLB_REG2_GPIO_21_I_POS))
#define GLB_REG2_GPIO_22_I      GLB_REG2_GPIO_22_I
#define GLB_REG2_GPIO_22_I_POS  (22U)
#define GLB_REG2_GPIO_22_I_LEN  (1U)
#define GLB_REG2_GPIO_22_I_MSK  (((1U << GLB_REG2_GPIO_22_I_LEN) - 1) << GLB_REG2_GPIO_22_I_POS)
#define GLB_REG2_GPIO_22_I_UMSK (~(((1U << GLB_REG2_GPIO_22_I_LEN) - 1) << GLB_REG2_GPIO_22_I_POS))
#define GLB_REG2_GPIO_23_I      GLB_REG2_GPIO_23_I
#define GLB_REG2_GPIO_23_I_POS  (23U)
#define GLB_REG2_GPIO_23_I_LEN  (1U)
#define GLB_REG2_GPIO_23_I_MSK  (((1U << GLB_REG2_GPIO_23_I_LEN) - 1) << GLB_REG2_GPIO_23_I_POS)
#define GLB_REG2_GPIO_23_I_UMSK (~(((1U << GLB_REG2_GPIO_23_I_LEN) - 1) << GLB_REG2_GPIO_23_I_POS))
#define GLB_REG2_GPIO_24_I      GLB_REG2_GPIO_24_I
#define GLB_REG2_GPIO_24_I_POS  (24U)
#define GLB_REG2_GPIO_24_I_LEN  (1U)
#define GLB_REG2_GPIO_24_I_MSK  (((1U << GLB_REG2_GPIO_24_I_LEN) - 1) << GLB_REG2_GPIO_24_I_POS)
#define GLB_REG2_GPIO_24_I_UMSK (~(((1U << GLB_REG2_GPIO_24_I_LEN) - 1) << GLB_REG2_GPIO_24_I_POS))
#define GLB_REG2_GPIO_25_I      GLB_REG2_GPIO_25_I
#define GLB_REG2_GPIO_25_I_POS  (25U)
#define GLB_REG2_GPIO_25_I_LEN  (1U)
#define GLB_REG2_GPIO_25_I_MSK  (((1U << GLB_REG2_GPIO_25_I_LEN) - 1) << GLB_REG2_GPIO_25_I_POS)
#define GLB_REG2_GPIO_25_I_UMSK (~(((1U << GLB_REG2_GPIO_25_I_LEN) - 1) << GLB_REG2_GPIO_25_I_POS))
#define GLB_REG2_GPIO_26_I      GLB_REG2_GPIO_26_I
#define GLB_REG2_GPIO_26_I_POS  (26U)
#define GLB_REG2_GPIO_26_I_LEN  (1U)
#define GLB_REG2_GPIO_26_I_MSK  (((1U << GLB_REG2_GPIO_26_I_LEN) - 1) << GLB_REG2_GPIO_26_I_POS)
#define GLB_REG2_GPIO_26_I_UMSK (~(((1U << GLB_REG2_GPIO_26_I_LEN) - 1) << GLB_REG2_GPIO_26_I_POS))
#define GLB_REG2_GPIO_27_I      GLB_REG2_GPIO_27_I
#define GLB_REG2_GPIO_27_I_POS  (27U)
#define GLB_REG2_GPIO_27_I_LEN  (1U)
#define GLB_REG2_GPIO_27_I_MSK  (((1U << GLB_REG2_GPIO_27_I_LEN) - 1) << GLB_REG2_GPIO_27_I_POS)
#define GLB_REG2_GPIO_27_I_UMSK (~(((1U << GLB_REG2_GPIO_27_I_LEN) - 1) << GLB_REG2_GPIO_27_I_POS))
#define GLB_REG2_GPIO_28_I      GLB_REG2_GPIO_28_I
#define GLB_REG2_GPIO_28_I_POS  (28U)
#define GLB_REG2_GPIO_28_I_LEN  (1U)
#define GLB_REG2_GPIO_28_I_MSK  (((1U << GLB_REG2_GPIO_28_I_LEN) - 1) << GLB_REG2_GPIO_28_I_POS)
#define GLB_REG2_GPIO_28_I_UMSK (~(((1U << GLB_REG2_GPIO_28_I_LEN) - 1) << GLB_REG2_GPIO_28_I_POS))
#define GLB_REG2_GPIO_29_I      GLB_REG2_GPIO_29_I
#define GLB_REG2_GPIO_29_I_POS  (29U)
#define GLB_REG2_GPIO_29_I_LEN  (1U)
#define GLB_REG2_GPIO_29_I_MSK  (((1U << GLB_REG2_GPIO_29_I_LEN) - 1) << GLB_REG2_GPIO_29_I_POS)
#define GLB_REG2_GPIO_29_I_UMSK (~(((1U << GLB_REG2_GPIO_29_I_LEN) - 1) << GLB_REG2_GPIO_29_I_POS))
#define GLB_REG2_GPIO_30_I      GLB_REG2_GPIO_30_I
#define GLB_REG2_GPIO_30_I_POS  (30U)
#define GLB_REG2_GPIO_30_I_LEN  (1U)
#define GLB_REG2_GPIO_30_I_MSK  (((1U << GLB_REG2_GPIO_30_I_LEN) - 1) << GLB_REG2_GPIO_30_I_POS)
#define GLB_REG2_GPIO_30_I_UMSK (~(((1U << GLB_REG2_GPIO_30_I_LEN) - 1) << GLB_REG2_GPIO_30_I_POS))
#define GLB_REG2_GPIO_31_I      GLB_REG2_GPIO_31_I
#define GLB_REG2_GPIO_31_I_POS  (31U)
#define GLB_REG2_GPIO_31_I_LEN  (1U)
#define GLB_REG2_GPIO_31_I_MSK  (((1U << GLB_REG2_GPIO_31_I_LEN) - 1) << GLB_REG2_GPIO_31_I_POS)
#define GLB_REG2_GPIO_31_I_UMSK (~(((1U << GLB_REG2_GPIO_31_I_LEN) - 1) << GLB_REG2_GPIO_31_I_POS))

