XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/glb_reg.h
/* 0xB00 : gpio_cfg143 */
#define GLB_GPIO_CFG143_OFFSET             (0xB00)
#define GLB_CR_GPIO_DMA_TX_EN              GLB_CR_GPIO_DMA_TX_EN
#define GLB_CR_GPIO_DMA_TX_EN_POS          (0U)
#define GLB_CR_GPIO_DMA_TX_EN_LEN          (1U)
#define GLB_CR_GPIO_DMA_TX_EN_MSK          (((1U << GLB_CR_GPIO_DMA_TX_EN_LEN) - 1) << GLB_CR_GPIO_DMA_TX_EN_POS)
#define GLB_CR_GPIO_DMA_TX_EN_UMSK         (~(((1U << GLB_CR_GPIO_DMA_TX_EN_LEN) - 1) << GLB_CR_GPIO_DMA_TX_EN_POS))
#define GLB_CR_GPIO_DMA_OUT_SEL_LATCH      GLB_CR_GPIO_DMA_OUT_SEL_LATCH
#define GLB_CR_GPIO_DMA_OUT_SEL_LATCH_POS  (1U)
#define GLB_CR_GPIO_DMA_OUT_SEL_LATCH_LEN  (1U)
#define GLB_CR_GPIO_DMA_OUT_SEL_LATCH_MSK  (((1U << GLB_CR_GPIO_DMA_OUT_SEL_LATCH_LEN) - 1) << GLB_CR_GPIO_DMA_OUT_SEL_LATCH_POS)
#define GLB_CR_GPIO_DMA_OUT_SEL_LATCH_UMSK (~(((1U << GLB_CR_GPIO_DMA_OUT_SEL_LATCH_LEN) - 1) << GLB_CR_GPIO_DMA_OUT_SEL_LATCH_POS))
#define GLB_GPIO_TX_FIFO_CLR               GLB_GPIO_TX_FIFO_CLR
#define GLB_GPIO_TX_FIFO_CLR_POS           (2U)
#define GLB_GPIO_TX_FIFO_CLR_LEN           (1U)
#define GLB_GPIO_TX_FIFO_CLR_MSK           (((1U << GLB_GPIO_TX_FIFO_CLR_LEN) - 1) << GLB_GPIO_TX_FIFO_CLR_POS)
#define GLB_GPIO_TX_FIFO_CLR_UMSK          (~(((1U << GLB_GPIO_TX_FIFO_CLR_LEN) - 1) << GLB_GPIO_TX_FIFO_CLR_POS))
#define GLB_GPIO_TX_END_CLR                GLB_GPIO_TX_END_CLR
#define GLB_GPIO_TX_END_CLR_POS            (3U)
#define GLB_GPIO_TX_END_CLR_LEN            (1U)
#define GLB_GPIO_TX_END_CLR_MSK            (((1U << GLB_GPIO_TX_END_CLR_LEN) - 1) << GLB_GPIO_TX_END_CLR_POS)
#define GLB_GPIO_TX_END_CLR_UMSK           (~(((1U << GLB_GPIO_TX_END_CLR_LEN) - 1) << GLB_GPIO_TX_END_CLR_POS))
#define GLB_GPIO_TX_FIFO_OVERFLOW          GLB_GPIO_TX_FIFO_OVERFLOW
#define GLB_GPIO_TX_FIFO_OVERFLOW_POS      (4U)
#define GLB_GPIO_TX_FIFO_OVERFLOW_LEN      (1U)
#define GLB_GPIO_TX_FIFO_OVERFLOW_MSK      (((1U << GLB_GPIO_TX_FIFO_OVERFLOW_LEN) - 1) << GLB_GPIO_TX_FIFO_OVERFLOW_POS)
#define GLB_GPIO_TX_FIFO_OVERFLOW_UMSK     (~(((1U << GLB_GPIO_TX_FIFO_OVERFLOW_LEN) - 1) << GLB_GPIO_TX_FIFO_OVERFLOW_POS))
#define GLB_GPIO_TX_FIFO_UNDERFLOW         GLB_GPIO_TX_FIFO_UNDERFLOW
#define GLB_GPIO_TX_FIFO_UNDERFLOW_POS     (5U)
#define GLB_GPIO_TX_FIFO_UNDERFLOW_LEN     (1U)
#define GLB_GPIO_TX_FIFO_UNDERFLOW_MSK     (((1U << GLB_GPIO_TX_FIFO_UNDERFLOW_LEN) - 1) << GLB_GPIO_TX_FIFO_UNDERFLOW_POS)
#define GLB_GPIO_TX_FIFO_UNDERFLOW_UMSK    (~(((1U << GLB_GPIO_TX_FIFO_UNDERFLOW_LEN) - 1) << GLB_GPIO_TX_FIFO_UNDERFLOW_POS))
#define GLB_CR_GPIO_DMA_PARK_VALUE         GLB_CR_GPIO_DMA_PARK_VALUE
#define GLB_CR_GPIO_DMA_PARK_VALUE_POS     (7U)
#define GLB_CR_GPIO_DMA_PARK_VALUE_LEN     (1U)
#define GLB_CR_GPIO_DMA_PARK_VALUE_MSK     (((1U << GLB_CR_GPIO_DMA_PARK_VALUE_LEN) - 1) << GLB_CR_GPIO_DMA_PARK_VALUE_POS)
#define GLB_CR_GPIO_DMA_PARK_VALUE_UMSK    (~(((1U << GLB_CR_GPIO_DMA_PARK_VALUE_LEN) - 1) << GLB_CR_GPIO_DMA_PARK_VALUE_POS))
#define GLB_GPIO_TX_FIFO_CNT               GLB_GPIO_TX_FIFO_CNT
#define GLB_GPIO_TX_FIFO_CNT_POS           (8U)
#define GLB_GPIO_TX_FIFO_CNT_LEN           (8U)
#define GLB_GPIO_TX_FIFO_CNT_MSK           (((1U << GLB_GPIO_TX_FIFO_CNT_LEN) - 1) << GLB_GPIO_TX_FIFO_CNT_POS)
#define GLB_GPIO_TX_FIFO_CNT_UMSK          (~(((1U << GLB_GPIO_TX_FIFO_CNT_LEN) - 1) << GLB_GPIO_TX_FIFO_CNT_POS))
#define GLB_CR_GPIO_TX_FIFO_TH             GLB_CR_GPIO_TX_FIFO_TH
#define GLB_CR_GPIO_TX_FIFO_TH_POS         (16U)
#define GLB_CR_GPIO_TX_FIFO_TH_LEN         (7U)
#define GLB_CR_GPIO_TX_FIFO_TH_MSK         (((1U << GLB_CR_GPIO_TX_FIFO_TH_LEN) - 1) << GLB_CR_GPIO_TX_FIFO_TH_POS)
#define GLB_CR_GPIO_TX_FIFO_TH_UMSK        (~(((1U << GLB_CR_GPIO_TX_FIFO_TH_LEN) - 1) << GLB_CR_GPIO_TX_FIFO_TH_POS))
#define GLB_CR_GPIO_TX_END_MASK            GLB_CR_GPIO_TX_END_MASK
#define GLB_CR_GPIO_TX_END_MASK_POS        (23U)
#define GLB_CR_GPIO_TX_END_MASK_LEN        (1U)
#define GLB_CR_GPIO_TX_END_MASK_MSK        (((1U << GLB_CR_GPIO_TX_END_MASK_LEN) - 1) << GLB_CR_GPIO_TX_END_MASK_POS)
#define GLB_CR_GPIO_TX_END_MASK_UMSK       (~(((1U << GLB_CR_GPIO_TX_END_MASK_LEN) - 1) << GLB_CR_GPIO_TX_END_MASK_POS))
#define GLB_CR_GPIO_TX_FIFO_MASK           GLB_CR_GPIO_TX_FIFO_MASK
#define GLB_CR_GPIO_TX_FIFO_MASK_POS       (24U)
#define GLB_CR_GPIO_TX_FIFO_MASK_LEN       (1U)
#define GLB_CR_GPIO_TX_FIFO_MASK_MSK       (((1U << GLB_CR_GPIO_TX_FIFO_MASK_LEN) - 1) << GLB_CR_GPIO_TX_FIFO_MASK_POS)
#define GLB_CR_GPIO_TX_FIFO_MASK_UMSK      (~(((1U << GLB_CR_GPIO_TX_FIFO_MASK_LEN) - 1) << GLB_CR_GPIO_TX_FIFO_MASK_POS))
#define GLB_CR_GPIO_TX_FER_MASK            GLB_CR_GPIO_TX_FER_MASK
#define GLB_CR_GPIO_TX_FER_MASK_POS        (25U)
#define GLB_CR_GPIO_TX_FER_MASK_LEN        (1U)
#define GLB_CR_GPIO_TX_FER_MASK_MSK        (((1U << GLB_CR_GPIO_TX_FER_MASK_LEN) - 1) << GLB_CR_GPIO_TX_FER_MASK_POS)
#define GLB_CR_GPIO_TX_FER_MASK_UMSK       (~(((1U << GLB_CR_GPIO_TX_FER_MASK_LEN) - 1) << GLB_CR_GPIO_TX_FER_MASK_POS))
#define GLB_R_GPIO_TX_END_INT              GLB_R_GPIO_TX_END_INT
#define GLB_R_GPIO_TX_END_INT_POS          (26U)
#define GLB_R_GPIO_TX_END_INT_LEN          (1U)
#define GLB_R_GPIO_TX_END_INT_MSK          (((1U << GLB_R_GPIO_TX_END_INT_LEN) - 1) << GLB_R_GPIO_TX_END_INT_POS)
#define GLB_R_GPIO_TX_END_INT_UMSK         (~(((1U << GLB_R_GPIO_TX_END_INT_LEN) - 1) << GLB_R_GPIO_TX_END_INT_POS))
#define GLB_R_GPIO_TX_FIFO_INT             GLB_R_GPIO_TX_FIFO_INT
#define GLB_R_GPIO_TX_FIFO_INT_POS         (27U)
#define GLB_R_GPIO_TX_FIFO_INT_LEN         (1U)
#define GLB_R_GPIO_TX_FIFO_INT_MSK         (((1U << GLB_R_GPIO_TX_FIFO_INT_LEN) - 1) << GLB_R_GPIO_TX_FIFO_INT_POS)
#define GLB_R_GPIO_TX_FIFO_INT_UMSK        (~(((1U << GLB_R_GPIO_TX_FIFO_INT_LEN) - 1) << GLB_R_GPIO_TX_FIFO_INT_POS))
#define GLB_R_GPIO_TX_FER_INT              GLB_R_GPIO_TX_FER_INT
#define GLB_R_GPIO_TX_FER_INT_POS          (28U)
#define GLB_R_GPIO_TX_FER_INT_LEN          (1U)
#define GLB_R_GPIO_TX_FER_INT_MSK          (((1U << GLB_R_GPIO_TX_FER_INT_LEN) - 1) << GLB_R_GPIO_TX_FER_INT_POS)
#define GLB_R_GPIO_TX_FER_INT_UMSK         (~(((1U << GLB_R_GPIO_TX_FER_INT_LEN) - 1) << GLB_R_GPIO_TX_FER_INT_POS))
#define GLB_CR_GPIO_TX_END_EN              GLB_CR_GPIO_TX_END_EN
#define GLB_CR_GPIO_TX_END_EN_POS          (29U)
#define GLB_CR_GPIO_TX_END_EN_LEN          (1U)
#define GLB_CR_GPIO_TX_END_EN_MSK          (((1U << GLB_CR_GPIO_TX_END_EN_LEN) - 1) << GLB_CR_GPIO_TX_END_EN_POS)
#define GLB_CR_GPIO_TX_END_EN_UMSK         (~(((1U << GLB_CR_GPIO_TX_END_EN_LEN) - 1) << GLB_CR_GPIO_TX_END_EN_POS))
#define GLB_CR_GPIO_TX_FIFO_EN             GLB_CR_GPIO_TX_FIFO_EN
#define GLB_CR_GPIO_TX_FIFO_EN_POS         (30U)
#define GLB_CR_GPIO_TX_FIFO_EN_LEN         (1U)
#define GLB_CR_GPIO_TX_FIFO_EN_MSK         (((1U << GLB_CR_GPIO_TX_FIFO_EN_LEN) - 1) << GLB_CR_GPIO_TX_FIFO_EN_POS)
#define GLB_CR_GPIO_TX_FIFO_EN_UMSK        (~(((1U << GLB_CR_GPIO_TX_FIFO_EN_LEN) - 1) << GLB_CR_GPIO_TX_FIFO_EN_POS))
#define GLB_CR_GPIO_TX_FER_EN              GLB_CR_GPIO_TX_FER_EN
#define GLB_CR_GPIO_TX_FER_EN_POS          (31U)
#define GLB_CR_GPIO_TX_FER_EN_LEN          (1U)
#define GLB_CR_GPIO_TX_FER_EN_MSK          (((1U << GLB_CR_GPIO_TX_FER_EN_LEN) - 1) << GLB_CR_GPIO_TX_FER_EN_POS)
#define GLB_CR_GPIO_TX_FER_EN_UMSK         (~(((1U << GLB_CR_GPIO_TX_FER_EN_LEN) - 1) << GLB_CR_GPIO_TX_FER_EN_POS))

/* 0xB04 : gpio_cfg144 */
#define GLB_GPIO_CFG144_OFFSET        (0xB04)
#define GLB_GPIO_TX_DATA_TO_FIFO      GLB_GPIO_TX_DATA_TO_FIFO
#define GLB_GPIO_TX_DATA_TO_FIFO_POS  (0U)
#define GLB_GPIO_TX_DATA_TO_FIFO_LEN  (16U)
#define GLB_GPIO_TX_DATA_TO_FIFO_MSK  (((1U << GLB_GPIO_TX_DATA_TO_FIFO_LEN) - 1) << GLB_GPIO_TX_DATA_TO_FIFO_POS)
#define GLB_GPIO_TX_DATA_TO_FIFO_UMSK (~(((1U << GLB_GPIO_TX_DATA_TO_FIFO_LEN) - 1) << GLB_GPIO_TX_DATA_TO_FIFO_POS))

struct glb_reg {
    /* 0x0 : soc_info0 */
    union {
        struct {
            uint32_t reserved_0_26 : 27; /* [26: 0],       rsvd,        0x0 */
            uint32_t chip_rdy      : 1;  /* [   27],          r,        0x0 */
            uint32_t glb_id        : 4;  /* [31:28],          r,        0x6 */
        } BF;
        uint32_t WORD;
    } soc_info0;

    /* 0x4  reserved */
    uint8_t RESERVED0x4[76];

    /* 0x50 : core_cfg16 */
    union {
        struct {
            uint32_t np_int_sta0 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } core_cfg16;

    /* 0x54 : core_cfg17 */
    union {
        struct {
            uint32_t np_int_sta1 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } core_cfg17;

    /* 0x58 : core_cfg18 */
    union {
        struct {
            uint32_t np_int_mask0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } core_cfg18;

    /* 0x5C : core_cfg19 */
    union {
        struct {
            uint32_t np_int_mask1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } core_cfg19;

    /* 0x60 : core_cfg20 */
    union {
        struct {
            uint32_t np_int_clr0 : 32; /* [31: 0],        w1c,        0x0 */
        } BF;
        uint32_t WORD;
    } core_cfg20;

    /* 0x64 : core_cfg21 */
    union {
        struct {
            uint32_t np_int_clr1 : 32; /* [31: 0],        w1c,        0x0 */
        } BF;
        uint32_t WORD;
    } core_cfg21;

