XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/glb_reg.h
    /* 0x68 : core_cfg22 */
    union {
        struct {
            uint32_t reg_e902_int_en0 : 32; /* [31: 0],        r/w, 0xffffffff */
        } BF;
        uint32_t WORD;
    } core_cfg22;

    /* 0x6C : core_cfg23 */
    union {
        struct {
            uint32_t reg_e902_int_en1 : 32; /* [31: 0],        r/w, 0xffffffff */
        } BF;
        uint32_t WORD;
    } core_cfg23;

    /* 0x70 : core_cfg24 */
    union {
        struct {
            uint32_t sts_e902_int_bus_0 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } core_cfg24;

    /* 0x74 : core_cfg25 */
    union {
        struct {
            uint32_t sts_e902_int_bus_1 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } core_cfg25;

    /* 0x78  reserved */
    uint8_t RESERVED0x78[24];

    /* 0x90 : sys_cfg0 */
    union {
        struct {
            uint32_t reg_pll_en       : 1; /* [    0],        r/w,        0x1 */
            uint32_t reg_fclk_en      : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_hclk_en      : 1; /* [    2],        r/w,        0x1 */
            uint32_t reg_bclk_en      : 1; /* [    3],        r/w,        0x1 */
            uint32_t reserved_4_5     : 2; /* [ 5: 4],       rsvd,        0x0 */
            uint32_t hbn_root_clk_sel : 2; /* [ 7: 6],          r,        0x0 */
            uint32_t reg_hclk_div     : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_bclk_div     : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reserved_24_31   : 8; /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sys_cfg0;

    /* 0x94 : sys_cfg1 */
    union {
        struct {
            uint32_t reg_bclk_div_act_pulse     : 1; /* [    0],        w1p,        0x0 */
            uint32_t reg_bclk_div_bypass        : 1; /* [    1],        r/w,        0x0 */
            uint32_t sts_bclk_prot_done         : 1; /* [    2],          r,        0x1 */
            uint32_t reserved_3                 : 1; /* [    3],       rsvd,        0x0 */
            uint32_t reg_bclk_sw_done_cnt       : 4; /* [ 7: 4],        r/w,        0x5 */
            uint32_t reserved_8_15              : 8; /* [15: 8],       rsvd,        0x0 */
            uint32_t reg_pico_clk_div_act_pulse : 1; /* [   16],        w1p,        0x0 */
            uint32_t reg_pico_clk_div_bypass    : 1; /* [   17],        r/w,        0x0 */
            uint32_t sts_pico_clk_prot_done     : 1; /* [   18],          r,        0x1 */
            uint32_t reserved_19                : 1; /* [   19],       rsvd,        0x0 */
            uint32_t reg_pico_clk_sw_done_cnt   : 4; /* [23:20],        r/w,        0x5 */
            uint32_t fclk_sw_state              : 3; /* [26:24],          r,        0x0 */
            uint32_t reserved_27_31             : 5; /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sys_cfg1;

    /* 0x98  reserved */
    uint8_t RESERVED0x98[8];

    /* 0xA0 : bus_cfg0 */
    union {
        struct {
            uint32_t rg_apb2_pck_force : 16; /* [15: 0],        r/w,     0xffff */
            uint32_t reserved_16_31    : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } bus_cfg0;

    /* 0xa4  reserved */
    uint8_t RESERVED0xa4[60];

    /* 0xE0 : emi_cfg0 */
    union {
        struct {
            uint32_t reserved_0_8    : 9; /* [ 8: 0],       rsvd,        0x0 */
            uint32_t reg_emi_clk_en  : 1; /* [    9],        r/w,        0x1 */
            uint32_t reserved_10_13  : 4; /* [13:10],       rsvd,        0x0 */
            uint32_t reg_emi_clk_sel : 3; /* [16:14],        r/w,        0x0 */
            uint32_t reserved_17_21  : 5; /* [21:17],       rsvd,        0x0 */
            uint32_t reg_emi_clk_div : 2; /* [23:22],        r/w,        0x0 */
            uint32_t reserved_24_31  : 8; /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } emi_cfg0;

    /* 0xe4  reserved */
    uint8_t RESERVED0xe4[12];

    /* 0xF0 : rtc_cfg0 */
    union {
        struct {
            uint32_t cpu_rtc_div    : 17; /* [16: 0],        r/w,       0x10 */
            uint32_t reserved_17    : 1;  /* [   17],       rsvd,        0x0 */
            uint32_t cpu_rtc_en     : 1;  /* [   18],        r/w,        0x0 */
            uint32_t cpu_rtc_sel    : 1;  /* [   19],        r/w,        0x1 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rtc_cfg0;

    /* 0xf4  reserved */
    uint8_t RESERVED0xf4[28];

    /* 0x110 : adc_cfg0 */
    union {
        struct {
            uint32_t gpadc_32m_clk_div : 6;  /* [ 5: 0],        r/w,        0x2 */
            uint32_t reserved_6        : 1;  /* [    6],       rsvd,        0x0 */
            uint32_t gpadc_32m_clk_sel : 1;  /* [    7],        r/w,        0x0 */
            uint32_t gpadc_32m_div_en  : 1;  /* [    8],        r/w,        0x1 */
            uint32_t reserved_9_31     : 23; /* [31: 9],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } adc_cfg0;

    /* 0x114  reserved */
    uint8_t RESERVED0x114[12];

    /* 0x120 : dac_cfg0 */
    union {
        struct {
            uint32_t gpdaca_rstn_ana : 1;  /* [    0],        r/w,        0x1 */
            uint32_t gpdacb_rstn_ana : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reserved_2_6    : 5;  /* [ 6: 2],       rsvd,        0x0 */
            uint32_t gpdac_test_en   : 1;  /* [    7],        r/w,        0x0 */
            uint32_t gpdac_ref_sel   : 1;  /* [    8],        r/w,        0x0 */
            uint32_t gpdac_test_sel  : 3;  /* [11: 9],        r/w,        0x0 */
            uint32_t reserved_12_23  : 12; /* [23:12],       rsvd,        0x0 */
            uint32_t gpdac_reserved  : 8;  /* [31:24],        r/w,        0xf */
        } BF;
        uint32_t WORD;
    } dac_cfg0;

    /* 0x124 : dac_cfg1 */
    union {
        struct {
            uint32_t gpdac_a_en     : 1;  /* [    0],        r/w,        0x0 */
            uint32_t gpdac_ioa_en   : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_17  : 16; /* [17: 2],       rsvd,        0x0 */
            uint32_t gpdac_a_rng    : 2;  /* [19:18],        r/w,        0x3 */
            uint32_t gpdac_a_outmux : 3;  /* [22:20],        r/w,        0x0 */
            uint32_t reserved_23_31 : 9;  /* [31:23],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dac_cfg1;

