XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/glb_reg.h
    /* 0x128 : dac_cfg2 */
    union {
        struct {
            uint32_t gpdac_b_en     : 1;  /* [    0],        r/w,        0x0 */
            uint32_t gpdac_iob_en   : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_17  : 16; /* [17: 2],       rsvd,        0x0 */
            uint32_t gpdac_b_rng    : 2;  /* [19:18],        r/w,        0x3 */
            uint32_t gpdac_b_outmux : 3;  /* [22:20],        r/w,        0x0 */
            uint32_t reserved_23_31 : 9;  /* [31:23],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dac_cfg2;

    /* 0x12C : dac_cfg3 */
    union {
        struct {
            uint32_t gpdac_b_data   : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t gpdac_a_data   : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dac_cfg3;

    /* 0x130 : dma_cfg0 */
    union {
        struct {
            uint32_t reserved_0_23 : 24; /* [23: 0],       rsvd,        0x0 */
            uint32_t dma_clk_en    : 8;  /* [31:24],        r/w,       0xff */
        } BF;
        uint32_t WORD;
    } dma_cfg0;

    /* 0x134 : dma_cfg1 */
    union {
        struct {
            uint32_t reserved_0_23 : 24; /* [23: 0],       rsvd,        0x0 */
            uint32_t dma2_clk_en   : 8;  /* [31:24],        r/w,       0xff */
        } BF;
        uint32_t WORD;
    } dma_cfg1;

    /* 0x138 : dma_cfg2 */
    union {
        struct {
            uint32_t reg_dma_cn_sel : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } dma_cfg2;

    /* 0x13c  reserved */
    uint8_t RESERVED0x13c[4];

    /* 0x140 : ir_cfg0 */
    union {
        struct {
            uint32_t reserved_0_15  : 16; /* [15: 0],       rsvd,        0x0 */
            uint32_t ir_clk_div     : 6;  /* [21:16],        r/w,        0xf */
            uint32_t reserved_22    : 1;  /* [   22],       rsvd,        0x0 */
            uint32_t ir_clk_en      : 1;  /* [   23],        r/w,        0x1 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ir_cfg0;

    /* 0x144 : ir_cfg1 */
    union {
        struct {
            uint32_t led_din_reg          : 1;  /* [    0],        r/w,        0x0 */
            uint32_t led_din_sel          : 1;  /* [    1],        r/w,        0x0 */
            uint32_t led_din_polarity_sel : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3           : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t leddrv_ibias         : 4;  /* [ 7: 4],        r/w,        0x8 */
            uint32_t ir_rx_gpio_sel       : 4;  /* [11: 8],        r/w,        0x0 */
            uint32_t reserved_12_30       : 19; /* [30:12],       rsvd,        0x0 */
            uint32_t pu_leddrv            : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ir_cfg1;

    /* 0x148  reserved */
    uint8_t RESERVED0x148[8];

    /* 0x150 : uart_cfg0 */
    union {
        struct {
            uint32_t uart_clk_div      : 3;  /* [ 2: 0],        r/w,        0x7 */
            uint32_t reserved_3        : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t uart_clk_en       : 1;  /* [    4],        r/w,        0x1 */
            uint32_t reserved_5_6      : 2;  /* [ 6: 5],       rsvd,        0x0 */
            uint32_t hbn_uart_clk_sel  : 1;  /* [    7],          r,        0x0 */
            uint32_t reserved_8_21     : 14; /* [21: 8],       rsvd,        0x0 */
            uint32_t hbn_uart_clk_sel2 : 1;  /* [   22],          r,        0x0 */
            uint32_t reserved_23       : 1;  /* [   23],       rsvd,        0x0 */
            uint32_t uart2_io_sel      : 1;  /* [   24],        r/w,        0x0 */
            uint32_t reserved_25_31    : 7;  /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } uart_cfg0;

    /* 0x154 : uart_cfg1 */
    union {
        struct {
            uint32_t uart_sig_0_sel : 4; /* [ 3: 0],        r/w,        0x0 */
            uint32_t uart_sig_1_sel : 4; /* [ 7: 4],        r/w,        0x1 */
            uint32_t uart_sig_2_sel : 4; /* [11: 8],        r/w,        0x2 */
            uint32_t uart_sig_3_sel : 4; /* [15:12],        r/w,        0x3 */
            uint32_t uart_sig_4_sel : 4; /* [19:16],        r/w,        0x4 */
            uint32_t uart_sig_5_sel : 4; /* [23:20],        r/w,        0x5 */
            uint32_t uart_sig_6_sel : 4; /* [27:24],        r/w,        0x6 */
            uint32_t uart_sig_7_sel : 4; /* [31:28],        r/w,        0x7 */
        } BF;
        uint32_t WORD;
    } uart_cfg1;

    /* 0x158 : uart_cfg2 */
    union {
        struct {
            uint32_t uart_sig_8_sel  : 4;  /* [ 3: 0],        r/w,        0x8 */
            uint32_t uart_sig_9_sel  : 4;  /* [ 7: 4],        r/w,        0x9 */
            uint32_t uart_sig_10_sel : 4;  /* [11: 8],        r/w,        0xa */
            uint32_t uart_sig_11_sel : 4;  /* [15:12],        r/w,        0xb */
            uint32_t reserved_16_31  : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } uart_cfg2;

    /* 0x15c  reserved */
    uint8_t RESERVED0x15c[20];

    /* 0x170 : sf_cfg0 */
    union {
        struct {
            uint32_t reserved_0_7   : 8;  /* [ 7: 0],       rsvd,        0x0 */
            uint32_t sf_clk_div     : 3;  /* [10: 8],        r/w,        0x3 */
            uint32_t sf_clk_en      : 1;  /* [   11],        r/w,        0x1 */
            uint32_t sf_clk_sel     : 2;  /* [13:12],        r/w,        0x2 */
            uint32_t sf_clk_sel2    : 2;  /* [15:14],        r/w,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_cfg0;

    /* 0x174  reserved */
    uint8_t RESERVED0x174[12];

