XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/glb_reg.h
    /* 0x180 : i2c_cfg0 */
    union {
        struct {
            uint32_t reserved_0_15  : 16; /* [15: 0],       rsvd,        0x0 */
            uint32_t i2c_clk_div    : 8;  /* [23:16],        r/w,       0xff */
            uint32_t i2c_clk_en     : 1;  /* [   24],        r/w,        0x1 */
            uint32_t i2c_clk_sel    : 1;  /* [   25],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } i2c_cfg0;

    /* 0x184  reserved */
    uint8_t RESERVED0x184[12];

    /* 0x190 : i2s_cfg0 */
    union {
        struct {
            uint32_t reg_i2s_ref_clk_div    : 6;  /* [ 5: 0],        r/w,        0x1 */
            uint32_t reg_i2s_di_ref_clk_sel : 1;  /* [    6],        r/w,        0x0 */
            uint32_t reg_i2s_ref_clk_en     : 1;  /* [    7],        r/w,        0x1 */
            uint32_t reg_i2s_do_ref_clk_sel : 1;  /* [    8],        r/w,        0x0 */
            uint32_t reserved_9_31          : 23; /* [31: 9],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } i2s_cfg0;

    /* 0x194  reserved */
    uint8_t RESERVED0x194[28];

    /* 0x1B0 : spi_cfg0 */
    union {
        struct {
            uint32_t spi_clk_div    : 5;  /* [ 4: 0],        r/w,        0x3 */
            uint32_t reserved_5_7   : 3;  /* [ 7: 5],       rsvd,        0x0 */
            uint32_t spi_clk_en     : 1;  /* [    8],        r/w,        0x1 */
            uint32_t spi_clk_sel    : 1;  /* [    9],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t spi_swap_set   : 4;  /* [19:16],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } spi_cfg0;

    /* 0x1b4  reserved */
    uint8_t RESERVED0x1b4[12];

    /* 0x1C0 : qdec_cfg0 */
    union {
        struct {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } qdec_cfg0;

    /* 0x1c4  reserved */
    uint8_t RESERVED0x1c4[12];

    /* 0x1D0 : pwm_cfg0 */
    union {
        struct {
            uint32_t reg_pwm1_io_sel : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_pwm2_io_sel : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_31   : 30; /* [31: 2],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm_cfg0;

    /* 0x1d4  reserved */
    uint8_t RESERVED0x1d4[12];

    /* 0x1E0 : pdm_cfg0 */
    union {
        struct {
            uint32_t reg_pdm_io_sel : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_31  : 31; /* [31: 1],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pdm_cfg0;

    /* 0x1e4  reserved */
    uint8_t RESERVED0x1e4[108];

    /* 0x250 : dig_clk_cfg0 */
    union {
        struct {
            uint32_t dig_32k_div            : 11; /* [10: 0],        r/w,      0x3e8 */
            uint32_t reserved_11            : 1;  /* [   11],       rsvd,        0x0 */
            uint32_t dig_32k_en             : 1;  /* [   12],        r/w,        0x1 */
            uint32_t dig_32k_comp           : 1;  /* [   13],        r/w,        0x0 */
            uint32_t reserved_14_15         : 2;  /* [15:14],       rsvd,        0x0 */
            uint32_t dig_512k_div           : 7;  /* [22:16],        r/w,       0x3e */
            uint32_t reserved_23            : 1;  /* [   23],       rsvd,        0x0 */
            uint32_t dig_512k_en            : 1;  /* [   24],        r/w,        0x1 */
            uint32_t dig_512k_comp          : 1;  /* [   25],        r/w,        0x1 */
            uint32_t reserved_26_27         : 2;  /* [27:26],       rsvd,        0x0 */
            uint32_t dig_clk_src_sel        : 2;  /* [29:28],        r/w,        0x0 */
            uint32_t reserved_30            : 1;  /* [   30],       rsvd,        0x0 */
            uint32_t reg_en_platform_wakeup : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } dig_clk_cfg0;

    /* 0x254 : dig_clk_cfg1 */
    union {
        struct {
            uint32_t reg_mm_muxpll_160m_sel  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_mm_muxpll_240m_sel  : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reg_mm_muxpll_320m_sel  : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3_7            : 5;  /* [ 7: 3],       rsvd,        0x0 */
            uint32_t reg_top_muxpll_80m_sel  : 2;  /* [ 9: 8],        r/w,        0x0 */
            uint32_t reg_top_muxpll_160m_sel : 2;  /* [11:10],        r/w,        0x0 */
            uint32_t reserved_12_31          : 20; /* [31:12],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dig_clk_cfg1;

    /* 0x258 : dig_clk_cfg2 */
    union {
        struct {
            uint32_t chip_clk_out_0_sel  : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t chip_clk_out_1_sel  : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t chip_clk_out_2_sel  : 2;  /* [ 5: 4],        r/w,        0x0 */
            uint32_t chip_clk_out_3_sel  : 2;  /* [ 7: 6],        r/w,        0x0 */
            uint32_t chip_clk_out_0_en   : 1;  /* [    8],        r/w,        0x1 */
            uint32_t chip_clk_out_1_en   : 1;  /* [    9],        r/w,        0x1 */
            uint32_t chip_clk_out_2_en   : 1;  /* [   10],        r/w,        0x1 */
            uint32_t chip_clk_out_3_en   : 1;  /* [   11],        r/w,        0x1 */
            uint32_t gpio_tmr_clk_sel    : 2;  /* [13:12],        r/w,        0x0 */
            uint32_t gpio_mm_tmr_clk_sel : 2;  /* [15:14],        r/w,        0x0 */
            uint32_t reserved_16_31      : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dig_clk_cfg2;

