XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/glb_reg.h
    /* 0x25C : dig_clk_cfg3 */
    union {
        struct {
            uint32_t dsi_txclkesc_sel : 1;  /* [    0],        r/w,        0x0 */
            uint32_t csi_txclkesc_sel : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_31    : 30; /* [31: 2],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dig_clk_cfg3;

    /* 0x260 : rf_cfg0 */
    union {
        struct {
            uint32_t reserved_0_8           : 9;  /* [ 8: 0],       rsvd,        0x0 */
            uint32_t cfg_inv_rf2_test_clk_o : 1;  /* [    9],        r/w,        0x1 */
            uint32_t reserved_10_31         : 22; /* [31:10],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_cfg0;

    /* 0x264  reserved */
    uint8_t RESERVED0x264[124];

    /* 0x2E0 : dbg_cfg0 */
    union {
        struct {
            uint32_t reg_dbg_ll_ctrl : 30; /* [29: 0],        r/w,        0x0 */
            uint32_t reg_dbg_ll_sel  : 2;  /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } dbg_cfg0;

    /* 0x2E4 : dbg_cfg1 */
    union {
        struct {
            uint32_t reg_dbg_lh_ctrl : 30; /* [29: 0],        r/w,        0x0 */
            uint32_t reg_dbg_lh_sel  : 2;  /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } dbg_cfg1;

    /* 0x2E8 : dbg_cfg2 */
    union {
        struct {
            uint32_t reg_dbg_hl_ctrl : 30; /* [29: 0],        r/w,        0x0 */
            uint32_t reg_dbg_hl_sel  : 2;  /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } dbg_cfg2;

    /* 0x2EC : dbg_cfg3 */
    union {
        struct {
            uint32_t reg_dbg_hh_ctrl : 30; /* [29: 0],        r/w,        0x0 */
            uint32_t reg_dbg_hh_sel  : 2;  /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } dbg_cfg3;

    /* 0x2F0 : dbg_cfg4 */
    union {
        struct {
            uint32_t debug_oe : 1;  /* [    0],        r/w,        0x0 */
            uint32_t debug_i  : 31; /* [31: 1],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } dbg_cfg4;

    /* 0x2f4  reserved */
    uint8_t RESERVED0x2f4[12];

    /* 0x300 : mbist_cfg0 */
    union {
        struct {
            uint32_t mbist_mode    : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_31 : 31; /* [31: 1],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mbist_cfg0;

    /* 0x304  reserved */
    uint8_t RESERVED0x304[28];

    /* 0x320 : bmx_cfg0 */
    union {
        struct {
            uint32_t reg_bmx_timeout_en  : 5; /* [ 4: 0],        r/w,        0x0 */
            uint32_t reg_bmx_arb_mode    : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_bmx_timeout_clr : 1; /* [    6],        r/w,        0x0 */
            uint32_t reg_h_wthre_hw2ext  : 2; /* [ 8: 7],        r/w,        0x0 */
            uint32_t bmx_busy_option_dis : 1; /* [    9],        r/w,        0x0 */
            uint32_t bmx_gating_dis      : 1; /* [   10],        r/w,        0x0 */
            uint32_t sts_bmx_timeout_sts : 5; /* [15:11],          r,        0x0 */
            uint32_t pds_apb_cfg         : 8; /* [23:16],        r/w,        0x0 */
            uint32_t hbn_apb_cfg         : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } bmx_cfg0;

    /* 0x324 : bmx_cfg1 */
    union {
        struct {
            uint32_t reg_bmx_berr_int_en : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_mcu_berr_int_en : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_15       : 14; /* [15: 2],       rsvd,        0x0 */
            uint32_t reg_bmx_qos_cpu     : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reg_bmx_qos_sdu     : 1;  /* [   17],        r/w,        0x0 */
            uint32_t reg_bmx_qos_sec0    : 1;  /* [   18],        r/w,        0x0 */
            uint32_t reg_bmx_qos_sec1    : 1;  /* [   19],        r/w,        0x0 */
            uint32_t reg_bmx_qos_sec2    : 1;  /* [   20],        r/w,        0x0 */
            uint32_t reg_bmx_qos_dma     : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reg_bmx_qos_cci     : 1;  /* [   22],        r/w,        0x0 */
            uint32_t reg_bmx_qos_pldma   : 1;  /* [   23],        r/w,        0x0 */
            uint32_t reg_bmx_qos_blem    : 1;  /* [   24],        r/w,        0x0 */
            uint32_t reg_bmx_qos_emacA   : 1;  /* [   25],        r/w,        0x0 */
            uint32_t reg_bmx_qos_dma2    : 1;  /* [   26],        r/w,        0x0 */
            uint32_t reg_bmx_qos_sdhm    : 1;  /* [   27],        r/w,        0x0 */
            uint32_t bmx_dbg_sel         : 4;  /* [31:28],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } bmx_cfg1;

    /* 0x328 : bmx_cfg2 */
    union {
        struct {
            uint32_t reg_bmx_berr_en : 14; /* [13: 0],        r/w,     0x3fff */
            uint32_t reserved_14_15  : 2;  /* [15:14],       rsvd,        0x0 */
            uint32_t reg_mcu_berr_en : 1;  /* [   16],        r/w,        0x1 */
            uint32_t reserved_17_31  : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } bmx_cfg2;

    /* 0x32C : bmx_cfg3 */
    union {
        struct {
            uint32_t reg_bmx_berr_clr   : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_bmx_berr_last  : 1; /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_7       : 6; /* [ 7: 2],       rsvd,        0x0 */
            uint32_t reg_mcu_berr_clr   : 1; /* [    8],        r/w,        0x0 */
            uint32_t reg_mcu_berr_last  : 1; /* [    9],        r/w,        0x0 */
            uint32_t reserved_10_15     : 6; /* [15:10],       rsvd,        0x0 */
            uint32_t sts_bmx_berr       : 1; /* [   16],          r,        0x0 */
            uint32_t sts_mcu_berr       : 1; /* [   17],          r,        0x0 */
            uint32_t reserved_18_23     : 6; /* [23:18],       rsvd,        0x0 */
            uint32_t sts_bmx_berr_write : 1; /* [   24],          r,        0x0 */
            uint32_t sts_mcu_berr_write : 1; /* [   25],          r,        0x0 */
            uint32_t reserved_26_31     : 6; /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } bmx_cfg3;

