XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/glb_reg.h
    /* 0x330 : bmx_cfg4 */
    union {
        struct {
            uint32_t sts_bmx_berr_src : 14; /* [13: 0],          r,        0x0 */
            uint32_t reserved_14_15   : 2;  /* [15:14],       rsvd,        0x0 */
            uint32_t sts_mcu_berr_src : 1;  /* [   16],          r,        0x0 */
            uint32_t reserved_17_23   : 7;  /* [23:17],       rsvd,        0x0 */
            uint32_t sts_mcu_berr_id  : 8;  /* [31:24],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } bmx_cfg4;

    /* 0x334 : bmx_cfg5 */
    union {
        struct {
            uint32_t sts_bmx_berr_addr : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } bmx_cfg5;

    /* 0x338 : bmx_cfg6 */
    union {
        struct {
            uint32_t sts_mcu_berr_addr : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } bmx_cfg6;

    /* 0x33c  reserved */
    uint8_t RESERVED0x33c[4];

    /* 0x340 : audio_cfg0 */
    union {
        struct {
            uint32_t reg_audio_pdm_clk_div : 6; /* [ 5: 0],        r/w,        0x3 */
            uint32_t reserved_6            : 1; /* [    6],       rsvd,        0x0 */
            uint32_t reg_audio_pdm_clk_en  : 1; /* [    7],        r/w,        0x1 */
            uint32_t reg_audio_adc_clk_div : 6; /* [13: 8],        r/w,        0x3 */
            uint32_t reserved_14           : 1; /* [   14],       rsvd,        0x0 */
            uint32_t reg_audio_adc_clk_en  : 1; /* [   15],        r/w,        0x1 */
            uint32_t reg_audio_dac_clk_div : 6; /* [21:16],        r/w,        0x3 */
            uint32_t reserved_22           : 1; /* [   22],       rsvd,        0x0 */
            uint32_t reg_audio_dac_clk_en  : 1; /* [   23],        r/w,        0x1 */
            uint32_t reserved_24_30        : 7; /* [30:24],       rsvd,        0x0 */
            uint32_t reg_audio_auto_div_en : 1; /* [   31],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } audio_cfg0;

    /* 0x344 : audio_cfg1 */
    union {
        struct {
            uint32_t reg_padc_clk_div : 10; /* [ 9: 0],        r/w,       0x60 */
            uint32_t reg_padc_clk_en  : 1;  /* [   10],        r/w,        0x1 */
            uint32_t reserved_11_31   : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } audio_cfg1;

    /* 0x348  reserved */
    uint8_t RESERVED0x348[72];

    /* 0x390 : eth_cfg0 */
    union {
        struct {
            uint32_t reserved_0_4          : 5;  /* [ 4: 0],       rsvd,        0x0 */
            uint32_t cfg_sel_eth_ref_clk_o : 1;  /* [    5],        r/w,        0x0 */
            uint32_t cfg_inv_eth_ref_clk_o : 1;  /* [    6],        r/w,        0x1 */
            uint32_t cfg_inv_eth_tx_clk    : 1;  /* [    7],        r/w,        0x1 */
            uint32_t reserved_8_9          : 2;  /* [ 9: 8],       rsvd,        0x0 */
            uint32_t cfg_inv_eth_rx_clk    : 1;  /* [   10],        r/w,        0x1 */
            uint32_t reserved_11_31        : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } eth_cfg0;

    /* 0x394  reserved */
    uint8_t RESERVED0x394[140];

    /* 0x420 : cam_cfg0 */
    union {
        struct {
            uint32_t reserved_0_26           : 27; /* [26: 0],       rsvd,        0x0 */
            uint32_t reg_cam_ref_clk_en      : 1;  /* [   27],        r/w,        0x0 */
            uint32_t reg_cam_ref_clk_src_sel : 2;  /* [29:28],        r/w,        0x0 */
            uint32_t reg_cam_ref_clk_div     : 2;  /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } cam_cfg0;

    /* 0x424  reserved */
    uint8_t RESERVED0x424[12];

    /* 0x430 : sdh_cfg0 */
    union {
        struct {
            uint32_t reserved_0_8    : 9;  /* [ 8: 0],       rsvd,        0x0 */
            uint32_t reg_sdh_clk_div : 3;  /* [11: 9],        r/w,        0x0 */
            uint32_t reg_sdh_clk_sel : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reg_sdh_clk_en  : 1;  /* [   13],        r/w,        0x1 */
            uint32_t reserved_14_31  : 18; /* [31:14],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sdh_cfg0;

    /* 0x434  reserved */
    uint8_t RESERVED0x434[92];

    /* 0x490 : tzc_cfg0 */
    union {
        struct {
            uint32_t reserved_0_11           : 12; /* [11: 0],       rsvd,        0x0 */
            uint32_t tzc_glb_pwron_rst_lock  : 1;  /* [   12],          r,        0x0 */
            uint32_t tzc_glb_cpu_reset_lock  : 1;  /* [   13],          r,        0x0 */
            uint32_t tzc_glb_sys_reset_lock  : 1;  /* [   14],          r,        0x0 */
            uint32_t tzc_glb_cpu2_reset_lock : 1;  /* [   15],          r,        0x0 */
            uint32_t reserved_16_20          : 5;  /* [20:16],       rsvd,        0x0 */
            uint32_t tzc_glb_pwr_lock        : 1;  /* [   21],          r,        0x0 */
            uint32_t tzc_glb_int_lock        : 1;  /* [   22],          r,        0x0 */
            uint32_t reserved_23             : 1;  /* [   23],       rsvd,        0x0 */
            uint32_t tzc_glb_cpupll_lock     : 1;  /* [   24],          r,        0x0 */
            uint32_t tzc_glb_misc_lock       : 1;  /* [   25],          r,        0x0 */
            uint32_t tzc_glb_sram_lock       : 1;  /* [   26],          r,        0x0 */
            uint32_t tzc_glb_swrst_lock      : 1;  /* [   27],          r,        0x0 */
            uint32_t tzc_glb_bmx_lock        : 1;  /* [   28],          r,        0x0 */
            uint32_t tzc_glb_dbg_lock        : 1;  /* [   29],          r,        0x0 */
            uint32_t tzc_glb_mbist_lock      : 1;  /* [   30],          r,        0x0 */
            uint32_t tzc_glb_clk_lock        : 1;  /* [   31],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_cfg0;

    /* 0x494  reserved */
    uint8_t RESERVED0x494[124];

    /* 0x510 : glb_parm_cfg0 */
    union {
        struct {
            uint32_t reg_bd_en              : 1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1             : 1; /* [    1],       rsvd,        0x0 */
            uint32_t uart_swap_set          : 4; /* [ 5: 2],        r/w,        0x0 */
            uint32_t reserved_6_7           : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t swap_sflash_io_3_io_0  : 1; /* [    8],        r/w,        0x1 */
            uint32_t sel_embedded_sflash    : 1; /* [    9],        r/w,        0x1 */
            uint32_t reserved_10            : 1; /* [   10],       rsvd,        0x0 */
            uint32_t reg_sel_psram0_x16     : 1; /* [   11],        r/w,        0x1 */
            uint32_t reg_spi_0_master_mode  : 1; /* [   12],        r/w,        0x0 */
            uint32_t reg_spi_0_swap         : 1; /* [   13],        r/w,        0x0 */
            uint32_t reg_sel_dbi_type_c     : 1; /* [   14],        r/w,        0x0 */
            uint32_t ant_switch_sel         : 1; /* [   15],        r/w,        0x0 */
            uint32_t reserved_16            : 1; /* [   16],       rsvd,        0x0 */
            uint32_t p1_adc_test_with_cci   : 1; /* [   17],        r/w,        0x0 */
            uint32_t p2_dac_test_with_cci   : 1; /* [   18],        r/w,        0x0 */
            uint32_t p3_cci_use_io_2_5      : 1; /* [   19],        r/w,        0x0 */
            uint32_t p4_adc_test_with_jtag  : 1; /* [   20],        r/w,        0x0 */
            uint32_t p5_dac_test_with_jtag  : 1; /* [   21],        r/w,        0x0 */
            uint32_t p6_sdh_use_io_0_5      : 1; /* [   22],        r/w,        0x0 */
            uint32_t p7_jtag_use_io_2_5     : 1; /* [   23],        r/w,        0x0 */
            uint32_t reserved_24            : 1; /* [   24],       rsvd,        0x0 */
            uint32_t rf1_test_mode          : 2; /* [26:25],        r/w,        0x0 */
            uint32_t reg_mm_spi_master_mode : 1; /* [   27],        r/w,        0x0 */
            uint32_t reg_mm_spi_swap        : 1; /* [   28],        r/w,        0x0 */
            uint32_t audio_test_mode        : 1; /* [   29],        r/w,        0x0 */
            uint32_t sel_rf_audio_test      : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } glb_parm_cfg0;

