XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/glb_reg.h
    /* 0x590  reserved */
    uint8_t RESERVED0x590[48];

    /* 0x5C0 : hw_rsv0 */
    union {
        struct {
            uint32_t rsvd_31_0 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } hw_rsv0;

    /* 0x5C4 : hw_rsv1 */
    union {
        struct {
            uint32_t rsvd_31_0 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } hw_rsv1;

    /* 0x5C8 : hw_rsv2 */
    union {
        struct {
            uint32_t rsvd_31_0 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } hw_rsv2;

    /* 0x5CC : hw_rsv3 */
    union {
        struct {
            uint32_t rsvd_31_0 : 32; /* [31: 0],       rsvd, 0xffffffff */
        } BF;
        uint32_t WORD;
    } hw_rsv3;

    /* 0x5d0  reserved */
    uint8_t RESERVED0x5d0[48];

    /* 0x600 : reg_sram_ret */
    union {
        struct {
            uint32_t cr_mcu_cache_ret : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t cr_mcu_hsram_ret : 4;  /* [ 5: 2],        r/w,        0x0 */
            uint32_t reserved_6_7     : 2;  /* [ 7: 6],       rsvd,        0x0 */
            uint32_t cr_wb_ram_ret    : 1;  /* [    8],        r/w,        0x0 */
            uint32_t cr_misc_ram_ret  : 2;  /* [10: 9],        r/w,        0x0 */
            uint32_t reserved_11_31   : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sram_cfg0;

    /* 0x604 : reg_sram_slp */
    union {
        struct {
            uint32_t cr_mcu_cache_slp : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t cr_mcu_hsram_slp : 4;  /* [ 5: 2],        r/w,        0x0 */
            uint32_t cr_mcu_rom_slp   : 2;  /* [ 7: 6],        r/w,        0x0 */
            uint32_t cr_wb_ram_slp    : 1;  /* [    8],        r/w,        0x0 */
            uint32_t cr_misc_ram_slp  : 2;  /* [10: 9],        r/w,        0x0 */
            uint32_t reserved_11_31   : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sram_cfg1;

    /* 0x608 : reg_sram_parm */
    union {
        struct {
            uint32_t cr_mcu_cache_dvse : 1;  /* [    0],        r/w,        0x0 */
            uint32_t cr_mcu_hsram_dvse : 1;  /* [    1],        r/w,        0x0 */
            uint32_t cr_mcu_rom_dvse   : 1;  /* [    2],        r/w,        0x0 */
            uint32_t cr_wb_ram_dvse    : 1;  /* [    3],        r/w,        0x0 */
            uint32_t cr_misc_ram_dvse  : 1;  /* [    4],        r/w,        0x0 */
            uint32_t cr_ocram_dvse     : 1;  /* [    5],        r/w,        0x0 */
            uint32_t cr_wram_dvse      : 1;  /* [    6],        r/w,        0x0 */
            uint32_t reserved_7        : 1;  /* [    7],       rsvd,        0x0 */
            uint32_t cr_mcu_cache_nap  : 1;  /* [    8],        r/w,        0x0 */
            uint32_t cr_mcu_hsram_nap  : 1;  /* [    9],        r/w,        0x0 */
            uint32_t reserved_10       : 1;  /* [   10],       rsvd,        0x0 */
            uint32_t cr_wb_ram_nap     : 1;  /* [   11],        r/w,        0x0 */
            uint32_t cr_misc_ram_nap   : 1;  /* [   12],        r/w,        0x0 */
            uint32_t cr_ocram_nap      : 1;  /* [   13],        r/w,        0x0 */
            uint32_t cr_wram_nap       : 1;  /* [   14],        r/w,        0x0 */
            uint32_t reserved_15_31    : 17; /* [31:15],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sram_cfg2;

    /* 0x60C : sram_cfg3 */
    union {
        struct {
            uint32_t em_sel         : 8;  /* [ 7: 0],        r/w,        0x3 */
            uint32_t reserved_8_27  : 20; /* [27: 8],       rsvd,        0x0 */
            uint32_t reg_vram_sel   : 2;  /* [29:28],        r/w,        0x0 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sram_cfg3;

    /* 0x610 : reg_sram_parm2 */
    union {
        struct {
            uint32_t cr_mcu_cache_dvs : 4; /* [ 3: 0],        r/w,        0xc */
            uint32_t cr_mcu_hsram_dvs : 4; /* [ 7: 4],        r/w,        0xc */
            uint32_t cr_mcu_rom_dvs   : 4; /* [11: 8],        r/w,        0xc */
            uint32_t cr_wb_ram_dvs    : 4; /* [15:12],        r/w,        0xc */
            uint32_t cr_misc_ram_dvs  : 4; /* [19:16],        r/w,        0xc */
            uint32_t cr_ocram_dvs     : 4; /* [23:20],        r/w,        0xc */
            uint32_t cr_wram_dvs      : 4; /* [27:24],        r/w,        0xc */
            uint32_t reserved_28_31   : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sram_cfg4;

    /* 0x614  reserved */
    uint8_t RESERVED0x614[12];

    /* 0x620 : psram_cfg0 */
    union {
        struct {
            uint32_t reserved_0_26      : 27; /* [26: 0],       rsvd,        0x0 */
            uint32_t reg_psramB_clk_en  : 1;  /* [   27],        r/w,        0x1 */
            uint32_t reg_psramB_clk_sel : 2;  /* [29:28],        r/w,        0x0 */
            uint32_t reg_psramB_clk_div : 2;  /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } psram_cfg0;

    /* 0x624  reserved */
    uint8_t RESERVED0x624[156];

    /* 0x6C0 : ldo28cis */
    union {
        struct {
            uint32_t pu_ldo28cis           : 1; /* [    0],        r/w,        0x1 */
            uint32_t ldo28cis_bypass       : 1; /* [    1],        r/w,        0x0 */
            uint32_t ldo28cis_pulldown     : 1; /* [    2],        r/w,        0x0 */
            uint32_t ldo28cis_pulldown_sel : 1; /* [    3],        r/w,        0x0 */
            uint32_t ldo28cis_bm           : 3; /* [ 6: 4],        r/w,        0x5 */
            uint32_t reserved_7            : 1; /* [    7],       rsvd,        0x0 */
            uint32_t ldo28cis_cc           : 3; /* [10: 8],        r/w,        0x3 */
            uint32_t ldo28cis_ocp_out      : 1; /* [   11],          r,        0x0 */
            uint32_t ldo28cis_ocp_th       : 3; /* [14:12],        r/w,        0x3 */
            uint32_t ldo28cis_ocp_en       : 1; /* [   15],        r/w,        0x1 */
            uint32_t ldo28cis_sstart_delay : 3; /* [18:16],        r/w,        0x2 */
            uint32_t ldo28cis_sstart_en    : 1; /* [   19],        r/w,        0x1 */
            uint32_t ldo28cis_vout_sel     : 4; /* [23:20],        r/w,        0x3 */
            uint32_t ldo28cis_vout_trim    : 4; /* [27:24],        r/w,        0x8 */
            uint32_t reserved_28_31        : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ldo28cis;

    /* 0x6C4 : ldo18io */
    union {
        struct {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ldo18io;

