XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/glb_reg.h
    /* 0x6C8 : ldo15cis */
    union {
        struct {
            uint32_t pu_ldo15cis           : 1; /* [    0],        r/w,        0x1 */
            uint32_t ldo15cis_bypass       : 1; /* [    1],        r/w,        0x0 */
            uint32_t ldo15cis_pulldown     : 1; /* [    2],        r/w,        0x0 */
            uint32_t ldo15cis_pulldown_sel : 1; /* [    3],        r/w,        0x0 */
            uint32_t ldo15cis_bm           : 3; /* [ 6: 4],        r/w,        0x2 */
            uint32_t reserved_7            : 1; /* [    7],       rsvd,        0x0 */
            uint32_t ldo15cis_cc           : 3; /* [10: 8],        r/w,        0x3 */
            uint32_t ldo15cis_ocp_out      : 1; /* [   11],          r,        0x0 */
            uint32_t ldo15cis_ocp_th       : 3; /* [14:12],        r/w,        0x3 */
            uint32_t ldo15cis_ocp_en       : 1; /* [   15],        r/w,        0x1 */
            uint32_t ldo15cis_sstart_delay : 3; /* [18:16],        r/w,        0x2 */
            uint32_t ldo15cis_sstart_en    : 1; /* [   19],        r/w,        0x1 */
            uint32_t ldo15cis_vout_sel     : 4; /* [23:20],        r/w,        0x8 */
            uint32_t ldo15cis_vout_trim    : 4; /* [27:24],        r/w,        0x8 */
            uint32_t reserved_28_31        : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ldo15cis;

    /* 0x6CC : ldo18flash */
    union {
        struct {
            uint32_t pu_ldo18flash           : 1; /* [    0],        r/w,        0x0 */
            uint32_t ldo18flash_bypass       : 1; /* [    1],        r/w,        0x0 */
            uint32_t ldo18flash_pulldown     : 1; /* [    2],        r/w,        0x0 */
            uint32_t ldo18flash_pulldown_sel : 1; /* [    3],        r/w,        0x0 */
            uint32_t ldo18flash_bm           : 3; /* [ 6: 4],        r/w,        0x3 */
            uint32_t reserved_7              : 1; /* [    7],       rsvd,        0x0 */
            uint32_t ldo18flash_cc           : 3; /* [10: 8],        r/w,        0x3 */
            uint32_t ldo18flash_ocp_out      : 1; /* [   11],          r,        0x0 */
            uint32_t ldo18flash_ocp_th       : 3; /* [14:12],        r/w,        0x3 */
            uint32_t ldo18flash_ocp_en       : 1; /* [   15],        r/w,        0x1 */
            uint32_t ldo18flash_sstart_delay : 3; /* [18:16],        r/w,        0x3 */
            uint32_t ldo18flash_sstart_en    : 1; /* [   19],        r/w,        0x1 */
            uint32_t ldo18flash_vout_sel     : 4; /* [23:20],        r/w,        0x3 */
            uint32_t ldo18flash_vout_trim    : 4; /* [27:24],        r/w,        0x7 */
            uint32_t reserved_28_31          : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ldo18flash;

    /* 0x6D0 : ldo12uhs */
    union {
        struct {
            uint32_t pu_ldo12uhs           : 1; /* [    0],        r/w,        0x0 */
            uint32_t ldo12uhs_bypass       : 1; /* [    1],        r/w,        0x0 */
            uint32_t ldo12uhs_pulldown     : 1; /* [    2],        r/w,        0x0 */
            uint32_t ldo12uhs_pulldown_sel : 1; /* [    3],        r/w,        0x0 */
            uint32_t ldo12uhs_bm           : 3; /* [ 6: 4],        r/w,        0x2 */
            uint32_t reserved_7            : 1; /* [    7],       rsvd,        0x0 */
            uint32_t ldo12uhs_cc           : 3; /* [10: 8],        r/w,        0x3 */
            uint32_t ldo12uhs_ocp_out      : 1; /* [   11],          r,        0x0 */
            uint32_t ldo12uhs_ocp_th       : 3; /* [14:12],        r/w,        0x3 */
            uint32_t ldo12uhs_ocp_en       : 1; /* [   15],        r/w,        0x1 */
            uint32_t ldo12uhs_sstart_delay : 3; /* [18:16],        r/w,        0x2 */
            uint32_t ldo12uhs_sstart_en    : 1; /* [   19],        r/w,        0x1 */
            uint32_t ldo12uhs_vout_sel     : 4; /* [23:20],        r/w,        0x3 */
            uint32_t ldo12uhs_vout_trim    : 4; /* [27:24],        r/w,        0x8 */
            uint32_t reserved_28_31        : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ldo12uhs;

    /* 0x6d4  reserved */
    uint8_t RESERVED0x6d4[28];

    /* 0x6F0 : proc_mon */
    union {
        struct {
            uint32_t pu_proc_mon         : 1;  /* [    0],        r/w,        0x0 */
            uint32_t osc_en_rvt          : 1;  /* [    1],        r/w,        0x0 */
            uint32_t osc_en_lvt          : 1;  /* [    2],        r/w,        0x0 */
            uint32_t osc_sel             : 1;  /* [    3],        r/w,        0x0 */
            uint32_t rstn_ringcount      : 1;  /* [    4],        r/w,        0x0 */
            uint32_t rstn_refcount       : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7        : 2;  /* [ 7: 6],       rsvd,        0x0 */
            uint32_t refcount_div_onehot : 4;  /* [11: 8],        r/w,        0x4 */
            uint32_t ring_freq           : 16; /* [27:12],          r,        0x0 */
            uint32_t ring_freq_rdy       : 1;  /* [   28],          r,        0x0 */
            uint32_t reserved_29_31      : 3;  /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } proc_mon;

    /* 0x6f4  reserved */
    uint8_t RESERVED0x6f4[12];

    /* 0x700 : dll_cfg0 */
    union {
        struct {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dll_cfg0;

    /* 0x704  reserved */
    uint8_t RESERVED0x704[140];

    /* 0x790 : mipi_pll_cfg0 */
    union {
        struct {
            uint32_t mipipll_sdm_rstb  : 1;  /* [    0],        r/w,        0x1 */
            uint32_t reserved_1        : 1;  /* [    1],       rsvd,        0x0 */
            uint32_t mipipll_fbdv_rstb : 1;  /* [    2],        r/w,        0x1 */
            uint32_t reserved_3_4      : 2;  /* [ 4: 3],       rsvd,        0x0 */
            uint32_t pu_mipipll_fbdv   : 1;  /* [    5],        r/w,        0x1 */
            uint32_t reserved_6_7      : 2;  /* [ 7: 6],       rsvd,        0x0 */
            uint32_t pu_mipipll_cp     : 1;  /* [    8],        r/w,        0x1 */
            uint32_t pu_mipipll_sfreg  : 1;  /* [    9],        r/w,        0x0 */
            uint32_t pu_mipipll        : 1;  /* [   10],        r/w,        0x0 */
            uint32_t reserved_11_31    : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mipi_pll_cfg0;

    /* 0x794 : mipi_pll_cfg1 */
    union {
        struct {
            uint32_t mipipll_even_div_ratio : 7; /* [ 6: 0],        r/w,       0x32 */
            uint32_t mipipll_even_div_en    : 1; /* [    7],        r/w,        0x0 */
            uint32_t mipipll_refdiv_ratio   : 4; /* [11: 8],        r/w,        0x2 */
            uint32_t reserved_12_15         : 4; /* [15:12],       rsvd,        0x0 */
            uint32_t mipipll_refclk_sel     : 2; /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_19         : 2; /* [19:18],       rsvd,        0x0 */
            uint32_t mipipll_vg11_sel       : 2; /* [21:20],        r/w,        0x1 */
            uint32_t reserved_22_23         : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t mipipll_vg13_sel       : 2; /* [25:24],        r/w,        0x1 */
            uint32_t reserved_26_31         : 6; /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mipi_pll_cfg1;

    /* 0x798 : mipi_pll_cfg2 */
    union {
        struct {
            uint32_t mipipll_sel_cp_bias   : 1;  /* [    0],        r/w,        0x1 */
            uint32_t reserved_1_3          : 3;  /* [ 3: 1],       rsvd,        0x0 */
            uint32_t mipipll_icp_5u        : 2;  /* [ 5: 4],        r/w,        0x3 */
            uint32_t mipipll_icp_1u        : 2;  /* [ 7: 6],        r/w,        0x0 */
            uint32_t mipipll_int_frac_sw   : 1;  /* [    8],        r/w,        0x0 */
            uint32_t mipipll_cp_startup_en : 1;  /* [    9],        r/w,        0x1 */
            uint32_t mipipll_cp_opamp_en   : 1;  /* [   10],        r/w,        0x1 */
            uint32_t mipipll_cp_ota_en     : 1;  /* [   11],        r/w,        0x1 */
            uint32_t mipipll_pfd_en        : 1;  /* [   12],        r/w,        0x1 */
            uint32_t reserved_13_31        : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mipi_pll_cfg2;

    /* 0x79C : mipi_pll_cfg3 */
    union {
        struct {
            uint32_t mipipll_c4_en        : 1;  /* [    0],        r/w,        0x1 */
            uint32_t reserved_1_3         : 3;  /* [ 3: 1],       rsvd,        0x0 */
            uint32_t mipipll_r4           : 2;  /* [ 5: 4],        r/w,        0x1 */
            uint32_t reserved_6_7         : 2;  /* [ 7: 6],       rsvd,        0x0 */
            uint32_t mipipll_r4_short     : 1;  /* [    8],        r/w,        0x0 */
            uint32_t reserved_9_11        : 3;  /* [11: 9],       rsvd,        0x0 */
            uint32_t mipipll_c3           : 2;  /* [13:12],        r/w,        0x2 */
            uint32_t mipipll_cz           : 2;  /* [15:14],        r/w,        0x2 */
            uint32_t mipipll_rz           : 3;  /* [18:16],        r/w,        0x1 */
            uint32_t mipipll_lf_test_en   : 1;  /* [   19],        r/w,        0x0 */
            uint32_t mipipll_fast_lock_en : 1;  /* [   20],        r/w,        0x1 */
            uint32_t reserved_21_31       : 11; /* [31:21],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mipi_pll_cfg3;

    /* 0x7A0 : mipi_pll_cfg4 */
    union {
        struct {
            uint32_t mipipll_sel_sample_clk  : 2;  /* [ 1: 0],        r/w,        0x1 */
            uint32_t reserved_2_3            : 2;  /* [ 3: 2],       rsvd,        0x0 */
            uint32_t mipipll_sel_fb_clk      : 2;  /* [ 5: 4],        r/w,        0x1 */
            uint32_t reserved_6_7            : 2;  /* [ 7: 6],       rsvd,        0x0 */
            uint32_t mipipll_lock_det_en     : 1;  /* [    8],        r/w,        0x1 */
            uint32_t mipipll_lock_clk_sel    : 2;  /* [10: 9],        r/w,        0x1 */
            uint32_t reserved_11             : 1;  /* [   11],       rsvd,        0x0 */
            uint32_t mipipll_lock_clk_inv_en : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_14          : 2;  /* [14:13],       rsvd,        0x0 */
            uint32_t mipipll_lock_win_sel    : 2;  /* [16:15],        r/w,        0x1 */
            uint32_t reserved_17_31          : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mipi_pll_cfg4;

    /* 0x7A4 : mipi_pll_cfg5 */
    union {
        struct {
            uint32_t mipipll_vco_speed          : 3;  /* [ 2: 0],        r/w,        0x5 */
            uint32_t mipipll_vco_vdd_ctrl       : 2;  /* [ 4: 3],        r/w,        0x2 */
            uint32_t mipipll_vco_vdd_ctrl_extra : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6                 : 1;  /* [    6],       rsvd,        0x0 */
            uint32_t mipipll_vco_postdiv_sel    : 3;  /* [ 9: 7],        r/w,        0x0 */
            uint32_t mipipll_vco_postdiv_clk_en : 1;  /* [   10],        r/w,        0x1 */
            uint32_t reserved_11_31             : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mipi_pll_cfg5;

    /* 0x7A8 : mipi_pll_cfg6 */
    union {
        struct {
            uint32_t mipipll_sdmin      : 19; /* [18: 0],        r/w,    0x25800 */
            uint32_t reserved_19_23     : 5;  /* [23:19],       rsvd,        0x0 */
            uint32_t mipipll_sdm_bypass : 1;  /* [   24],        r/w,        0x0 */
            uint32_t reserved_25_31     : 7;  /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mipi_pll_cfg6;

    /* 0x7AC : mipi_pll_cfg7 */
    union {
        struct {
            uint32_t mipipll_sdm_order_sel : 1;  /* [    0],        r/w,        0x1 */
            uint32_t mipipll_sdm_dith_sel  : 2;  /* [ 2: 1],        r/w,        0x0 */
            uint32_t reserved_3_31         : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mipi_pll_cfg7;

    /* 0x7B0 : mipi_pll_cfg8 */
    union {
        struct {
            uint32_t mipipll_dc_tp_out_en    : 1;  /* [    0],        r/w,        0x0 */
            uint32_t mipipll_ten             : 1;  /* [    1],        r/w,        0x0 */
            uint32_t mipipll_ten_sfreg       : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3              : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t mipipll_dten_ckin       : 1;  /* [    4],        r/w,        0x0 */
            uint32_t mipipll_dten_fref       : 1;  /* [    5],        r/w,        0x0 */
            uint32_t mipipll_dten_fsdm       : 1;  /* [    6],        r/w,        0x0 */
            uint32_t mipipll_dten_pupll      : 1;  /* [    7],        r/w,        0x0 */
            uint32_t mipipll_dten_pll_locked : 1;  /* [    8],        r/w,        0x0 */
            uint32_t reserved_9              : 1;  /* [    9],       rsvd,        0x0 */
            uint32_t mipipll_dtest_pull_down : 1;  /* [   10],        r/w,        0x1 */
            uint32_t reserved_11_31          : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mipi_pll_cfg8;

    /* 0x7B4 : mipi_pll_cfg9 */
    union {
        struct {
            uint32_t mipipll_ssc_en            : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_3              : 3;  /* [ 3: 1],       rsvd,        0x0 */
            uint32_t mipipll_ssc_cnt           : 8;  /* [11: 4],        r/w,       0x64 */
            uint32_t mipipll_ssc_gain          : 3;  /* [14:12],        r/w,        0x5 */
            uint32_t reserved_15               : 1;  /* [   15],       rsvd,        0x0 */
            uint32_t mipipll_ssc_start_gate_en : 1;  /* [   16],        r/w,        0x1 */
            uint32_t reserved_17_31            : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mipi_pll_cfg9;

    /* 0x7b8  reserved */
    uint8_t RESERVED0x7b8[24];

