XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/glb_reg.h
    /* 0x820 : wifi_pll_cfg4 */
    union {
        struct {
            uint32_t wifipll_sel_sample_clk : 2;  /* [ 1: 0],        r/w,        0x1 */
            uint32_t reserved_2_3           : 2;  /* [ 3: 2],       rsvd,        0x0 */
            uint32_t wifipll_sel_fb_clk     : 2;  /* [ 5: 4],        r/w,        0x1 */
            uint32_t reserved_6_7           : 2;  /* [ 7: 6],       rsvd,        0x0 */
            uint32_t wifipll_sdmclk_sel     : 1;  /* [    8],        r/w,        0x1 */
            uint32_t reserved_9_31          : 23; /* [31: 9],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } wifi_pll_cfg4;

    /* 0x824 : wifi_pll_cfg5 */
    union {
        struct {
            uint32_t wifipll_vco_speed   : 3;  /* [ 2: 0],        r/w,        0x5 */
            uint32_t reserved_3          : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t wifipll_vco_div1_en : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_7        : 3;  /* [ 7: 5],       rsvd,        0x0 */
            uint32_t wifipll_vco_div2_en : 1;  /* [    8],        r/w,        0x1 */
            uint32_t reserved_9_11       : 3;  /* [11: 9],       rsvd,        0x0 */
            uint32_t wifipll_vco_div3_en : 1;  /* [   12],        r/w,        0x1 */
            uint32_t reserved_13_31      : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } wifi_pll_cfg5;

    /* 0x828 : wifi_pll_cfg6 */
    union {
        struct {
            uint32_t wifipll_sdmin         : 26; /* [25: 0],        r/w,  0x1800000 */
            uint32_t reserved_26_27        : 2;  /* [27:26],       rsvd,        0x0 */
            uint32_t wifipll_sdm_bypass    : 1;  /* [   28],        r/w,        0x0 */
            uint32_t wifipll_sdm_bypass_hw : 1;  /* [   29],          r,        0x0 */
            uint32_t reserved_30           : 1;  /* [   30],       rsvd,        0x0 */
            uint32_t wifipll_sdm_ctrl_hw   : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } wifi_pll_cfg6;

    /* 0x82C : wifi_pll_cfg7 */
    union {
        struct {
            uint32_t wifipll_sdm_order_sel    : 2;  /* [ 1: 0],        r/w,        0x2 */
            uint32_t reserved_2_3             : 2;  /* [ 3: 2],       rsvd,        0x0 */
            uint32_t wifipll_sdm_noi_prbs_sel : 2;  /* [ 5: 4],        r/w,        0x3 */
            uint32_t reserved_6_7             : 2;  /* [ 7: 6],       rsvd,        0x0 */
            uint32_t wifipll_sdm_noi_prbs_en  : 1;  /* [    8],        r/w,        0x0 */
            uint32_t reserved_9_11            : 3;  /* [11: 9],       rsvd,        0x0 */
            uint32_t wifipll_sdm_sig_prbs_sel : 2;  /* [13:12],        r/w,        0x0 */
            uint32_t reserved_14_15           : 2;  /* [15:14],       rsvd,        0x0 */
            uint32_t wifipll_sdm_sig_dith_sel : 2;  /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_31           : 14; /* [31:18],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } wifi_pll_cfg7;

    /* 0x830 : wifi_pll_cfg8 */
    union {
        struct {
            uint32_t wifipll_en_div2         : 1;  /* [    0],        r/w,        0x1 */
            uint32_t wifipll_en_div4         : 1;  /* [    1],        r/w,        0x1 */
            uint32_t wifipll_en_div5         : 1;  /* [    2],        r/w,        0x1 */
            uint32_t wifipll_en_div6         : 1;  /* [    3],        r/w,        0x1 */
            uint32_t wifipll_en_div8         : 1;  /* [    4],        r/w,        0x1 */
            uint32_t wifipll_en_div10        : 1;  /* [    5],        r/w,        0x1 */
            uint32_t wifipll_en_div12        : 1;  /* [    6],        r/w,        0x1 */
            uint32_t wifipll_en_div20        : 1;  /* [    7],        r/w,        0x1 */
            uint32_t wifipll_en_div30        : 1;  /* [    8],        r/w,        0x1 */
            uint32_t wifipll_sel_div2_div4   : 1;  /* [    9],        r/w,        0x0 */
            uint32_t en_wifipll_div30_bz_adc : 1;  /* [   10],        r/w,        0x0 */
            uint32_t reserved_11             : 1;  /* [   11],       rsvd,        0x0 */
            uint32_t wifipll_en_div2_hw      : 1;  /* [   12],          r,        0x1 */
            uint32_t reserved_13_30          : 18; /* [30:13],       rsvd,        0x0 */
            uint32_t wifipll_en_ctrl_hw      : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } wifi_pll_cfg8;

    /* 0x834 : wifi_pll_cfg9 */
    union {
        struct {
            uint32_t wifipll_dc_tp_out_en     : 1;  /* [    0],        r/w,        0x0 */
            uint32_t ten_wifipll              : 1;  /* [    1],        r/w,        0x0 */
            uint32_t ten_wifipll_sfreg        : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3               : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t dten_wifipll_fin         : 1;  /* [    4],        r/w,        0x0 */
            uint32_t dten_wifipll_fref        : 1;  /* [    5],        r/w,        0x0 */
            uint32_t dten_wifipll_fsdm        : 1;  /* [    6],        r/w,        0x0 */
            uint32_t dten_wifipll_div30       : 1;  /* [    7],        r/w,        0x0 */
            uint32_t dten_wifipll_div10       : 1;  /* [    8],        r/w,        0x0 */
            uint32_t dten_wifipll_postdiv_clk : 1;  /* [    9],        r/w,        0x0 */
            uint32_t usbpll_dtest_pclk_en     : 1;  /* [   10],        r/w,        0x0 */
            uint32_t usbpll_dtest_clkout_en   : 1;  /* [   11],        r/w,        0x0 */
            uint32_t dtest_wifipll_pulldown   : 1;  /* [   12],        r/w,        0x1 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } wifi_pll_cfg9;

