XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/glb_reg.h
    /* 0x8C8 : gpio_cfg1 */
    union {
        struct {
            uint32_t reg_gpio_1_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_1_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_1_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_1_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_1_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_1_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7              : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_1_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15          : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_1_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_1_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_1_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_1_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23             : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_1_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_1_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_1_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27             : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_1_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29             : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_1_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg1;

    /* 0x8CC : gpio_cfg2 */
    union {
        struct {
            uint32_t reg_gpio_2_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_2_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_2_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_2_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_2_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_2_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7              : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_2_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15          : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_2_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_2_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_2_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_2_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23             : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_2_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_2_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_2_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27             : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_2_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29             : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_2_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg2;

    /* 0x8D0 : gpio_cfg3 */
    union {
        struct {
            uint32_t reg_gpio_3_ie           : 1; /* [    0],        r/w,        0x1 */
            uint32_t reg_gpio_3_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_3_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_3_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_3_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_3_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7              : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_3_func_sel     : 5; /* [12: 8],        r/w,        0xf */
            uint32_t reserved_13_15          : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_3_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_3_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_3_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_3_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23             : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_3_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_3_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_3_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27             : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_3_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29             : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_3_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg3;

    /* 0x8D4 : gpio_cfg4 */
    union {
        struct {
            uint32_t reg_gpio_4_ie           : 1; /* [    0],        r/w,        0x1 */
            uint32_t reg_gpio_4_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_4_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_4_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_4_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_4_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7              : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_4_func_sel     : 5; /* [12: 8],        r/w,        0xf */
            uint32_t reserved_13_15          : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_4_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_4_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_4_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_4_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23             : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_4_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_4_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_4_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27             : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_4_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29             : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_4_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg4;

