XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/glb_reg.h
    /* 0x950 : gpio_cfg35 */
    union {
        struct {
            uint32_t reg_gpio_35_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_35_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_35_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_35_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_35_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_35_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_35_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_35_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_35_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_35_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_35_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_35_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_35_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_35_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_35_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_35_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg35;

    /* 0x954 : gpio_cfg36 */
    union {
        struct {
            uint32_t reg_gpio_36_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_36_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_36_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_36_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_36_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_36_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_36_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_36_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_36_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_36_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_36_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_36_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_36_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_36_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_36_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_36_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg36;

    /* 0x958 : gpio_cfg37 */
    union {
        struct {
            uint32_t reg_gpio_37_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_37_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_37_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_37_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_37_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_37_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_37_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_37_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_37_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_37_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_37_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_37_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_37_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_37_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_37_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_37_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg37;

    /* 0x95C : gpio_cfg38 */
    union {
        struct {
            uint32_t reg_gpio_38_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_38_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_38_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_38_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_38_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_38_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_38_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_38_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_38_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_38_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_38_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_38_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_38_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_38_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_38_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_38_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg38;

    /* 0x960 : gpio_cfg39 */
    union {
        struct {
            uint32_t reg_gpio_39_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_39_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_39_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_39_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_39_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_39_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_39_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_39_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_39_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_39_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_39_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_39_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_39_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_39_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_39_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_39_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg39;

    /* 0x964 : gpio_cfg40 */
    union {
        struct {
            uint32_t reg_gpio_40_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_40_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_40_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_40_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_40_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_40_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_40_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_40_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_40_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_40_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_40_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_40_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_40_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_40_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_40_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_40_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg40;

    /* 0x968 : gpio_cfg41 */
    union {
        struct {
            uint32_t reg_gpio_41_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_41_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_41_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_41_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_41_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_41_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_41_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_41_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_41_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_41_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_41_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_41_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_41_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_41_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_41_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_41_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg41;

