XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/glb_reg.h
    /* 0x96C : gpio_cfg42 */
    union {
        struct {
            uint32_t reg_gpio_42_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_42_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_42_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_42_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_42_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_42_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_42_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_42_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_42_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_42_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_42_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_42_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_42_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_42_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_42_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_42_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg42;

    /* 0x970 : gpio_cfg43 */
    union {
        struct {
            uint32_t reg_gpio_43_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_43_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_43_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_43_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_43_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_43_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_43_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_43_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_43_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_43_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_43_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_43_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_43_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_43_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_43_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_43_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg43;

    /* 0x974 : gpio_cfg44 */
    union {
        struct {
            uint32_t reg_gpio_44_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_44_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_44_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_44_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_44_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_44_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_44_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_44_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_44_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_44_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_44_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_44_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_44_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_44_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_44_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_44_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg44;

    /* 0x978 : gpio_cfg45 */
    union {
        struct {
            uint32_t reg_gpio_45_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_45_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_45_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_45_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_45_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_45_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_45_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_45_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_45_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_45_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_45_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_45_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_45_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_45_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_45_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_45_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg45;

    /* 0x97C : gpio_cfg46 */
    union {
        struct {
            uint32_t reg_gpio_46_ie  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_46_smt : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_46_drv : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_46_pu  : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_46_pd  : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_31   : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg46;

