XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/glb_reg.h
    /* 0xAF8 : gpio_cfg141 */
    union {
        struct {
            uint32_t reg2_gpio_32_clr : 1;  /* [    0],        w1p,        0x0 */
            uint32_t reg2_gpio_33_clr : 1;  /* [    1],        w1p,        0x0 */
            uint32_t reg2_gpio_34_clr : 1;  /* [    2],        w1p,        0x0 */
            uint32_t reg2_gpio_35_clr : 1;  /* [    3],        w1p,        0x0 */
            uint32_t reg2_gpio_36_clr : 1;  /* [    4],        w1p,        0x0 */
            uint32_t reg2_gpio_37_clr : 1;  /* [    5],        w1p,        0x0 */
            uint32_t reg2_gpio_38_clr : 1;  /* [    6],        w1p,        0x0 */
            uint32_t reg2_gpio_39_clr : 1;  /* [    7],        w1p,        0x0 */
            uint32_t reg2_gpio_40_clr : 1;  /* [    8],        w1p,        0x0 */
            uint32_t reg2_gpio_41_clr : 1;  /* [    9],        w1p,        0x0 */
            uint32_t reg2_gpio_42_clr : 1;  /* [   10],        w1p,        0x0 */
            uint32_t reg2_gpio_43_clr : 1;  /* [   11],        w1p,        0x0 */
            uint32_t reg2_gpio_44_clr : 1;  /* [   12],        w1p,        0x0 */
            uint32_t reg2_gpio_45_clr : 1;  /* [   13],        w1p,        0x0 */
            uint32_t reserved_14_31   : 18; /* [31:14],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg141;

    /* 0xAFC : gpio_cfg142 */
    union {
        struct {
            uint32_t cr_gpio_tx_en        : 1; /* [    0],        r/w,        0x0 */
            uint32_t cr_invert_code0_high : 1; /* [    1],        r/w,        0x0 */
            uint32_t cr_invert_code1_high : 1; /* [    2],        r/w,        0x0 */
            uint32_t reserved_3_6         : 4; /* [ 6: 3],       rsvd,        0x0 */
            uint32_t cr_code_total_time   : 9; /* [15: 7],        r/w,      0x190 */
            uint32_t cr_code0_high_time   : 8; /* [23:16],        r/w,       0xc8 */
            uint32_t cr_code1_high_time   : 8; /* [31:24],        r/w,       0xc8 */
        } BF;
        uint32_t WORD;
    } gpio_cfg142;

    /* 0xB00 : gpio_cfg143 */
    union {
        struct {
            uint32_t cr_gpio_dma_tx_en         : 1; /* [    0],        r/w,        0x0 */
            uint32_t cr_gpio_dma_out_sel_latch : 1; /* [    1],        r/w,        0x0 */
            uint32_t gpio_tx_fifo_clr          : 1; /* [    2],        w1c,        0x0 */
            uint32_t gpio_tx_end_clr           : 1; /* [    3],        w1c,        0x0 */
            uint32_t gpio_tx_fifo_overflow     : 1; /* [    4],          r,        0x0 */
            uint32_t gpio_tx_fifo_underflow    : 1; /* [    5],          r,        0x0 */
            uint32_t reserved_6                : 1; /* [    6],       rsvd,        0x0 */
            uint32_t cr_gpio_dma_park_value    : 1; /* [    7],        r/w,        0x0 */
            uint32_t gpio_tx_fifo_cnt          : 8; /* [15: 8],          r,       0x80 */
            uint32_t cr_gpio_tx_fifo_th        : 7; /* [22:16],        r/w,        0x0 */
            uint32_t cr_gpio_tx_end_mask       : 1; /* [   23],        r/w,        0x1 */
            uint32_t cr_gpio_tx_fifo_mask      : 1; /* [   24],        r/w,        0x1 */
            uint32_t cr_gpio_tx_fer_mask       : 1; /* [   25],        r/w,        0x1 */
            uint32_t r_gpio_tx_end_int         : 1; /* [   26],          r,        0x0 */
            uint32_t r_gpio_tx_fifo_int        : 1; /* [   27],          r,        0x0 */
            uint32_t r_gpio_tx_fer_int         : 1; /* [   28],          r,        0x0 */
            uint32_t cr_gpio_tx_end_en         : 1; /* [   29],        r/w,        0x1 */
            uint32_t cr_gpio_tx_fifo_en        : 1; /* [   30],        r/w,        0x1 */
            uint32_t cr_gpio_tx_fer_en         : 1; /* [   31],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } gpio_cfg143;

    /* 0xB04 : gpio_cfg144 */
    union {
        struct {
            uint32_t gpio_tx_data_to_fifo : 16; /* [15: 0],          w,          x */
            uint32_t reserved_16_31       : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg144;
};

typedef volatile struct glb_reg glb_reg_t;

#endif /* __GLB_REG_H__ */
